--
-- PostgreSQL database dump
--

\restrict W0mY9adRYBKAOj53a10Nt8YNM1KCsjq3U5rn4gaIPnmKPl5NxXT4WgeD2XByH6W

-- Dumped from database version 14.20 (Homebrew)
-- Dumped by pg_dump version 14.20 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: corporate_actions; Type: TABLE DATA; Schema: public; Owner: home
--

COPY public.corporate_actions (id, symbol, action_type, announcement_date, ex_date, record_date, payment_date, amount, currency, description, created_at) FROM stdin;
1	2080	توزيع أرباح نقدية	2025-12-10	2026-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.679271
2	9594	توزيع أرباح نقدية	2025-12-14	2026-02-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.684947
3	9594	توزيع أرباح نقدية	2025-12-14	2026-01-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.685518
4	4324	توزيع أرباح نقدية	2025-12-21	2026-01-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.685964
5	9624	توزيع أرباح نقدية	2025-11-19	2026-01-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.686367
6	2081	توزيع أرباح نقدية	2025-12-21	2026-01-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.686779
7	6016	توزيع أسهم خزينة كأسهم منحة	2025-03-02	2026-01-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.687271
8	4280	توزيع أرباح نقدية	2025-03-17	2026-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.687638
9	9595	توزيع أسهم خزينة كأسهم منحة	2025-11-25	2025-12-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.688087
10	6040	تخفيض رأس مال - بتخفيض عدد الأسهم	2025-04-03	2025-12-15	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:05.688464
11	9591	توزيع أسهم خزينة كأسهم منحة	2025-04-14	2025-12-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.688878
12	4084	توزيع أرباح نقدية	2025-12-03	2025-12-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.689409
13	3040	توزيع أرباح نقدية	2025-11-19	2025-12-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.689792
14	4194	توزيع أرباح نقدية	2025-09-01	2025-12-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.690138
15	4161	توزيع أرباح نقدية	2025-11-10	2025-12-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.690492
16	4002	توزيع أرباح نقدية	2025-09-01	2025-12-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.691364
17	2310	توزيع أرباح نقدية	2025-11-26	2025-12-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.691625
18	4331	توزيع أرباح نقدية	2025-11-26	2025-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.691939
19	2320	توزيع أرباح نقدية	2025-11-05	2025-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.692518
20	2320	توزيع أرباح نقدية	2025-11-05	2025-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.692867
21	9594	توزيع أرباح نقدية	2025-09-22	2025-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.69317
22	4347	توزيع أرباح نقدية	2025-11-25	2025-11-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.693446
23	3007	تجزئة أسهم	2025-08-19	2025-11-19	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:05.693716
24	2222	توزيع أرباح نقدية	2025-11-04	2025-11-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.693965
25	4070	تخفيض رأس مال - بتخفيض عدد الأسهم	2025-03-25	2025-11-18	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:05.69421
26	9587	تجزئة أسهم	2025-10-21	2025-11-13	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:05.694455
27	4348	توزيع أرباح نقدية	2025-10-30	2025-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.694693
28	4180	توزيع أرباح نقدية	2025-10-28	2025-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.694933
29	7010	توزيع أرباح نقدية	2025-11-03	2025-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.6952
30	9636	توزيع أرباح نقدية	2025-08-26	2025-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.695445
31	2130	زيادة رأس مال - إصدار حقوق أولوية	2024-05-28	2025-11-09	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:05.695682
32	9571	توزيع أسهم خزينة كأسهم منحة	2025-09-04	2025-11-06	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.695925
33	6012	تخفيض رأس مال - بتخفيض عدد الأسهم	2025-05-29	2025-11-05	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:05.696158
34	1830	توزيع أرباح نقدية	2025-10-28	2025-11-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.696403
35	4339	توزيع أرباح نقدية	2025-10-23	2025-11-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.696642
36	1321	توزيع أرباح نقدية	2025-10-27	2025-10-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.696889
37	9594	توزيع أرباح نقدية	2025-09-22	2025-10-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.697127
38	4340	توزيع أرباح نقدية	2025-10-19	2025-10-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.697361
39	9637	توزيع أرباح نقدية	2025-08-21	2025-10-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.697588
40	8270	إلغاء الإدراج	2025-10-27	2025-10-27	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2025-10-27	2025-12-25 15:06:05.697818
41	9594	توزيع أسهم خزينة كأسهم منحة	2025-04-28	2025-10-27	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.698047
42	8030	زيادة رأس مال - اكتتاب خاص	2025-07-27	2025-10-26	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:05.698288
43	4021	تعديل رمز التداول	2025-10-20	2025-10-22	\N	\N	\N	SAR	تم تعديل رمز التداول من 9518 إلى 4021	2025-12-25 15:06:05.698516
44	4021	تحويل الشركة من سوق ﻵخر	2025-10-16	2025-10-22	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2025-10-22	2025-12-25 15:06:05.698748
45	4194	توزيع أرباح نقدية	2025-09-01	2025-10-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.698973
46	4170	تجميع أسهم	2025-07-27	2025-10-21	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:05.699199
47	6070	توزيع أرباح نقدية	2025-08-17	2025-10-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.699496
48	8240	توزيع أسهم خزينة كأسهم منحة	2025-05-22	2025-10-16	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.699748
49	4021	توزيع أرباح نقدية	2025-08-17	2025-10-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.700031
50	8200	زيادة رأس مال - اكتتاب خاص	2025-09-18	2025-10-12	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:05.700309
51	8200	توزيع أسهم خزينة كأسهم منحة	2025-03-16	2025-10-12	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.700641
52	4146	تعديل رمز التداول	2025-10-07	2025-10-09	\N	\N	\N	SAR	تم تعديل رمز التداول من 9528 إلى 4146	2025-12-25 15:06:05.700983
53	4146	تحويل الشركة من سوق ﻵخر	2024-01-03	2025-10-09	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2025-10-09	2025-12-25 15:06:05.70129
54	3004	توزيع أرباح نقدية	2025-09-28	2025-10-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.701604
55	9511	توزيع أرباح نقدية	2025-08-03	2025-10-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.702767
56	2223	توزيع أرباح نقدية	2025-08-03	2025-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.703068
57	4280	توزيع أرباح نقدية	2025-03-17	2025-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.70497
58	2170	توزيع أرباح نقدية	2025-09-21	2025-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.705402
59	1322	توزيع أرباح نقدية	2025-09-09	2025-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.705815
60	4321	توزيع أرباح نقدية	2025-08-13	2025-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.706234
61	9594	توزيع أرباح نقدية	2025-09-22	2025-09-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.706589
62	4142	توزيع أرباح نقدية	2025-09-10	2025-09-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.706966
63	2380	زيادة رأس مال - اكتتاب خاص	2025-08-31	2025-09-30	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:05.707359
64	4322	توزيع أرباح نقدية	2025-08-04	2025-09-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.707789
65	4150	توزيع أرباح نقدية	2025-09-17	2025-09-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.708173
66	2270	توزيع أرباح نقدية	2025-09-22	2025-09-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.708472
67	7040	توزيع أرباح نقدية	2025-06-29	2025-09-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.708788
68	9608	توزيع أسهم خزينة كأسهم منحة	2025-05-15	2025-09-25	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:05.709106
69	4144	توزيع أرباح نقدية	2025-12-04	2025-09-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.709426
70	1120	توزيع أرباح نقدية	2025-09-15	2025-09-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.709748
71	9521	تغيير اسم الشركة	2025-09-21	2025-09-21	\N	\N	\N	SAR	تم تعديل اسم الشركة من ENMA ALRAWABI إلى INMAR	2025-12-25 15:06:05.710061
72	9571	توزيع أرباح نقدية	2025-09-03	2025-09-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.710364
73	2150	توزيع أرباح نقدية	2025-08-31	2025-09-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.710676
74	9543	توزيع أرباح نقدية	2025-09-08	2025-09-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.710991
75	9548	توزيع أرباح نقدية	2025-08-14	2025-09-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.711302
76	4145	توزيع أرباح نقدية	2025-09-08	2025-09-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.71161
77	9536	توزيع أرباح نقدية	2025-09-03	2025-09-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.711937
78	4014	توزيع أرباح نقدية	2025-08-10	2025-09-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.712231
79	9631	توزيع أرباح نقدية	2025-09-01	2025-09-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.712548
80	3092	توزيع أرباح نقدية	2025-08-05	2025-09-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.712851
81	4261	توزيع أرباح نقدية	2025-08-07	2025-09-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.71316
82	7020	شراء اسهم خزينة	2025-09-07	2025-09-07	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2500000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:05.71347
83	3040	توزيع أرباح نقدية	2025-08-14	2025-09-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.713782
84	2250	شراء اسهم خزينة	2025-09-04	2025-09-04	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 11000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:05.714081
85	4338	توزيع أرباح نقدية	2025-08-25	2025-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.7144
86	8230	شراء اسهم خزينة	2025-09-03	2025-09-03	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 300000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:05.714713
87	4330	توزيع أرباح نقدية	2025-08-25	2025-09-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.715018
88	4016	توزيع أرباح نقدية	2025-08-13	2025-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.71531
89	9581	توزيع أرباح نقدية	2025-08-03	2025-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.715631
90	4191	توزيع أرباح نقدية	2025-07-23	2025-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.715962
91	9552	توزيع أرباح نقدية	2025-08-13	2025-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.716233
92	1080	شراء اسهم خزينة	2025-08-31	2025-08-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 10000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:05.716509
93	6004	توزيع أرباح نقدية	2025-08-07	2025-08-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.717502
94	3090	توزيع أرباح نقدية	2025-08-04	2025-08-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.717762
95	4342	توزيع أرباح نقدية	2025-08-20	2025-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.718034
96	4001	توزيع أرباح نقدية	2025-08-06	2025-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.718291
97	1834	توزيع أرباح نقدية	2025-08-19	2025-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.718558
98	7200	توزيع أرباح نقدية	2025-08-19	2025-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.718817
99	9628	توزيع أرباح نقدية	2025-08-10	2025-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.719082
100	4320	توزيع أرباح نقدية	2025-08-10	2025-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:05.719351
101	3080	توزيع أرباح نقدية	2025-07-31	2025-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.132761
102	2290	توزيع أرباح نقدية	2025-07-27	2025-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.133484
103	9607	توزيع أرباح نقدية	2025-08-17	2025-08-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.133913
104	9300	توزيع أرباح نقدية	2025-08-17	2025-08-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.134331
105	4051	توزيع أرباح نقدية	2025-08-07	2025-08-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.134747
106	4263	توزيع أرباح نقدية	2025-08-07	2025-08-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.135123
107	2286	توزيع أرباح نقدية	2025-07-31	2025-08-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.135468
108	9521	توزيع أرباح نقدية	2025-08-18	2025-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.13588
109	1060	توزيع أرباح نقدية	2025-08-10	2025-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.136078
110	6014	توزيع أرباح نقدية	2025-08-05	2025-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.136386
111	2222	توزيع أرباح نقدية	2025-08-05	2025-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.136602
112	2382	توزيع أرباح نقدية	2025-08-04	2025-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.137062
113	2010	توزيع أرباح نقدية	2025-08-03	2025-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.137363
114	1833	توزيع أرباح نقدية	2025-08-11	2025-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.13759
115	4335	توزيع أرباح نقدية	2025-08-12	2025-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.137789
116	4334	توزيع أرباح نقدية	2025-08-12	2025-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.138025
117	4146	توزيع أرباح نقدية	2025-08-04	2025-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.138359
118	4004	توزيع أرباح نقدية	2025-08-04	2025-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.138569
119	2040	توزيع أرباح نقدية	2025-07-29	2025-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.138824
120	4339	توزيع أرباح نقدية	2025-08-11	2025-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.139171
121	1835	توزيع أرباح نقدية	2025-08-10	2025-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.139435
122	4260	توزيع أرباح نقدية	2025-08-10	2025-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.13974
123	2320	توزيع أرباح نقدية	2025-08-07	2025-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.139945
124	1831	توزيع أرباح نقدية	2025-08-06	2025-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.140138
125	4007	توزيع أرباح نقدية	2025-08-07	2025-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.140312
126	9517	توزيع أرباح نقدية	2025-08-07	2025-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.14055
127	4164	توزيع أرباح نقدية	2025-07-30	2025-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.140811
128	4163	توزيع أرباح نقدية	2025-08-10	2025-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.141003
129	4190	توزيع أرباح نقدية	2025-08-06	2025-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.14128
130	4348	توزيع أرباح نقدية	2025-07-30	2025-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.141469
131	4332	توزيع أرباح نقدية	2025-08-03	2025-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.141721
132	4332	توزيع أرباح نقدية	2025-08-03	2025-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.142103
133	9634	توزيع أرباح نقدية	2025-07-27	2025-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.14227
134	9619	توزيع أرباح نقدية	2025-08-03	2025-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.142436
135	4018	توزيع أرباح نقدية	2025-08-03	2025-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.142606
136	1303	توزيع أرباح نقدية	2025-07-29	2025-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.142766
137	1150	توزيع أرباح نقدية	2025-07-24	2025-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.142924
138	3060	توزيع أرباح نقدية	2025-07-14	2025-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.143081
139	1321	توزيع أرباح نقدية	2025-05-21	2025-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.143252
140	7203	توزيع أرباح نقدية	2025-07-31	2025-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.143413
141	1830	توزيع أرباح نقدية	2025-07-30	2025-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.143578
142	1140	توزيع أرباح نقدية	2025-07-23	2025-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.143738
143	2020	توزيع أرباح نقدية	2025-07-28	2025-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.143901
144	3003	توزيع أرباح نقدية	2025-07-28	2025-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.14406
145	1030	توزيع أرباح نقدية	2025-07-27	2025-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.144218
146	1010	توزيع أرباح نقدية	2025-07-21	2025-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.144377
147	4003	توزيع أرباح نقدية	2025-07-31	2025-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.144535
148	2284	توزيع أرباح نقدية	2025-07-27	2025-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.144723
149	2283	توزيع أرباح نقدية	2025-07-24	2025-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.144882
150	1180	توزيع أرباح نقدية	2025-07-21	2025-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.145042
151	4013	توزيع أرباح نقدية	2025-07-27	2025-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.145201
152	7020	توزيع أرباح نقدية	2025-07-22	2025-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.145359
153	4324	توزيع أرباح نقدية	2025-07-08	2025-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.145518
154	4280	توزيع أرباح نقدية	2025-03-17	2025-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.145672
155	7010	توزيع أرباح نقدية	2025-07-27	2025-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.145827
156	2080	توزيع أرباح نقدية	2025-06-24	2025-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.145985
157	4333	توزيع أرباح نقدية	2025-07-29	2025-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.146139
158	3010	توزيع أرباح نقدية	2025-07-28	2025-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.146296
159	4340	توزيع أرباح نقدية	2025-07-17	2025-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.146451
160	4015	توزيع أرباح نقدية	2025-07-24	2025-07-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.146607
161	4336	توزيع أرباح نقدية	2025-07-21	2025-07-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.146761
162	1080	توزيع أرباح نقدية	2025-07-23	2025-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.146918
163	4012	توزيع أرباح نقدية	2025-07-22	2025-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.147074
164	1050	توزيع أرباح نقدية	2025-07-21	2025-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.147259
165	4084	توزيع أرباح نقدية	2025-07-20	2025-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.147507
166	4344	توزيع أرباح نقدية	2025-07-15	2025-07-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.147752
167	9576	توزيع أسهم خزينة كأسهم منحة	2025-04-28	2025-07-23	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.148009
168	4145	تعديل رمز التداول	2025-07-17	2025-07-21	\N	\N	\N	SAR	تم تعديل رمز التداول من 9531 إلى 4145	2025-12-25 15:06:06.148282
169	7211	تعديل رمز التداول	2025-07-17	2025-07-21	\N	\N	\N	SAR	تم تعديل رمز التداول من 9534 إلى 7211	2025-12-25 15:06:06.148546
170	7211	تحويل الشركة من سوق ﻵخر	2024-04-21	2025-07-21	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2025-07-21	2025-12-25 15:06:06.149911
171	4145	تحويل الشركة من سوق ﻵخر	2023-12-28	2025-07-21	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2025-07-21	2025-12-25 15:06:06.150196
172	9585	توزيع أسهم خزينة كأسهم منحة	2025-03-13	2025-07-16	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.150483
173	9566	توزيع أسهم خزينة كأسهم منحة	2025-03-26	2025-07-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.150737
174	4081	توزيع أرباح نقدية	2025-06-29	2025-07-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.151029
175	4130	تغيير اسم الشركة	2025-02-12	2025-07-13	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALBAHA إلى SAUDI DARB	2025-12-25 15:06:06.151421
176	4345	توزيع أرباح نقدية	2025-07-01	2025-07-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.151775
177	9300	زيادة رأس مال - اكتتاب خاص	2025-06-24	2025-07-09	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:06.152103
178	4009	توزيع أرباح نقدية	2025-03-24	2025-07-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.152437
179	2310	توزيع أرباح نقدية	2025-06-26	2025-07-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.152763
180	8210	توزيع أرباح نقدية	2025-05-22	2025-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.1531
181	2082	زيادة رأس مال - إصدار حقوق أولوية	2024-06-11	2025-07-01	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:06.15342
182	1050	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2070117 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.15375
183	1010	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 8442567 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.154064
184	1020	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 4500000 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.154387
185	1080	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3575200 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.154708
186	1322	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 5100 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.155031
187	2120	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.155381
188	1140	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1538304 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.155687
189	1180	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3392021 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.155967
190	2310	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 61107 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.156271
191	2250	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3341254 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.156574
192	2223	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 5615 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.156916
193	1830	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 12120 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.157186
194	2082	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 95503 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.157526
195	4003	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 651950 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.157767
196	3002	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3520000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.157998
197	9557	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 10000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.158225
198	3040	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 798353 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.158448
199	9556	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 366564 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.158706
200	7202	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 41267 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.158956
201	4322	شراء اسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 205905 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.604336
202	6017	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 393880 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.604759
203	7010	بيع أسهم خزينة	2025-06-30	2025-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 2878141 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:06.604964
204	3030	توزيع أرباح نقدية	2025-06-24	2025-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.616012
205	6014	توزيع أرباح نقدية	2025-05-13	2025-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.616291
206	2190	توزيع أرباح نقدية	2025-05-11	2025-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.616486
207	9569	توزيع أرباح نقدية	2025-04-21	2025-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.616677
208	4030	توزيع أرباح نقدية	2025-03-19	2025-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.61686
1161	3008	تجزئة أسهم	2023-03-22	2023-04-13	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:11.03162
209	4030	توزيع أسهم خزينة كأسهم منحة	2025-03-19	2025-06-30	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.617284
210	9597	توزيع أرباح نقدية	2025-06-04	2025-06-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.617557
211	2084	توزيع أرباح نقدية	2025-06-01	2025-06-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.617735
212	9634	توزيع أرباح نقدية	2025-05-27	2025-06-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.617899
213	9628	توزيع أرباح نقدية	2025-03-25	2025-06-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.618093
214	9631	توزيع أرباح نقدية	2025-04-27	2025-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.618261
215	2287	توزيع أرباح نقدية	2025-04-03	2025-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.61842
216	2120	توزيع أرباح نقدية	2025-03-27	2025-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.618581
217	1835	توزيع أرباح نقدية	2025-03-27	2025-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.618745
218	4143	توزيع أرباح نقدية	2025-03-23	2025-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.618911
219	4017	توزيع أرباح نقدية	2025-03-05	2025-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.61908
220	4261	توزيع أرباح نقدية	2025-06-22	2025-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.619251
221	4263	توزيع أرباح نقدية	2025-05-14	2025-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.619419
222	9574	توزيع أرباح نقدية	2025-04-13	2025-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.619592
223	9562	توزيع أرباح نقدية	2025-03-03	2025-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.619759
224	9562	توزيع أسهم خزينة كأسهم منحة	2025-03-03	2025-06-25	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.61992
225	1211	زيادة رأس مال - اكتتاب خاص	2024-09-15	2025-06-25	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:06.620115
226	9523	توزيع أرباح نقدية	2025-03-12	2025-06-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.620289
227	2170	توزيع أرباح نقدية	2025-06-19	2025-06-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.620472
228	9548	توزيع أسهم خزينة كأسهم منحة	2024-11-06	2025-06-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.620649
229	9516	توزيع أرباح نقدية	2025-05-15	2025-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.620821
230	9563	توزيع أرباح نقدية	2025-05-12	2025-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.621001
231	3050	توزيع أرباح نقدية	2025-03-27	2025-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.62118
232	2370	توزيع أرباح نقدية	2025-05-22	2025-06-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.621382
233	9611	توزيع أرباح نقدية	2025-05-14	2025-06-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.62156
234	9550	توزيع أرباح نقدية	2025-04-15	2025-06-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.621742
235	4162	توزيع أرباح نقدية	2025-06-03	2025-06-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.621914
236	8012	توزيع أرباح نقدية	2025-04-06	2025-06-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.622116
237	4004	توزيع أرباح نقدية	2025-06-01	2025-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.622303
238	2281	توزيع أرباح نقدية	2025-05-15	2025-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.622484
239	4321	توزيع أرباح نقدية	2025-05-12	2025-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.62266
240	9612	توزيع أرباح نقدية	2025-04-23	2025-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.622867
241	9593	توزيع أرباح نقدية	2025-04-14	2025-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.623069
242	9570	توزيع أرباح نقدية	2025-03-23	2025-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.627118
243	8010	شراء اسهم خزينة	2025-06-15	2025-06-15	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 199862 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.627414
244	4280	توزيع أرباح نقدية	2025-03-17	2025-06-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.627667
245	3007	توزيع أرباح نقدية	2025-03-20	2025-06-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.627872
246	4342	توزيع أرباح نقدية	2025-05-27	2025-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.628039
247	1320	توزيع أرباح نقدية	2025-05-07	2025-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.628198
248	1320	توزيع أرباح نقدية	2025-05-07	2025-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.628353
249	9591	توزيع أرباح نقدية	2025-04-14	2025-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.628508
250	2200	توزيع أرباح نقدية	2025-02-27	2025-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.628662
251	2200	توزيع أسهم خزينة كأسهم منحة	2025-02-27	2025-06-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.628816
252	6010	شراء اسهم خزينة	2025-06-03	2025-06-03	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.628971
253	9575	تجزئة أسهم	2025-04-20	2025-06-03	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:06.629126
254	9549	توزيع أرباح نقدية	2025-03-24	2025-06-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.629283
255	9580	توزيع أرباح نقدية	2025-03-23	2025-06-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.62944
256	2285	توزيع أرباح نقدية	2025-03-19	2025-06-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.629593
257	9556	توزيع أسهم خزينة كأسهم منحة	2025-03-05	2025-06-02	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.629748
258	9556	توزيع أرباح نقدية	2025-03-05	2025-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.629901
259	4001	توزيع أرباح نقدية	2025-05-11	2025-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.630054
260	8250	توزيع أرباح نقدية	2025-04-03	2025-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.630243
261	9623	توزيع أرباح نقدية	2025-03-27	2025-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.630932
262	9585	توزيع أرباح نقدية	2025-03-13	2025-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.631102
263	9627	توزيع أرباح نقدية	2025-03-11	2025-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.631261
321	3030	توزيع أرباح نقدية	2025-02-04	2025-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.047955
264	1810	شراء اسهم خزينة	2025-05-29	2025-05-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 23916611 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:06.631426
265	4347	توزيع أرباح نقدية	2025-05-27	2025-05-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.634773
266	9557	توزيع أسهم خزينة كأسهم منحة	2024-12-08	2025-05-29	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.6351
267	1830	توزيع أرباح نقدية	2025-05-26	2025-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.635418
268	8010	توزيع أرباح نقدية	2025-04-07	2025-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.635694
269	9607	توزيع أرباح نقدية	2025-03-04	2025-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.635978
270	3040	توزيع أرباح نقدية	2025-05-20	2025-05-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.636262
271	4018	توزيع أرباح نقدية	2025-05-22	2025-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.636595
272	4144	توزيع أرباح نقدية	2025-05-08	2025-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.636868
273	2250	توزيع أرباح نقدية	2025-04-30	2025-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.63714
274	1210	توزيع أرباح نقدية	2025-04-21	2025-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.637403
275	9584	توزيع أرباح نقدية	2025-03-26	2025-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.637665
276	9527	توزيع أرباح نقدية	2025-03-24	2025-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.637947
277	2081	توزيع أرباح نقدية	2025-03-17	2025-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.638228
278	2250	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-12-25	2025-05-26	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:06.638493
279	2230	توزيع أرباح نقدية	2025-04-21	2025-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.638802
280	4260	توزيع أرباح نقدية	2025-03-17	2025-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.640451
281	2170	توزيع أرباح نقدية	2025-05-19	2025-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.640647
282	2222	توزيع أرباح نقدية	2025-05-11	2025-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.640884
283	8170	توزيع أرباح نقدية	2025-04-09	2025-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.641067
284	4163	توزيع أرباح نقدية	2025-05-18	2025-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.641228
285	4018	توزيع أرباح نقدية	2025-02-26	2025-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.641386
286	4007	توزيع أرباح نقدية	2025-05-12	2025-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.641542
287	4005	توزيع أرباح نقدية	2025-04-14	2025-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.641698
288	4100	توزيع أرباح نقدية	2025-03-06	2025-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.641865
289	1214	توزيع أرباح نقدية	2025-04-20	2025-05-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.642031
290	9589	توزيع أرباح نقدية	2025-04-07	2025-05-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.642196
291	9517	توزيع أرباح نقدية	2025-05-14	2025-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.642364
292	4161	توزيع أرباح نقدية	2025-03-17	2025-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.642523
293	1050	توزيع أرباح نقدية	2025-01-30	2025-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.64277
294	9602	توزيع أسهم خزينة كأسهم منحة	2024-12-18	2025-05-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:06.642939
295	1150	توزيع أرباح نقدية	2025-04-29	2025-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.643104
296	9578	توزيع أرباح نقدية	2025-03-27	2025-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.643729
297	4090	توزيع أرباح نقدية	2025-03-19	2025-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.644037
298	5110	توزيع أرباح نقدية	2025-03-05	2025-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.661469
299	7010	توزيع أرباح نقدية	2025-02-26	2025-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.661942
300	4190	توزيع أرباح نقدية	2025-05-11	2025-05-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:06.662313
301	4348	توزيع أرباح نقدية	2025-04-30	2025-05-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.040131
302	4021	توزيع أرباح نقدية	2025-03-18	2025-05-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.040695
303	4013	توزيع أرباح نقدية	2025-05-04	2025-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.041193
304	9601	توزيع أرباح نقدية	2025-04-07	2025-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.041391
305	4150	توزيع أرباح نقدية	2025-02-25	2025-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.041631
306	1111	توزيع أرباح نقدية	2025-03-02	2025-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.041843
307	4333	توزيع أرباح نقدية	2025-05-05	2025-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.042081
308	4340	توزيع أرباح نقدية	2025-04-29	2025-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.042272
309	7202	توزيع أرباح نقدية	2025-02-17	2025-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.04246
310	7202	توزيع أرباح نقدية	2025-02-17	2025-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.042629
311	4165	توزيع أرباح نقدية	2025-03-06	2025-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.042825
312	4002	توزيع أرباح نقدية	2024-12-23	2025-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.043003
313	4322	توزيع أرباح نقدية	2025-03-02	2025-05-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.043267
314	4083	تغيير اسم الشركة	2025-05-04	2025-05-04	\N	\N	\N	SAR	تم تعديل اسم الشركة من UIHC إلى TASHEEL	2025-12-25 15:06:07.043459
315	7010	توزيع أرباح نقدية	2025-04-27	2025-05-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.046869
316	4084	توزيع أرباح نقدية	2025-04-23	2025-05-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.047057
317	4344	توزيع أرباح نقدية	2025-04-23	2025-05-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.047232
318	4016	توزيع أرباح نقدية	2025-04-13	2025-05-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.047398
319	2284	توزيع أرباح نقدية	2025-03-04	2025-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.047588
320	1060	توزيع أرباح نقدية	2025-02-05	2025-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.047785
322	4339	توزيع أرباح نقدية	2025-04-24	2025-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.048119
323	9525	توزيع أرباح نقدية	2025-03-17	2025-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.048329
324	1020	توزيع أسهم خزينة كأسهم منحة	2025-02-11	2025-04-29	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.048496
325	4336	توزيع أرباح نقدية	2025-04-20	2025-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.048658
326	3010	توزيع أرباح نقدية	2025-02-19	2025-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.048823
327	7030	توزيع أرباح نقدية	2025-02-18	2025-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.048988
328	1150	توزيع أرباح نقدية	2025-01-29	2025-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.04915
329	9557	شراء اسهم خزينة	2025-04-21	2025-04-21	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:07.049323
330	3080	توزيع أرباح نقدية	2025-03-25	2025-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.057856
331	1212	توزيع أرباح نقدية	2025-03-13	2025-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.05842
332	9600	توزيع أسهم خزينة كأسهم منحة	2024-09-11	2025-04-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.058939
333	4142	توزيع أرباح نقدية	2025-03-10	2025-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.05931
334	9511	توزيع أرباح نقدية	2025-03-09	2025-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.059763
335	9595	زيادة رأس مال - اكتتاب خاص	2025-02-10	2025-04-20	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:07.060262
336	3092	توزيع أرباح نقدية	2025-01-21	2025-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.062522
337	2223	توزيع أرباح نقدية	2025-02-17	2025-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.062952
338	3090	توزيع أرباح نقدية	2025-03-26	2025-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.063236
339	4320	توزيع أرباح نقدية	2025-03-23	2025-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.063635
340	6070	توزيع أرباح نقدية	2025-02-26	2025-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.064121
341	3020	توزيع أرباح نقدية	2025-02-19	2025-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.064516
342	1140	توزيع أسهم خزينة كأسهم منحة	2025-02-09	2025-04-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.064891
343	9603	توزيع أرباح نقدية	2025-04-08	2025-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.065335
344	6014	توزيع أرباح نقدية	2025-03-25	2025-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.065719
345	1010	توزيع أرباح نقدية	2025-02-03	2025-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.066228
346	1120	توزيع أرباح نقدية	2025-01-29	2025-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.066631
347	2280	توزيع أرباح نقدية	2024-12-19	2025-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.067177
348	1831	توزيع أرباح نقدية	2025-04-03	2025-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.067596
349	1833	توزيع أرباح نقدية	2025-03-27	2025-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.068019
350	6004	توزيع أرباح نقدية	2025-03-24	2025-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.068729
351	4144	توزيع أسهم خزينة كأسهم منحة	2025-02-10	2025-04-13	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.069284
352	4130	تجميع أسهم	2024-09-04	2025-04-13	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:07.069721
353	7200	توزيع أرباح نقدية	2025-04-03	2025-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.070095
354	4051	توزيع أرباح نقدية	2025-03-06	2025-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.070651
355	9581	توزيع أرباح نقدية	2025-02-02	2025-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.071027
356	9517	توزيع أرباح نقدية	2025-03-26	2025-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.071369
357	4001	توزيع أرباح نقدية	2025-03-25	2025-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.071754
358	9583	توزيع أرباح نقدية	2025-03-27	2025-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.072197
359	1834	توزيع أرباح نقدية	2025-03-26	2025-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.072529
360	4330	توزيع أرباح نقدية	2025-03-25	2025-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.072929
361	4190	توزيع أرباح نقدية	2025-03-24	2025-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.073289
362	2283	توزيع أرباح نقدية	2025-03-13	2025-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.073791
363	4004	توزيع أرباح نقدية	2025-03-18	2025-04-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.074256
364	9543	توزيع أرباح نقدية	2025-03-26	2025-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.074517
365	4338	توزيع أرباح نقدية	2025-03-25	2025-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.075185
366	2320	توزيع أرباح نقدية	2025-03-23	2025-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.075657
367	4031	توزيع أرباح نقدية	2025-03-18	2025-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.076203
368	9587	توزيع أسهم خزينة كأسهم منحة	2024-07-22	2025-03-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.076743
369	9521	توزيع أرباح نقدية	2025-03-23	2025-03-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.077081
370	4335	توزيع أرباح نقدية	2025-03-17	2025-03-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.077447
371	2286	توزيع أرباح نقدية	2025-03-09	2025-03-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.077784
372	9546	توزيع أرباح نقدية	2025-03-20	2025-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.078155
373	3040	توزيع أرباح نقدية	2025-03-19	2025-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.078478
374	1303	توزيع أرباح نقدية	2025-03-09	2025-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.078805
375	7020	توزيع أرباح نقدية	2025-02-19	2025-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.081271
376	2270	توزيع أرباح نقدية	2025-03-17	2025-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.081875
377	4003	توزيع أرباح نقدية	2025-03-05	2025-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.082311
378	4164	توزيع أرباح نقدية	2025-03-10	2025-03-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.082595
379	2222	توزيع أرباح نقدية	2025-03-04	2025-03-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.082988
380	4261	توزيع أرباح نقدية	2025-03-12	2025-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.083512
381	2381	توزيع أرباح نقدية	2025-03-12	2025-03-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.083948
382	4321	توزيع أرباح نقدية	2025-03-11	2025-03-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.084277
383	4004	زيادة رأس مال - اكتتاب خاص	2024-08-20	2025-03-13	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:07.084729
384	4146	توزيع أرباح نقدية	2025-03-05	2025-03-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.085102
385	2382	توزيع أرباح نقدية	2025-02-24	2025-03-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.085442
386	1322	توزيع أرباح نقدية	2025-02-24	2025-03-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.08595
387	7203	توزيع أرباح نقدية	2025-02-27	2025-03-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.086388
388	7010	توزيع أرباح نقدية	2025-02-26	2025-03-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.086749
389	4015	توزيع أرباح نقدية	2025-02-25	2025-03-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.087073
390	1304	توزيع أرباح نقدية	2024-12-26	2025-03-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.087441
391	4012	توزيع أرباح نقدية	2025-03-02	2025-03-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.08788
392	4334	توزيع أرباح نقدية	2025-02-25	2025-03-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.088197
393	9532	تجزئة أسهم	2025-01-16	2025-03-04	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.088525
394	4007	توزيع أرباح نقدية	2025-03-02	2025-03-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.088816
395	4200	توزيع أرباح نقدية	2025-01-21	2025-03-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.089339
396	9618	توزيع أرباح نقدية	2024-12-25	2025-03-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.089765
397	4263	توزيع أرباح نقدية	2025-02-19	2025-02-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.090188
398	2290	توزيع أرباح نقدية	2024-12-30	2025-02-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.090636
399	4342	توزيع أرباح نقدية	2025-02-18	2025-02-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.090983
400	9300	توزيع أرباح نقدية	2025-02-18	2025-02-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.091362
401	9619	توزيع أرباح نقدية	2025-02-16	2025-02-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.494968
402	4013	توزيع أرباح نقدية	2025-02-16	2025-02-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.495698
403	1030	توزيع أرباح نقدية	2025-02-11	2025-02-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.496025
404	1830	توزيع أرباح نقدية	2025-02-10	2025-02-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.496311
405	4144	توزيع أرباح نقدية	2025-02-10	2025-02-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.496602
406	9577	تجزئة أسهم	2024-12-22	2025-02-13	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.496864
407	4061	تجميع أسهم	2024-12-10	2025-02-13	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:07.497128
408	4348	توزيع أرباح نقدية	2025-01-30	2025-02-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.497397
409	2010	توزيع أرباح نقدية	2024-12-22	2025-02-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.497867
410	4163	توزيع أرباح نقدية	2025-02-03	2025-02-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.498134
411	1080	توزيع أرباح نقدية	2025-02-05	2025-02-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.498396
412	1180	توزيع أرباح نقدية	2025-01-29	2025-02-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.499392
413	4340	توزيع أرباح نقدية	2025-01-29	2025-02-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.499654
414	8313	زيادة رأس مال - اكتتاب خاص	2024-10-07	2025-02-09	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:07.499884
415	2020	توزيع أرباح نقدية	2024-12-22	2025-02-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.500124
416	4150	زيادة رأس مال - اكتتاب خاص	2025-01-07	2025-02-04	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:07.50036
417	4144	تغيير نظام الشركة	2025-02-02	2025-02-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:07.500619
418	4339	توزيع أرباح نقدية	2025-01-22	2025-02-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.500867
419	9571	توزيع أرباح نقدية	2025-01-21	2025-02-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.501132
420	6050	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-01-02	2025-01-29	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:07.501341
421	4144	تعديل رمز التداول	2025-01-23	2025-01-27	\N	\N	\N	SAR	تم تعديل رمز التداول من 9529 إلى 4144	2025-12-25 15:06:07.501762
422	4333	توزيع أرباح نقدية	2025-01-21	2025-01-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.502121
423	4336	توزيع أرباح نقدية	2025-01-15	2025-01-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.502395
424	4144	تحويل الشركة من سوق ﻵخر	2023-12-14	2025-01-27	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2025-01-27	2025-12-25 15:06:07.502715
425	9598	توزيع أرباح نقدية	2024-10-06	2025-01-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.503259
426	2080	توزيع أرباح نقدية	2024-12-17	2025-01-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.503599
427	4100	توزيع أسهم خزينة كأسهم منحة	2024-11-03	2025-01-16	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.503906
428	4292	توزيع أرباح نقدية	2024-12-08	2025-01-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.504268
429	2200	تجزئة أسهم	2024-10-31	2025-01-09	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.504542
430	4345	توزيع أرباح نقدية	2025-01-02	2025-01-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.504864
431	4324	توزيع أرباح نقدية	2024-12-15	2025-01-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.505863
432	1321	توزيع أرباح نقدية	2024-12-18	2025-01-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.506121
433	4344	توزيع أرباح نقدية	2024-12-26	2025-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.506501
434	4081	توزيع أرباح نقدية	2024-12-19	2025-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.506761
435	4220	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-09-08	2025-01-01	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:07.507032
436	4280	توزيع أرباح نقدية	2024-03-26	2025-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.507668
437	8200	زيادة رأس مال - اكتتاب خاص	2024-07-07	2024-12-25	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:07.508164
438	4003	توزيع أرباح نقدية	2024-12-19	2024-12-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.508381
439	4130	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-10-15	2024-12-24	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:07.508555
440	1050	توزيع أسهم خزينة كأسهم منحة	2024-05-30	2024-12-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.508722
441	4071	توزيع أسهم خزينة كأسهم منحة	2024-05-30	2024-12-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.508901
442	9537	توزيع أرباح نقدية	2024-11-17	2024-12-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.509079
443	9615	توزيع أرباح نقدية	2024-12-15	2024-12-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.509242
444	9540	توزيع أسهم خزينة كأسهم منحة	2024-08-29	2024-12-19	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.509475
445	9591	تجزئة أسهم	2024-10-10	2024-12-18	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.509722
446	2050	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-09-27	2024-12-17	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:07.509965
447	2050	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-09-27	2024-12-17	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:07.510209
448	2150	توزيع أرباح نقدية	2024-11-28	2024-12-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.510448
449	9539	تجزئة أسهم	2024-11-18	2024-12-16	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.510686
450	4291	توزيع أرباح نقدية	2024-10-30	2024-12-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.511888
451	1211	زيادة رأس مال - اكتتاب خاص	2024-04-30	2024-12-12	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:07.512154
452	8050	زيادة رأس مال - إصدار حقوق أولوية	2024-03-18	2024-12-12	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:07.512395
453	4191	توزيع أرباح نقدية	2024-11-27	2024-12-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.512634
454	3060	توزيع أرباح نقدية	2024-12-08	2024-12-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.512874
455	6017	تعديل رمز التداول	2024-12-08	2024-12-10	\N	\N	\N	SAR	تم تعديل رمز التداول من 9526 إلى 6017	2025-12-25 15:06:07.513117
456	6017	تحويل الشركة من سوق ﻵخر	2024-03-20	2024-12-10	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2024-12-10	2025-12-25 15:06:07.513358
457	4324	تعديل رمز التداول	2024-12-04	2024-12-09	\N	\N	\N	SAR	تم تعديل رمز التداول من 9519 إلى 4324	2025-12-25 15:06:07.513716
458	4162	توزيع أرباح نقدية	2024-12-01	2024-12-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.51407
459	4324	تحويل الشركة من سوق ﻵخر	2023-07-04	2024-12-09	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2024-12-09	2025-12-25 15:06:07.514454
460	4331	توزيع أرباح نقدية	2024-12-03	2024-12-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.514885
461	4339	توزيع أرباح نقدية	2024-11-19	2024-12-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.515319
462	4014	توزيع أرباح نقدية	2024-11-07	2024-12-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.515694
463	4347	توزيع أرباح نقدية	2024-12-01	2024-12-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.516051
464	2310	توزيع أرباح نقدية	2024-11-27	2024-12-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.516432
465	3004	توزيع أرباح نقدية	2024-11-25	2024-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.516797
466	3040	توزيع أرباح نقدية	2024-11-20	2024-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.517191
467	1820	تغيير اسم الشركة	2024-10-13	2024-11-28	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALHOKAIR GROUP إلى BAAN	2025-12-25 15:06:07.517584
468	6014	توزيع أرباح نقدية	2024-11-05	2024-11-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.517934
469	4143	توزيع أرباح نقدية	2024-07-18	2024-11-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.518407
470	8060	زيادة رأس مال - إصدار حقوق أولوية	2023-09-18	2024-11-27	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:07.518868
471	4161	توزيع أرباح نقدية	2024-11-07	2024-11-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.519242
472	4261	توزيع أرباح نقدية	2024-11-06	2024-11-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.519636
473	9569	تجزئة أسهم	2024-10-13	2024-11-26	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.519986
474	9576	توزيع أسهم خزينة كأسهم منحة	2024-07-30	2024-11-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.52034
475	4144	توزيع أرباح نقدية	2024-11-04	2024-11-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.520711
476	4344	توزيع أرباح نقدية	2024-11-14	2024-11-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.520963
477	4342	توزيع أرباح نقدية	2025-02-11	2024-11-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.521222
478	4332	توزيع أرباح نقدية	2024-11-11	2024-11-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.52146
479	4004	توزيع أرباح نقدية	2024-11-10	2024-11-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.521714
480	4007	توزيع أرباح نقدية	2024-11-03	2024-11-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.521951
481	9535	توزيع أرباح نقدية	2024-11-10	2024-11-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.522188
482	2222	توزيع أرباح نقدية	2024-11-05	2024-11-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.52256
483	2286	توزيع أرباح نقدية	2024-10-31	2024-11-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.522837
484	4321	توزيع أرباح نقدية	2024-11-10	2024-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.523086
485	2320	توزيع أرباح نقدية	2024-11-07	2024-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.52335
486	4190	توزيع أرباح نقدية	2024-11-07	2024-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.523604
487	3090	توزيع أرباح نقدية	2024-11-04	2024-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.523871
488	4163	توزيع أرباح نقدية	2024-11-04	2024-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.524128
489	4348	توزيع أرباح نقدية	2024-10-31	2024-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.525037
490	9603	توزيع أرباح نقدية	2024-11-07	2024-11-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.525373
491	4263	توزيع أرباح نقدية	2024-11-04	2024-11-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.525711
492	4013	توزيع أرباح نقدية	2024-11-03	2024-11-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.526251
493	1301	توزيع أرباح نقدية	2024-10-31	2024-11-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.528292
494	4340	توزيع أرباح نقدية	2024-10-30	2024-11-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.528977
495	1830	توزيع أرباح نقدية	2024-10-29	2024-11-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.530398
496	1150	توزيع أرباح نقدية	2024-10-24	2024-11-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.531668
497	7010	توزيع أرباح نقدية	2024-11-04	2024-11-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.532165
498	4250	زيادة رأس مال - اكتتاب خاص	2023-12-20	2024-11-05	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:07.533151
499	4333	توزيع أرباح نقدية	2024-10-28	2024-11-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.533646
500	6016	تحويل الشركة من سوق ﻵخر	2024-10-13	2024-11-04	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2024-11-04	2025-12-25 15:06:07.534238
501	6016	تعديل رمز التداول	2024-10-13	2024-11-04	\N	\N	\N	SAR	تم تعديل رمز التداول من 9520 إلى 6016	2025-12-25 15:06:07.93294
502	9594	توزيع أرباح نقدية	2024-09-01	2024-11-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.933459
503	4336	توزيع أرباح نقدية	2024-10-17	2024-10-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.933747
504	9606	توزيع أرباح نقدية	2024-10-20	2024-10-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.933997
505	9571	توزيع أسهم خزينة كأسهم منحة	2024-07-17	2024-10-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.934239
506	9543	توزيع أرباح نقدية	2024-10-02	2024-10-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.934491
507	2223	توزيع أرباح نقدية	2024-08-05	2024-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.934745
508	4280	توزيع أرباح نقدية	2024-03-26	2024-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.934992
509	1322	توزيع أرباح نقدية	2024-08-18	2024-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.935264
510	6070	توزيع أرباح نقدية	2024-08-05	2024-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.935544
511	4322	توزيع أرباح نقدية	2024-07-31	2024-09-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.935767
512	8012	توزيع أرباح نقدية	2024-05-22	2024-09-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.935975
513	1302	توزيع أرباح نقدية	2024-08-04	2024-09-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.936196
514	4339	توزيع أرباح نقدية	2024-09-12	2024-09-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.936437
515	9525	توزيع أرباح نقدية	2024-08-26	2024-09-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.936675
516	2130	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-05-28	2024-09-25	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:07.936921
517	9588	تجزئة أسهم	2023-12-26	2024-09-25	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.93717
518	7020	توزيع أرباح نقدية	2024-09-15	2024-09-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.937375
519	4142	توزيع أرباح نقدية	2024-09-04	2024-09-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.937604
520	7040	توزيع أرباح نقدية	2024-06-09	2024-09-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.937835
521	2270	توزيع أرباح نقدية	2024-09-15	2024-09-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.938082
522	9563	توزيع أرباح نقدية	2024-07-22	2024-09-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.938335
523	9563	توزيع أسهم خزينة كأسهم منحة	2023-11-29	2024-09-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.938561
524	4050	توزيع أرباح نقدية	2024-09-05	2024-09-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.938874
525	2382	توزيع أرباح نقدية	2024-08-05	2024-09-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.939096
526	9511	توزيع أرباح نقدية	2024-08-04	2024-09-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.939344
527	3080	توزيع أرباح نقدية	2024-08-04	2024-09-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.960359
528	1140	توزيع أرباح نقدية	2024-09-05	2024-09-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.960666
529	4031	توزيع أرباح نقدية	2024-08-29	2024-09-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.960875
530	1080	شراء اسهم خزينة	2024-09-11	2024-09-11	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:07.961077
531	2300	توزيع أرباح نقدية	2024-08-12	2024-09-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.961282
532	9607	توزيع أرباح نقدية	2024-09-04	2024-09-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.961506
533	4140	تجزئة أسهم	2023-06-14	2024-09-05	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.961778
534	2040	شراء اسهم خزينة	2024-09-04	2024-09-04	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 285979 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:07.962013
535	9583	توزيع أرباح نقدية	2024-08-28	2024-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.96223
536	4338	توزيع أرباح نقدية	2024-08-25	2024-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.962448
537	2010	توزيع أرباح نقدية	2024-05-21	2024-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.962655
538	9521	توزيع أرباح نقدية	2024-08-28	2024-09-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.962887
539	3040	توزيع أرباح نقدية	2024-08-28	2024-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.96309
540	4150	توزيع أرباح نقدية	2024-07-31	2024-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.963297
541	4016	توزيع أرباح نقدية	2024-07-30	2024-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.963523
542	4191	توزيع أرباح نقدية	2024-07-24	2024-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.963718
543	1834	توزيع أرباح نقدية	2024-08-25	2024-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.963911
544	6004	توزيع أرباح نقدية	2024-08-04	2024-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.96409
545	4330	توزيع أرباح نقدية	2024-08-21	2024-08-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.964277
546	9552	توزيع أرباح نقدية	2024-06-25	2024-08-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.964464
604	4012	توزيع أرباح نقدية	2024-07-25	2024-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.431511
547	8010	شراء اسهم خزينة	2024-08-28	2024-08-28	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 137896 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:07.964672
548	4342	توزيع أرباح نقدية	2024-08-19	2024-08-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.964927
549	4332	توزيع أرباح نقدية	2024-08-18	2024-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.965144
550	4051	توزيع أرباح نقدية	2024-08-13	2024-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.965353
551	4324	توزيع أرباح نقدية	2024-08-06	2024-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.965531
552	4001	توزيع أرباح نقدية	2024-08-06	2024-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.965745
553	4004	توزيع أرباح نقدية	2024-08-05	2024-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.965971
554	2050	زيادة رأس مال - إصدار حقوق أولوية	2024-02-07	2024-08-26	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:07.966202
555	9601	توزيع أرباح نقدية	2024-08-18	2024-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.966405
556	4146	توزيع أرباح نقدية	2024-08-07	2024-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.966608
557	4335	توزيع أرباح نقدية	2024-08-12	2024-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.966822
558	2222	توزيع أرباح نقدية	2024-08-06	2024-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.967054
559	6014	توزيع أرباح نقدية	2024-08-06	2024-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.967236
560	2083	توزيع أرباح نقدية	2024-08-01	2024-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.967454
561	3092	توزيع أرباح نقدية	2024-08-08	2024-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.967639
562	1150	توزيع أرباح نقدية	2024-08-05	2024-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.967821
563	1030	توزيع أرباح نقدية	2024-08-11	2024-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.968001
564	1831	توزيع أرباح نقدية	2024-08-11	2024-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.968179
565	1060	توزيع أرباح نقدية	2024-08-11	2024-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.991343
566	9517	توزيع أرباح نقدية	2024-08-08	2024-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.99174
567	4015	توزيع أرباح نقدية	2024-08-06	2024-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.992624
568	9579	توزيع أسهم خزينة كأسهم منحة	2024-04-29	2024-08-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:07.994309
569	1833	توزيع أرباح نقدية	2024-08-08	2024-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.994881
570	9300	توزيع أرباح نقدية	2024-08-08	2024-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.995164
571	3003	توزيع أرباح نقدية	2024-08-11	2024-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.995396
572	4334	توزيع أرباح نقدية	2024-08-11	2024-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.995683
573	4263	توزيع أرباح نقدية	2024-08-07	2024-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.995873
574	4190	توزيع أرباح نقدية	2024-08-08	2024-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.996066
575	4333	توزيع أرباح نقدية	2024-08-07	2024-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.996452
576	4261	توزيع أرباح نقدية	2024-08-07	2024-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.996744
577	1120	توزيع أرباح نقدية	2024-08-05	2024-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.99695
578	3050	توزيع أرباح نقدية	2024-08-08	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.997137
579	1080	توزيع أرباح نقدية	2024-08-07	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.997325
580	1180	توزيع أرباح نقدية	2024-08-06	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.997499
581	1010	توزيع أرباح نقدية	2024-08-06	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.997702
582	4007	توزيع أرباح نقدية	2024-08-04	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.997879
583	4163	توزيع أرباح نقدية	2024-08-04	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.99805
584	4348	توزيع أرباح نقدية	2024-07-31	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.998223
585	4164	توزيع أرباح نقدية	2024-07-31	2024-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.998389
586	9575	توزيع أرباح نقدية	2024-08-05	2024-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.998551
587	2150	توزيع أرباح نقدية	2024-08-04	2024-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.998718
588	4260	توزيع أرباح نقدية	2024-08-01	2024-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.998884
589	4340	توزيع أرباح نقدية	2024-07-31	2024-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.999062
590	1830	توزيع أرباح نقدية	2024-07-30	2024-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.999253
591	1303	توزيع أرباح نقدية	2024-07-30	2024-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.999458
592	1050	توزيع أرباح نقدية	2024-08-05	2024-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.999631
593	7203	توزيع أرباح نقدية	2024-08-04	2024-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:07.999795
594	4051	تجزئة أسهم	2023-08-13	2024-08-07	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:07.999991
595	2381	توزيع أرباح نقدية	2024-08-05	2024-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.000158
596	1321	توزيع أرباح نقدية	2024-05-26	2024-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.000321
597	2340	تغيير اسم الشركة	2023-12-07	2024-08-06	\N	\N	\N	SAR	تم تعديل اسم الشركة من 1633080 إلى ARTEX	2025-12-25 15:06:08.00048
598	2284	توزيع أرباح نقدية	2024-07-30	2024-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.000644
599	4082	توزيع أرباح نقدية	2024-05-15	2024-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.000806
600	4003	توزيع أرباح نقدية	2024-07-30	2024-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.000967
601	4144	توزيع أرباح نقدية	2024-07-30	2024-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.428506
602	4013	توزيع أرباح نقدية	2024-07-28	2024-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.42954
603	9559	توزيع أرباح نقدية	2024-07-25	2024-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.430113
605	9581	توزيع أرباح نقدية	2024-07-23	2024-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.431975
606	4004	توزيع أرباح نقدية	2024-06-12	2024-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.43332
607	2290	توزيع أرباح نقدية	2024-06-02	2024-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.433764
608	4280	توزيع أرباح نقدية	2024-03-26	2024-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.434097
609	3010	توزيع أرباح نقدية	2024-07-29	2024-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.434414
610	2283	توزيع أرباح نقدية	2024-07-23	2024-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.434726
611	4339	توزيع أرباح نقدية	2024-07-14	2024-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.435419
612	7010	توزيع أرباح نقدية	2024-07-23	2024-07-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.435932
613	4336	توزيع أرباح نقدية	2024-07-17	2024-07-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.436367
614	9536	توزيع أرباح نقدية	2024-07-18	2024-07-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.436727
615	4345	توزيع أرباح نقدية	2024-07-11	2024-07-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.437059
616	4344	توزيع أرباح نقدية	2024-07-09	2024-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.437411
617	4005	شراء اسهم خزينة	2024-07-11	2024-07-11	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 160000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:08.437741
618	9539	توزيع أرباح نقدية	2024-06-05	2024-07-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.438051
619	2200	توزيع أسهم خزينة كأسهم منحة	2023-11-09	2024-07-11	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.438368
620	2080	توزيع أرباح نقدية	2024-06-04	2024-07-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.438692
621	2140	زيادة رأس مال - إصدار حقوق أولوية	2023-08-28	2024-07-09	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:08.439006
622	2250	توزيع أرباح نقدية	2024-07-02	2024-07-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.439273
623	4291	تغيير السنة المالية	2024-06-13	2024-07-07	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:08.439593
624	2020	توزيع أرباح نقدية	2024-05-30	2024-07-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.439959
625	8210	توزيع أرباح نقدية	2024-05-28	2024-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.440235
626	6014	توزيع أرباح نقدية	2024-05-19	2024-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.440479
627	9516	توزيع أرباح نقدية	2024-05-16	2024-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.440754
628	4321	توزيع أرباح نقدية	2024-05-16	2024-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.442793
629	7030	توزيع أرباح نقدية	2024-03-03	2024-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.443118
630	9588	توزيع أسهم خزينة كأسهم منحة	2023-12-26	2024-07-01	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.443395
631	2310	توزيع أرباح نقدية	2024-06-13	2024-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.443691
632	7020	توزيع أرباح نقدية	2024-02-11	2024-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.444033
633	3090	توزيع أرباح نقدية	2024-03-31	2024-06-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.444928
634	9545	توزيع أرباح نقدية	2024-03-28	2024-06-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.446085
635	2040	توزيع أسهم خزينة كأسهم منحة	2024-03-24	2024-06-27	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.446577
636	8180	زيادة رأس مال - إصدار حقوق أولوية	2023-09-14	2024-06-27	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:08.447226
637	9541	تغيير السنة المالية	2024-06-04	2024-06-26	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:08.447808
638	9541	توزيع أسهم خزينة كأسهم منحة	2024-05-06	2024-06-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.448081
639	9591	توزيع أرباح نقدية	2024-04-25	2024-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.448372
640	9550	توزيع أرباح نقدية	2024-04-04	2024-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.448636
641	7204	توزيع أسهم خزينة كأسهم منحة	2024-03-31	2024-06-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.44889
642	9593	توزيع أسهم خزينة كأسهم منحة	2024-03-14	2024-06-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.449161
643	1320	توزيع أرباح نقدية	2024-05-23	2024-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.449466
644	9556	توزيع أرباح نقدية	2024-05-08	2024-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.449771
645	1212	توزيع أرباح نقدية	2024-03-27	2024-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.450055
646	9543	توزيع أرباح نقدية	2024-03-25	2024-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.450326
647	4260	زيادة رأس مال - اكتتاب خاص	2023-12-24	2024-06-25	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:08.450607
648	8010	توزيع أرباح نقدية	2024-04-14	2024-06-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.450874
649	9527	توزيع أرباح نقدية	2024-03-25	2024-06-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.451149
650	9580	توزيع أرباح نقدية	2024-05-07	2024-06-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.451415
651	9569	توزيع أرباح نقدية	2024-04-04	2024-06-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.451696
652	4162	توزيع أرباح نقدية	2024-05-28	2024-06-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.451985
653	2284	توزيع أرباح نقدية	2024-03-31	2024-06-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.452279
654	3001	إلغاء الإدراج	2024-06-11	2024-06-12	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2024-06-12	2025-12-25 15:06:08.452554
655	9542	توزيع أرباح نقدية	2024-03-31	2024-06-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.452832
656	9570	توزيع أرباح نقدية	2024-03-27	2024-06-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.45311
657	2120	توزيع أرباح نقدية	2024-03-17	2024-06-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.453379
658	2281	توزيع أرباح نقدية	2024-05-12	2024-06-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.453643
659	4280	توزيع أرباح نقدية	2024-03-26	2024-06-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.453904
660	3040	زيادة رأس مال - اكتتاب خاص	2022-09-25	2024-06-11	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:08.45418
661	3030	توزيع أرباح نقدية	2024-06-05	2024-06-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.454537
662	9594	تجزئة أسهم	2024-05-09	2024-06-10	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:08.456576
663	9594	توزيع أرباح نقدية	2024-03-31	2024-06-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.456978
664	4050	توزيع أرباح نقدية	2024-03-28	2024-06-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.457242
665	4050	توزيع أسهم خزينة كأسهم منحة	2024-03-28	2024-06-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.457508
666	9535	توزيع أرباح نقدية	2024-06-05	2024-06-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.457777
667	1830	توزيع أرباح نقدية	2024-05-06	2024-06-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.458029
668	9511	توزيع أسهم خزينة كأسهم منحة	2024-03-24	2024-06-09	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.458288
669	4051	توزيع أرباح نقدية	2024-03-18	2024-06-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.458977
670	4160	تخفيض رأس مال - بتخفيض عدد الأسهم	2023-11-30	2024-06-06	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:08.459447
671	4015	توزيع أرباح نقدية	2024-04-04	2024-06-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.459735
672	4030	توزيع أرباح نقدية	2024-03-19	2024-06-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.459987
673	3007	توزيع أرباح نقدية	2024-02-28	2024-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.460265
674	2320	توزيع أرباح نقدية	2024-03-30	2024-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.46053
675	9549	توزيع أرباح نقدية	2024-03-28	2024-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.460771
676	8010	شراء اسهم خزينة	2024-05-30	2024-05-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 120256 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:08.461017
677	8170	توزيع أرباح نقدية	2024-04-15	2024-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.461253
678	8250	توزيع أرباح نقدية	2024-04-14	2024-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.461502
679	9578	توزيع أرباح نقدية	2024-04-01	2024-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.461755
680	4100	توزيع أرباح نقدية	2024-03-25	2024-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.461992
681	7202	توزيع أرباح نقدية	2024-02-15	2024-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.462228
682	8170	توزيع أسهم خزينة كأسهم منحة	2023-08-07	2024-05-30	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.462465
683	2150	تجزئة أسهم	2023-05-10	2024-05-29	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من10.0  to 1.0  وبناءا على ذلك تم زيادة عدد الأسهم من  32.9 مليون سهم إلى 329.0 مليون سهم	2025-12-25 15:06:08.462728
684	4001	توزيع أرباح نقدية	2024-05-13	2024-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.462987
685	4002	توزيع أرباح نقدية	2023-12-25	2024-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.464042
686	4347	توزيع أرباح نقدية	2024-05-23	2024-05-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.464314
687	4263	توزيع أرباح نقدية	2024-05-20	2024-05-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.464544
688	4007	توزيع أرباح نقدية	2024-05-19	2024-05-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.464788
689	4161	توزيع أرباح نقدية	2024-05-16	2024-05-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.46503
690	4013	توزيع أرباح نقدية	2024-05-19	2024-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.465271
691	9515	توزيع أرباح نقدية	2024-03-30	2024-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.465517
692	4260	توزيع أرباح نقدية	2024-03-25	2024-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.465752
693	2081	توزيع أسهم خزينة كأسهم منحة	2023-07-23	2024-05-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.465986
694	4005	توزيع أرباح نقدية	2024-04-22	2024-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.466229
695	1050	توزيع أرباح نقدية	2024-02-06	2024-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.46649
696	3060	توزيع أرباح نقدية	2024-05-19	2024-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.466723
697	4344	توزيع أرباح نقدية	2024-05-16	2024-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.466946
698	4261	توزيع أرباح نقدية	2024-05-16	2024-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.467159
699	4342	توزيع أرباح نقدية	2024-05-14	2024-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.467377
700	7010	توزيع أرباح نقدية	2024-05-08	2024-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.467604
701	4011	توزيع أرباح نقدية	2024-03-31	2024-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.917218
702	4190	توزيع أرباح نقدية	2024-05-13	2024-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.91879
703	4090	توزيع أرباح نقدية	2024-03-27	2024-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.921568
704	3050	توزيع أرباح نقدية	2024-03-14	2024-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.922551
705	1182	توزيع أسهم خزينة كأسهم منحة	2024-03-06	2024-05-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.924459
706	1080	توزيع أسهم خزينة كأسهم منحة	2024-02-07	2024-05-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.926748
707	4144	توزيع أرباح نقدية	2024-05-09	2024-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.927721
708	1150	توزيع أرباح نقدية	2024-05-05	2024-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.928372
709	9562	توزيع أرباح نقدية	2024-03-28	2024-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.929631
710	1214	توزيع أسهم خزينة كأسهم منحة	2023-12-13	2024-05-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.929981
711	2282	توزيع أرباح نقدية	2024-03-26	2024-05-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.931031
712	4348	توزيع أرباح نقدية	2024-04-30	2024-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.932342
713	2150	توزيع أرباح نقدية	2024-03-18	2024-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.934371
714	2222	توزيع أرباح نقدية	2024-05-07	2024-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.935341
715	4146	توزيع أرباح نقدية	2024-03-07	2024-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.935587
716	5110	توزيع أرباح نقدية	2024-03-06	2024-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.936714
717	2270	توزيع أرباح نقدية	2024-03-27	2024-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.937235
718	2283	شراء اسهم خزينة	2024-05-13	2024-05-13	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 300000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:08.937949
719	4333	توزيع أرباح نقدية	2024-05-06	2024-05-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.938259
720	9581	توزيع أرباح نقدية	2024-03-05	2024-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.938555
721	4340	توزيع أرباح نقدية	2024-05-01	2024-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.93904
722	9525	توزيع أرباح نقدية	2024-03-28	2024-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.939439
723	4021	توزيع أرباح نقدية	2024-03-26	2024-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.941095
724	4322	توزيع أرباح نقدية	2024-02-28	2024-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.941482
725	4200	توزيع أرباح نقدية	2024-01-28	2024-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.941756
726	4200	توزيع أسهم خزينة كأسهم منحة	2024-01-28	2024-05-06	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.942014
727	1180	توزيع أرباح نقدية	2024-02-25	2024-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.942281
728	1030	توزيع أسهم خزينة كأسهم منحة	2024-02-18	2024-05-01	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.942532
729	2082	توزيع أسهم خزينة كأسهم منحة	2024-02-29	2024-04-30	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.942777
730	2082	توزيع أرباح نقدية	2024-02-29	2024-04-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.943026
731	1140	توزيع أسهم خزينة كأسهم منحة	2024-02-05	2024-04-30	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.943277
732	1140	توزيع أرباح نقدية	2024-02-05	2024-04-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.943517
733	8250	تغيير نظام الشركة	2024-04-29	2024-04-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:08.943763
734	4336	توزيع أرباح نقدية	2024-04-21	2024-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.944002
735	3010	توزيع أرباح نقدية	2024-03-10	2024-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.944238
736	1111	توزيع أرباح نقدية	2024-03-10	2024-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.944487
737	9575	توزيع أرباح نقدية	2024-02-29	2024-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.944716
738	7010	توزيع أرباح نقدية	2024-02-19	2024-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.944947
739	1060	توزيع أرباح نقدية	2024-02-11	2024-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.945201
740	2300	توزيع أرباح نقدية	2023-11-29	2024-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.94546
741	2300	توزيع أسهم خزينة كأسهم منحة	2023-11-29	2024-04-28	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.945934
742	3030	توزيع أرباح نقدية	2024-02-07	2024-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.946207
743	1020	توزيع أسهم خزينة كأسهم منحة	2024-01-25	2024-04-25	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.946448
744	4150	توزيع أرباح نقدية	2024-03-10	2024-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.946675
745	1150	توزيع أسهم خزينة كأسهم منحة	2024-01-01	2024-04-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.946906
746	3092	توزيع أرباح نقدية	2023-12-11	2024-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.947127
747	4142	توزيع أرباح نقدية	2024-03-07	2024-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.947372
748	4335	توزيع أرباح نقدية	2024-03-31	2024-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.947627
749	9557	توزيع أسهم خزينة كأسهم منحة	2023-12-13	2024-04-17	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:08.947879
750	6070	توزيع أرباح نقدية	2024-03-06	2024-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.948156
751	6014	توزيع أرباح نقدية	2024-03-26	2024-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.948411
752	2283	توزيع أرباح نقدية	2024-03-11	2024-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.948664
753	6004	توزيع أرباح نقدية	2024-03-24	2024-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.94892
754	1302	توزيع أرباح نقدية	2024-03-03	2024-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.949185
755	1831	توزيع أرباح نقدية	2024-03-31	2024-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.949528
756	1833	توزيع أرباح نقدية	2024-03-27	2024-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.949841
757	9517	توزيع أرباح نقدية	2024-03-26	2024-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.950096
758	4330	توزيع أرباح نقدية	2024-03-25	2024-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.950432
759	9585	توزيع أرباح نقدية	2024-03-17	2024-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.950822
760	6016	توزيع أرباح نقدية	2024-02-26	2024-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.951084
761	2280	توزيع أرباح نقدية	2023-12-20	2024-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.951914
762	4321	توزيع أرباح نقدية	2024-03-26	2024-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.952135
763	9559	توزيع أرباح نقدية	2024-03-28	2024-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.952335
764	3004	توزيع أرباح نقدية	2024-03-21	2024-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.952566
765	1303	توزيع أرباح نقدية	2024-03-12	2024-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.952819
766	2223	توزيع أرباح نقدية	2024-02-28	2024-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.953092
767	4007	توزيع أرباح نقدية	2024-03-18	2024-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.953347
768	9583	توزيع أرباح نقدية	2024-03-18	2024-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.953597
769	2190	توزيع أرباح نقدية	2024-03-12	2024-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.953841
770	3020	توزيع أرباح نقدية	2024-02-12	2024-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.95408
771	4145	توزيع أرباح نقدية	2023-12-28	2024-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.954342
772	1120	توزيع أرباح نقدية	2024-02-25	2024-03-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.954633
773	1010	توزيع أرباح نقدية	2024-02-13	2024-03-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.954878
774	1830	توزيع أرباح نقدية	2024-03-19	2024-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.955094
775	4164	توزيع أرباح نقدية	2024-03-17	2024-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.955445
776	9541	توزيع أرباح نقدية	2024-02-18	2024-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.955661
777	8260	تخفيض رأس مال - بتخفيض عدد الأسهم	2023-11-09	2024-03-24	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:08.955862
778	4338	توزيع أرباح نقدية	2024-03-18	2024-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.956066
779	4261	توزيع أرباح نقدية	2024-03-14	2024-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.956273
780	4334	توزيع أرباح نقدية	2024-03-14	2024-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.956543
781	3040	توزيع أرباح نقدية	2024-02-21	2024-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.956752
782	2381	توزيع أرباح نقدية	2024-03-18	2024-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.956971
783	9521	توزيع أرباح نقدية	2024-03-11	2024-03-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.957179
784	3080	توزيع أرباح نقدية	2024-03-11	2024-03-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.95739
785	2083	توزيع أرباح نقدية	2024-03-07	2024-03-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.957605
786	2222	توزيع أرباح نقدية	2024-03-10	2024-03-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.95781
787	7203	توزيع أرباح نقدية	2024-03-10	2024-03-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.95802
788	1140	شراء اسهم خزينة	2024-03-14	2024-03-13	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:08.958229
789	4320	توزيع أرباح نقدية	2024-03-07	2024-03-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.958432
790	4003	توزيع أرباح نقدية	2024-03-07	2024-03-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.958636
791	4190	توزيع أرباح نقدية	2024-03-07	2024-03-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.958881
792	4263	توزيع أرباح نقدية	2024-03-04	2024-03-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.959233
793	4012	توزيع أرباح نقدية	2024-02-20	2024-03-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.95949
794	4144	توزيع أرباح نقدية	2024-02-21	2024-03-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.959735
795	9551	توزيع أرباح نقدية	2024-02-19	2024-03-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.959973
796	3001	توزيع أرباح نقدية	2024-02-25	2024-03-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.960211
797	4332	توزيع أرباح نقدية	2024-02-20	2024-03-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.960451
798	2270	توزيع أرباح نقدية	2024-02-27	2024-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.961327
799	7010	توزيع أرباح نقدية	2024-02-19	2024-02-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.961571
800	1030	توزيع أرباح نقدية	2024-02-18	2024-02-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:08.961804
801	2290	توزيع أرباح نقدية	2023-12-25	2024-02-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.416547
802	4013	توزيع أرباح نقدية	2024-02-18	2024-02-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.416949
803	9300	توزيع أرباح نقدية	2024-02-15	2024-02-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.417168
804	4001	توزيع أرباح نقدية	2024-02-07	2024-02-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.417365
805	2160	زيادة رأس مال - إصدار حقوق أولوية	2023-09-14	2024-02-21	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:09.417546
806	3003	توزيع أرباح نقدية	2024-02-14	2024-02-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.417725
807	4339	توزيع أرباح نقدية	2024-01-25	2024-02-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.417891
808	4346	توزيع أرباح نقدية	2024-02-05	2024-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.418065
809	4342	توزيع أرباح نقدية	2024-02-05	2024-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.418236
810	1201	زيادة رأس مال - إصدار حقوق أولوية	2023-03-13	2024-02-14	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:09.418468
811	4163	توزيع أرباح نقدية	2024-01-01	2024-02-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.418642
812	2010	توزيع أرباح نقدية	2023-12-12	2024-02-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.418806
813	1080	توزيع أرباح نقدية	2024-02-06	2024-02-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.418975
814	4348	توزيع أرباح نقدية	2024-01-31	2024-02-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.41914
815	4340	توزيع أرباح نقدية	2024-01-31	2024-02-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.419303
816	2020	توزيع أرباح نقدية	2023-12-17	2024-02-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.419471
817	7040	زيادة رأس مال - إصدار حقوق أولوية	2023-03-30	2024-02-07	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:09.419632
818	1831	تجزئة أسهم	2023-07-10	2024-02-04	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.419796
819	4324	توزيع أرباح نقدية	2023-12-26	2024-02-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.419955
820	4292	توزيع أرباح نقدية	2023-10-29	2024-01-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.420136
821	4336	توزيع أرباح نقدية	2024-01-16	2024-01-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.420302
822	2230	توزيع أرباح نقدية	2023-12-26	2024-01-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.42046
823	4333	توزيع أرباح نقدية	2024-01-15	2024-01-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.420623
824	4004	توزيع أرباح نقدية	2023-12-26	2024-01-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.420799
825	6070	توزيع أرباح نقدية	2023-12-17	2024-01-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.420963
826	2080	توزيع أرباح نقدية	2023-12-12	2024-01-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.421129
827	1322	توزيع أرباح نقدية	2024-01-07	2024-01-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.421349
828	4345	توزيع أرباح نقدية	2024-01-04	2024-01-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.42171
829	9574	توزيع أرباح نقدية	2023-11-05	2024-01-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.422059
830	9556	توزيع أسهم خزينة كأسهم منحة	2023-09-05	2024-01-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.422435
831	6090	تغيير اسم الشركة	2023-12-05	2024-01-07	\N	\N	\N	SAR	تم تعديل اسم الشركة من JAZADCO إلى JAZADCO	2025-12-25 15:06:09.422698
832	4344	توزيع أرباح نقدية	2023-12-27	2024-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.422915
833	4280	توزيع أرباح نقدية	2023-03-30	2024-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.423101
834	1202	زيادة رأس مال - اكتتاب خاص	2023-08-01	2023-12-31	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:09.423288
835	4291	توزيع أرباح نقدية	2023-11-26	2023-12-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.423495
836	2250	توزيع أرباح نقدية	2023-12-17	2023-12-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.423674
837	2310	توزيع أرباح نقدية	2023-12-12	2023-12-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.428769
838	9537	توزيع أرباح نقدية	2023-11-14	2023-12-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.42897
839	9583	توزيع أرباح نقدية	2023-12-03	2023-12-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.429208
840	4191	توزيع أرباح نقدية	2023-11-29	2023-12-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.429536
841	4144	توزيع أرباح نقدية	2023-12-04	2023-12-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.429834
842	2190	تغيير اسم الشركة	2023-10-30	2023-12-05	\N	\N	\N	SAR	تم تعديل اسم الشركة من SISCO إلى SISCO HOLDING	2025-12-25 15:06:09.430138
843	4010	إلغاء الإدراج	2023-12-03	2023-12-04	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2023-12-04	2025-12-25 15:06:09.430443
844	8230	توزيع أسهم خزينة كأسهم منحة	2023-05-14	2023-12-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.430745
845	3040	توزيع أرباح نقدية	2023-11-26	2023-12-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.431047
846	9559	توزيع أرباح نقدية	2023-11-07	2023-12-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.431341
847	4090	زيادة رأس مال - اكتتاب خاص	2023-04-09	2023-12-03	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:09.431653
848	6017	تجزئة أسهم	2023-09-04	2023-11-30	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.431947
849	4142	شراء اسهم خزينة	2023-06-21	2023-11-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 252500 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:09.432254
850	4347	توزيع أرباح نقدية	2023-11-23	2023-11-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.432547
851	4342	توزيع أرباح نقدية	2023-11-19	2023-11-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.432865
852	2300	شراء اسهم خزينة	2023-01-30	2023-11-27	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 105262 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:09.43323
853	4145	توزيع أسهم خزينة كأسهم منحة	2023-09-12	2023-11-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.433567
854	3001	توزيع أرباح نقدية	2023-11-15	2023-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.434006
855	4162	توزيع أرباح نقدية	2023-11-15	2023-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.434345
856	6014	توزيع أرباح نقدية	2023-11-07	2023-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.43465
857	4331	توزيع أرباح نقدية	2023-11-20	2023-11-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.435003
858	9546	توزيع أسهم خزينة كأسهم منحة	2023-03-29	2023-11-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.435325
859	4263	توزيع أرباح نقدية	2023-11-12	2023-11-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.435639
860	9517	توزيع أرباح نقدية	2023-11-09	2023-11-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.435955
861	4161	توزيع أرباح نقدية	2023-11-08	2023-11-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.436274
862	4340	توزيع أرباح نقدية	2023-11-06	2023-11-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.436577
863	8250	توزيع أسهم خزينة كأسهم منحة	2023-05-17	2023-11-19	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.436879
864	4007	توزيع أرباح نقدية	2023-11-05	2023-11-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.437152
865	9525	تجزئة أسهم	2023-10-25	2023-11-16	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.437395
866	2222	توزيع أرباح نقدية	2023-11-07	2023-11-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.437633
867	9550	توزيع أسهم خزينة كأسهم منحة	2023-09-18	2023-11-14	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.437875
868	4261	توزيع أرباح نقدية	2023-11-08	2023-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.438114
869	9535	توزيع أرباح نقدية	2023-11-06	2023-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.438353
870	4004	توزيع أرباح نقدية	2023-11-06	2023-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.438589
871	1301	توزيع أرباح نقدية	2023-11-05	2023-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.438825
872	4348	توزيع أرباح نقدية	2023-10-31	2023-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.439086
873	4333	توزيع أرباح نقدية	2023-11-05	2023-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.43933
874	1150	توزيع أرباح نقدية	2023-10-25	2023-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.439577
875	4141	زيادة رأس مال - إصدار حقوق أولوية	2022-08-21	2023-11-09	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:09.440487
876	2190	شراء اسهم خزينة	2022-08-21	2023-11-09	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 264502 سهم خزينة بينما كانت قد استهدفت شراء 8160000	2025-12-25 15:06:09.440773
877	1180	شراء اسهم خزينة	2023-11-07	2023-11-07	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 10000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:09.441022
878	4190	توزيع أرباح نقدية	2023-11-02	2023-11-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.441192
879	8280	تغيير اسم الشركة	2023-10-10	2023-11-07	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALALAMIYA إلى LIVA	2025-12-25 15:06:09.441406
880	7010	توزيع أرباح نقدية	2023-10-30	2023-11-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.441584
1103	4190	تجزئة أسهم	2023-03-15	2023-05-31	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:11.0098
881	6004	تغيير اسم الشركة	2023-09-14	2023-11-06	\N	\N	\N	SAR	تم تعديل اسم الشركة من CATERING إلى CATRION	2025-12-25 15:06:09.441747
882	6010	زيادة رأس مال - إصدار حقوق أولوية	2023-04-04	2023-11-06	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:09.441983
883	8050	زيادة رأس مال - إصدار حقوق أولوية	2022-08-17	2023-11-06	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:09.442145
884	4013	توزيع أرباح نقدية	2023-10-29	2023-11-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.442305
885	2381	توزيع أرباح نقدية	2023-08-02	2023-11-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.442468
886	1830	توزيع أرباح نقدية	2023-10-29	2023-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.442631
887	9578	توزيع أرباح نقدية	2023-10-22	2023-10-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.442799
888	8312	إلغاء الإدراج	2023-10-25	2023-10-26	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2023-10-26	2025-12-25 15:06:09.442978
889	9555	توزيع أسهم خزينة كأسهم منحة	2023-05-02	2023-10-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.443155
890	4344	توزيع أرباح نقدية	2023-10-18	2023-10-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.443329
891	8070	زيادة رأس مال - اكتتاب خاص	2023-06-15	2023-10-25	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:09.443511
892	4336	توزيع أرباح نقدية	2023-10-16	2023-10-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.443689
893	4050	توزيع أرباح نقدية	2023-10-11	2023-10-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.443876
894	4142	توزيع أرباح نقدية	2023-10-04	2023-10-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.44407
895	9521	توزيع أرباح نقدية	2023-08-21	2023-10-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.444266
896	9543	توزيع أرباح نقدية	2023-08-08	2023-10-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.444448
897	9552	تجزئة أسهم	2023-08-30	2023-10-09	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.444667
898	9513	تجزئة أسهم	2023-07-04	2023-10-09	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.444872
899	4160	زيادة رأس مال - إصدار حقوق أولوية	2019-04-09	2023-10-09	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:09.445063
900	4192	توزيع أرباح نقدية	2023-08-29	2023-10-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.445253
901	2223	توزيع أرباح نقدية	2023-07-30	2023-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.988651
902	4280	توزيع أرباح نقدية	2023-03-30	2023-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.989588
903	9568	تجزئة أسهم	2023-08-28	2023-10-01	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.990398
904	4322	توزيع أرباح نقدية	2023-08-02	2023-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.991046
905	2320	توزيع أسهم خزينة كأسهم منحة	2023-06-15	2023-10-01	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.991521
906	1303	تجزئة أسهم	2023-05-23	2023-10-01	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.991923
907	9536	توزيع أرباح نقدية	2023-09-20	2023-09-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.992245
908	9511	توزيع أرباح نقدية	2023-08-24	2023-09-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.992599
909	9524	تجزئة أسهم	2023-04-09	2023-09-26	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.992881
910	8012	توزيع أسهم خزينة كأسهم منحة	2023-03-30	2023-09-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:09.993219
911	9551	توزيع أرباح نقدية	2023-08-21	2023-09-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.993675
912	4191	توزيع أرباح نقدية	2023-07-27	2023-09-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.994009
913	4330	توزيع أرباح نقدية	2023-08-16	2023-09-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.994324
914	4142	شراء اسهم خزينة	2023-09-17	2023-09-17	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 30000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:09.995808
915	9541	توزيع أرباح نقدية	2023-07-30	2023-09-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.996227
916	6020	تجزئة أسهم	2023-04-27	2023-09-17	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من10.0  to 0.5  وبناءا على ذلك تم زيادة عدد الأسهم من  30.0 مليون سهم إلى 600.0 مليون سهم	2025-12-25 15:06:09.996537
917	7201	تجزئة أسهم	2023-08-16	2023-09-14	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:09.996793
918	1833	توزيع أرباح نقدية	2023-08-08	2023-09-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.997042
919	2010	توزيع أرباح نقدية	2023-06-15	2023-09-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.997293
920	4163	توزيع أرباح نقدية	2023-08-31	2023-09-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.997541
921	3001	توزيع أرباح نقدية	2023-08-23	2023-09-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.997782
922	2222	توزيع أرباح نقدية	2023-08-07	2023-09-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.998025
923	1303	توزيع أرباح نقدية	2023-08-29	2023-09-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.998255
924	9511	تعديل رمز التداول	2023-09-05	2023-09-07	\N	\N	\N	SAR	تم تعديل رمز التداول من 9511 إلى 4323	2025-12-25 15:06:09.998545
925	9511	تعديل رمز التداول	2023-09-04	2023-09-07	\N	\N	\N	SAR	تم تعديل رمز التداول من 9511 إلى 4323	2025-12-25 15:06:09.998783
926	9517	توزيع أرباح نقدية	2023-08-29	2023-09-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.999014
927	9511	تحويل الشركة من سوق ﻵخر	2023-08-20	2023-09-07	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2023-09-07	2025-12-25 15:06:09.999297
928	9572	توزيع أرباح نقدية	2023-08-31	2023-09-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.999576
929	3050	توزيع أرباح نقدية	2023-08-31	2023-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:09.999843
930	2190	توزيع أرباح نقدية	2023-08-24	2023-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.000129
931	9559	توزيع أرباح نقدية	2023-08-13	2023-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.000382
932	1302	توزيع أرباح نقدية	2023-08-03	2023-09-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.000686
933	4014	توزيع أسهم خزينة كأسهم منحة	2023-06-11	2023-09-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.000994
934	1831	توزيع أرباح نقدية	2023-08-28	2023-09-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.001231
935	3092	توزيع أرباح نقدية	2023-08-24	2023-09-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.001461
936	9575	توزيع أرباح نقدية	2023-08-23	2023-09-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.001688
937	4324	توزيع أرباح نقدية	2023-08-10	2023-09-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.002043
938	9552	توزيع أرباح نقدية	2023-08-09	2023-09-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.002282
939	3040	توزيع أرباح نقدية	2023-08-23	2023-08-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.002522
940	8010	توزيع أسهم خزينة كأسهم منحة	2023-05-08	2023-08-29	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.002756
941	4338	توزيع أرباح نقدية	2023-08-23	2023-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.002982
942	4021	توزيع أرباح نقدية	2023-08-13	2023-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.003209
943	4082	توزيع أرباح نقدية	2023-07-20	2023-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.003445
944	9570	توزيع أرباح نقدية	2023-07-12	2023-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.003682
945	4001	توزيع أرباح نقدية	2023-08-10	2023-08-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.00393
946	2282	توزيع أرباح نقدية	2023-08-10	2023-08-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.004193
947	4004	توزيع أرباح نقدية	2023-08-08	2023-08-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.00453
948	4260	توزيع أرباح نقدية	2023-07-27	2023-08-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.004834
949	4051	توزيع أرباح نقدية	2023-08-10	2023-08-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.005288
950	4334	توزيع أرباح نقدية	2023-08-20	2023-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.005586
951	2270	توزيع أرباح نقدية	2023-06-19	2023-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.006044
952	4335	توزيع أرباح نقدية	2023-08-14	2023-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.011739
953	6014	توزيع أرباح نقدية	2023-08-13	2023-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.01204
954	4015	توزيع أرباح نقدية	2023-08-10	2023-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.012321
955	3080	توزيع أرباح نقدية	2023-08-06	2023-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.012618
956	3003	توزيع أرباح نقدية	2023-08-14	2023-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.012887
957	4320	توزيع أرباح نقدية	2023-08-13	2023-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.013149
958	4261	توزيع أرباح نقدية	2023-08-10	2023-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.013414
959	7203	توزيع أرباح نقدية	2023-08-06	2023-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.013691
960	2083	توزيع أرباح نقدية	2023-08-03	2023-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.01396
961	1060	توزيع أرباح نقدية	2023-07-30	2023-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.014239
962	9553	تجزئة أسهم	2023-05-04	2023-08-14	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.014516
963	3010	توزيع أرباح نقدية	2023-08-07	2023-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.014769
964	4013	توزيع أرباح نقدية	2023-08-06	2023-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.01501
965	4164	توزيع أرباح نقدية	2023-08-02	2023-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.015258
966	6004	توزيع أرباح نقدية	2023-08-02	2023-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.015513
967	4348	توزيع أرباح نقدية	2023-07-31	2023-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.01577
968	4150	توزيع أرباح نقدية	2023-07-27	2023-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.016006
969	4342	توزيع أرباح نقدية	2023-08-02	2023-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.016239
970	1150	توزيع أرباح نقدية	2023-07-27	2023-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.016482
971	2250	توزيع أرباح نقدية	2023-08-01	2023-08-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.016705
972	4180	تجزئة أسهم	2023-07-06	2023-08-09	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.016929
973	4146	تجزئة أسهم	2023-06-15	2023-08-09	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.017148
974	1010	شراء اسهم خزينة	2023-03-27	2023-08-09	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.017375
975	4190	توزيع أرباح نقدية	2023-08-03	2023-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.017597
976	4002	توزيع أسهم خزينة كأسهم منحة	2022-12-22	2023-08-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.017824
977	4162	توزيع أرباح نقدية	2023-07-18	2023-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.018071
978	1301	توزيع أرباح نقدية	2023-07-09	2023-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.018302
979	1301	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-11-03	2023-08-07	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:10.018543
980	4144	توزيع أرباح نقدية	2023-08-01	2023-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.018774
981	1830	توزيع أرباح نقدية	2023-07-31	2023-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.018998
982	1030	توزيع أرباح نقدية	2023-07-30	2023-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.019216
983	7010	توزيع أرباح نقدية	2023-07-30	2023-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.019447
984	4344	توزيع أرباح نقدية	2023-07-27	2023-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.019671
985	2150	توزيع أرباح نقدية	2023-07-27	2023-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.019927
986	1050	توزيع أرباح نقدية	2023-07-26	2023-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.020198
987	4003	توزيع أرباح نقدية	2023-07-31	2023-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.020474
988	1180	توزيع أرباح نقدية	2023-07-26	2023-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.02075
989	1322	توزيع أسهم خزينة كأسهم منحة	2022-07-19	2023-08-02	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.02102
990	2283	توزيع أرباح نقدية	2023-07-31	2023-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.021278
991	1120	توزيع أرباح نقدية	2023-07-24	2023-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.024471
992	1201	تخفيض رأس مال - بتخفيض عدد الأسهم	2023-03-13	2023-07-31	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:10.024873
993	1080	توزيع أرباح نقدية	2023-07-24	2023-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.025205
994	1010	توزيع أرباح نقدية	2023-07-19	2023-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.02781
995	7200	توزيع أرباح نقدية	2023-07-11	2023-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.028442
996	4333	توزيع أرباح نقدية	2023-07-19	2023-07-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.028766
997	4012	توزيع أرباح نقدية	2023-07-19	2023-07-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.029025
998	4321	توزيع أرباح نقدية	2023-07-16	2023-07-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.029285
999	9559	توزيع أرباح نقدية	2023-05-21	2023-07-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.029563
1000	4322	توزيع أسهم خزينة كأسهم منحة	2023-03-20	2023-07-23	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.029919
1001	4336	توزيع أرباح نقدية	2023-07-17	2023-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.499996
1002	9300	توزيع أرباح نقدية	2023-07-13	2023-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.501414
1003	2290	توزيع أرباح نقدية	2023-06-04	2023-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.501872
1004	4339	توزيع أرباح نقدية	2023-07-03	2023-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.50229
1005	2020	توزيع أرباح نقدية	2023-06-05	2023-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.50272
1006	1321	توزيع أرباح نقدية	2023-05-25	2023-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.503136
1007	4345	توزيع أرباح نقدية	2023-07-05	2023-07-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.503532
1008	4192	توزيع أرباح نقدية	2023-07-06	2023-07-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.503956
1009	2310	توزيع أرباح نقدية	2023-06-22	2023-07-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.504328
1010	4004	توزيع أرباح نقدية	2023-06-20	2023-07-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.504707
1011	4061	تجزئة أسهم	2023-04-09	2023-07-09	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.505075
1012	4340	توزيع أرباح نقدية	2023-07-02	2023-07-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.505626
1013	2080	توزيع أرباح نقدية	2023-06-21	2023-07-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.506277
1014	9551	توزيع أرباح نقدية	2023-05-04	2023-07-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.506831
1015	9551	تجزئة أسهم	2023-04-12	2023-07-06	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.507197
1016	4130	تجزئة أسهم	2023-05-31	2023-07-05	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.507671
1017	4280	توزيع أرباح نقدية	2023-03-30	2023-07-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.508264
1018	4007	توزيع أرباح نقدية	2023-06-19	2023-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.508664
1019	1202	توزيع أرباح نقدية	2023-05-23	2023-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.508945
1020	9561	توزيع أرباح نقدية	2023-05-21	2023-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.509206
1021	4161	تجزئة أسهم	2023-05-08	2023-07-02	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.509467
1022	4192	تجزئة أسهم	2023-05-07	2023-07-02	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.509728
1023	8210	توزيع أرباح نقدية	2023-05-03	2023-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.510231
1024	9517	تجزئة أسهم	2023-04-30	2023-07-02	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.511247
1025	9515	تجزئة أسهم	2023-04-06	2023-07-02	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.511774
1026	2030	توزيع أرباح نقدية	2023-03-30	2023-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.512228
1027	9546	توزيع أرباح نقدية	2023-03-29	2023-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.512723
1028	7030	توزيع أرباح نقدية	2023-03-26	2023-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.513056
1029	2082	توزيع أرباح نقدية	2023-01-26	2023-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.513436
1030	7211	شراء اسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 728724 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.514771
1031	4146	شراء اسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 31484 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.515052
1032	1050	بيع أسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 301126 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:10.515323
1033	1322	بيع أسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 45750 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:10.515588
1034	2310	بيع أسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 1624382 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:10.51587
1035	4003	بيع أسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 1008268 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:10.516133
1036	7010	بيع أسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 2295145 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:10.516437
1037	7202	بيع أسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 9001 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:10.516706
1038	1060	شراء اسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2950773 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.516982
1039	1140	شراء اسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1285018 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.517302
1040	1180	شراء اسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2818338 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.517575
1041	2280	شراء اسهم خزينة	2023-06-30	2023-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 725890 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.517839
1042	1183	توزيع أرباح نقدية	2023-05-30	2023-06-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.518142
1043	2230	تجزئة أسهم	2023-05-23	2023-06-22	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.518416
1044	4071	توزيع أرباح نقدية	2023-05-21	2023-06-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.518682
1045	4110	تجزئة أسهم	2023-05-01	2023-06-22	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.519056
1046	1820	تجزئة أسهم	2023-04-10	2023-06-22	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.519329
1047	1303	توزيع أسهم خزينة كأسهم منحة	2023-03-29	2023-06-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.51959
1048	4012	تجزئة أسهم	2023-05-08	2023-06-21	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.51991
1049	9524	توزيع أسهم خزينة كأسهم منحة	2023-04-09	2023-06-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.520169
1050	4021	تجزئة أسهم	2023-04-09	2023-06-21	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.520461
1051	9542	تجزئة أسهم	2023-03-30	2023-06-21	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.520857
1052	9542	توزيع أرباح نقدية	2023-03-30	2023-06-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.521271
1053	4142	توزيع أرباح نقدية	2023-03-12	2023-06-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.521737
1054	9560	تجزئة أسهم	2023-05-21	2023-06-20	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.522161
1055	9556	توزيع أرباح نقدية	2023-05-10	2023-06-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.522583
1056	9556	تجزئة أسهم	2023-05-01	2023-06-20	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.522993
1057	4011	توزيع أرباح نقدية	2023-03-23	2023-06-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.52338
1058	4005	توزيع أرباح نقدية	2023-03-21	2023-06-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.523666
1059	4030	توزيع أسهم خزينة كأسهم منحة	2023-03-15	2023-06-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.523948
1060	4030	توزيع أرباح نقدية	2023-03-15	2023-06-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.524214
1061	8250	توزيع أرباح نقدية	2023-05-17	2023-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.524476
1062	7211	تجزئة أسهم	2023-04-17	2023-06-19	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.524745
1063	9530	توزيع أرباح نقدية	2023-04-02	2023-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.525021
1064	9516	توزيع أرباح نقدية	2023-03-30	2023-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.52528
1065	9527	توزيع أرباح نقدية	2023-03-22	2023-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.525543
1066	4081	توزيع أسهم خزينة كأسهم منحة	2022-11-30	2023-06-19	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.526795
1067	1832	تجزئة أسهم	2023-05-14	2023-06-15	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.527062
1068	4324	تجزئة أسهم	2023-05-10	2023-06-15	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.527329
1069	9541	تجزئة أسهم	2023-04-03	2023-06-15	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.52761
1070	1210	توزيع أرباح نقدية	2023-03-22	2023-06-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.527865
1071	1150	شراء اسهم خزينة	2023-06-14	2023-06-14	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.528131
1072	9545	تجزئة أسهم	2023-05-10	2023-06-14	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.528395
1073	1060	تغيير اسم الشركة	2023-05-09	2023-06-13	\N	\N	\N	SAR	تم تعديل اسم الشركة من SABB إلى SAB	2025-12-25 15:06:10.528739
1074	4170	تجزئة أسهم	2023-05-02	2023-06-13	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.529074
1075	9550	توزيع أرباح نقدية	2023-04-02	2023-06-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.529414
1076	9547	تجزئة أسهم	2023-03-30	2023-06-13	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.529751
1077	3030	توزيع أرباح نقدية	2023-06-07	2023-06-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.530081
1078	9544	تجزئة أسهم	2023-04-12	2023-06-12	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.530417
1079	1831	توزيع أسهم خزينة كأسهم منحة	2023-03-07	2023-06-11	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.530774
1080	2330	شراء اسهم خزينة	2023-06-07	2023-06-08	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1500000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:10.531099
1081	8010	توزيع أرباح نقدية	2023-05-08	2023-06-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.531459
1082	2281	توزيع أرباح نقدية	2023-04-27	2023-06-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.531788
1083	7204	تجزئة أسهم	2023-04-11	2023-06-08	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.532128
1084	1211	توزيع أسهم خزينة كأسهم منحة	2023-02-13	2023-06-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.532463
1085	9522	توزيع أسهم خزينة كأسهم منحة	2022-09-07	2023-06-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.532752
1086	3001	توزيع أرباح نقدية	2023-05-17	2023-06-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.533029
1087	4100	توزيع أرباح نقدية	2023-03-30	2023-06-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.533317
1088	9513	توزيع أسهم خزينة كأسهم منحة	2023-03-26	2023-06-07	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:10.533608
1089	1322	توزيع أرباح نقدية	2023-05-31	2023-06-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.533895
1090	4001	تجزئة أسهم	2023-04-25	2023-06-06	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.534168
1091	9543	توزيع أرباح نقدية	2023-03-27	2023-06-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.534475
1092	2120	توزيع أرباح نقدية	2023-03-27	2023-06-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.534771
1093	4261	توزيع أرباح نقدية	2023-06-01	2023-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.53506
1094	2320	توزيع أرباح نقدية	2023-04-02	2023-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.535346
1095	9515	توزيع أرباح نقدية	2023-03-30	2023-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.535626
1096	7020	توزيع أرباح نقدية	2023-02-20	2023-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.535905
1097	3060	توزيع أرباح نقدية	2023-05-29	2023-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.536241
1098	4161	توزيع أرباح نقدية	2023-05-23	2023-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.536513
1099	3004	توزيع أرباح نقدية	2023-05-22	2023-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:10.536791
1100	9535	تجزئة أسهم	2023-04-04	2023-06-01	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:10.537069
1101	6016	تجزئة أسهم	2023-03-22	2023-06-01	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:11.008853
1102	3050	توزيع أرباح نقدية	2023-03-28	2023-05-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.009504
1104	4342	توزيع أرباح نقدية	2023-05-22	2023-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.010071
1105	1150	توزيع أرباح نقدية	2023-05-15	2023-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.011876
1106	2050	شراء اسهم خزينة	2023-05-29	2023-05-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2182858 سهم خزينة بينما كانت قد استهدفت شراء 2500000	2025-12-25 15:06:11.012279
1107	3040	توزيع أرباح نقدية	2023-05-24	2023-05-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.012627
1108	1212	توزيع أرباح نقدية	2023-03-16	2023-05-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.013041
1109	4347	توزيع أرباح نقدية	2023-05-22	2023-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.013356
1110	9549	توزيع أرباح نقدية	2022-12-12	2023-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.013636
1111	1050	توزيع أرباح نقدية	2022-12-13	2023-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.013936
1112	6014	توزيع أرباح نقدية	2023-05-14	2023-05-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.014211
1113	1830	توزيع أرباح نقدية	2023-05-16	2023-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.015981
1114	3007	توزيع أرباح نقدية	2023-03-02	2023-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.016476
1115	7010	توزيع أرباح نقدية	2023-05-10	2023-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.016797
1116	4348	توزيع أرباح نقدية	2023-04-30	2023-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.017109
1117	4003	توزيع أرباح نقدية	2023-04-13	2023-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.017389
1118	4006	توزيع أرباح نقدية	2023-03-29	2023-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.017676
1119	2330	توزيع أرباح نقدية	2023-02-21	2023-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.017937
1120	2222	توزيع أرباح نقدية	2023-05-09	2023-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.018225
1121	4190	توزيع أرباح نقدية	2023-05-08	2023-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.018536
1122	9535	توزيع أرباح نقدية	2023-03-22	2023-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.018817
1123	4280	توزيع أرباح نقدية	2023-03-30	2023-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.019095
1124	9557	توزيع أسهم خزينة كأسهم منحة	2022-12-26	2023-05-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.019413
1125	4013	توزيع أرباح نقدية	2023-05-07	2023-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.019736
1126	4340	توزيع أرباح نقدية	2023-05-03	2023-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.020205
1127	4340	زيادة رأس مال - إصدار حقوق أولوية	2023-04-05	2023-05-14	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.020501
1128	2050	توزيع أرباح نقدية	2023-03-27	2023-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.020778
1129	1111	توزيع أرباح نقدية	2023-02-26	2023-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.021049
1130	4344	توزيع أرباح نقدية	2023-05-07	2023-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.021318
1131	5110	توزيع أرباح نقدية	2023-03-15	2023-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.021584
1132	7202	توزيع أرباح نقدية	2023-02-16	2023-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.021831
1133	4162	توزيع أرباح نقدية	2023-03-23	2023-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.022128
1134	6002	توزيع أرباح نقدية	2023-03-16	2023-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.022484
1135	2222	توزيع أسهم خزينة كأسهم منحة	2023-03-12	2023-05-09	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.022886
1136	4333	توزيع أرباح نقدية	2023-05-03	2023-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.023232
1137	1180	توزيع أرباح نقدية	2023-01-12	2023-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.023577
1138	1180	توزيع أسهم خزينة كأسهم منحة	2023-01-12	2023-05-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.023899
1139	4002	توزيع أرباح نقدية	2022-12-22	2023-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.024201
1140	6060	زيادة رأس مال - إصدار حقوق أولوية	2020-12-30	2023-05-08	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.024509
1141	4180	توزيع أرباح نقدية	2023-01-01	2023-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.025018
1142	1060	توزيع أرباح نقدية	2023-02-14	2023-05-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.025291
1143	3092	توزيع أرباح نقدية	2022-12-20	2023-05-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.025535
1144	4322	تجزئة أسهم	2023-03-20	2023-05-03	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:11.025783
1145	1182	توزيع أرباح نقدية	2023-03-16	2023-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.026053
1146	4051	توزيع أرباح نقدية	2023-03-16	2023-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.026323
1147	4322	توزيع أرباح نقدية	2023-03-01	2023-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.026924
1148	9525	توزيع أرباح نقدية	2023-03-29	2023-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.027399
1149	4200	توزيع أرباح نقدية	2023-01-22	2023-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.028029
1150	1140	توزيع أرباح نقدية	2023-01-01	2023-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.028396
1151	2190	توزيع أرباح نقدية	2023-04-10	2023-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.028696
1152	4150	توزيع أرباح نقدية	2023-03-21	2023-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.028984
1153	4144	توزيع أرباح نقدية	2023-03-15	2023-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.029353
1154	2223	توزيع أرباح نقدية	2023-02-19	2023-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.029678
1155	1150	توزيع أرباح نقدية	2022-12-21	2023-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.029975
1156	4344	زيادة رأس مال - إصدار حقوق أولوية	2023-04-09	2023-04-18	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.030252
1157	4339	توزيع أرباح نقدية	2023-04-02	2023-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.030556
1158	4336	توزيع أرباح نقدية	2023-04-11	2023-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.030828
1159	4260	توزيع أرباح نقدية	2023-02-23	2023-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.0311
1160	3030	توزيع أرباح نقدية	2023-02-01	2023-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.031363
1162	4345	توزيع أرباح نقدية	2023-04-09	2023-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.031939
1163	3002	توزيع أرباح نقدية	2023-03-12	2023-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.033392
1164	2280	توزيع أرباح نقدية	2022-12-20	2023-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.033696
1165	4146	توزيع أرباح نقدية	2023-03-13	2023-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.033966
1166	1030	توزيع أرباح نقدية	2022-12-25	2023-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.034261
1167	9536	توزيع أرباح نقدية	2023-03-30	2023-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.034632
1168	3010	توزيع أرباح نقدية	2023-02-23	2023-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.035036
1169	9517	توزيع أرباح نقدية	2023-04-03	2023-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.035375
1170	4330	توزيع أرباح نقدية	2023-03-26	2023-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.035718
1171	4163	توزيع أرباح نقدية	2023-03-21	2023-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.036044
1172	9540	تجزئة أسهم	2023-02-26	2023-04-06	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:11.036383
1173	9541	توزيع أرباح نقدية	2022-12-27	2023-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.036726
1174	4321	توزيع أرباح نقدية	2023-04-02	2023-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.03706
1175	7203	توزيع أرباح نقدية	2023-03-28	2023-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.037402
1176	4261	توزيع أرباح نقدية	2023-03-29	2023-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.037743
1177	6014	توزيع أرباح نقدية	2023-03-26	2023-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.03808
1178	6004	توزيع أرباح نقدية	2023-03-23	2023-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.038405
1179	4070	زيادة رأس مال - إصدار حقوق أولوية	2021-07-14	2023-04-03	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.038698
1180	9559	توزيع أرباح نقدية	2023-03-27	2023-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.038993
1181	9511	توزيع أرباح نقدية	2023-03-23	2023-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.039279
1182	4021	توزيع أرباح نقدية	2023-03-19	2023-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.039578
1183	4164	توزيع أرباح نقدية	2023-03-20	2023-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.03986
1184	1080	توزيع أرباح نقدية	2022-12-21	2023-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.040154
1185	1183	تغيير اسم الشركة	2023-01-19	2023-03-28	\N	\N	\N	SAR	تم تعديل اسم الشركة من SHL إلى SHL	2025-12-25 15:06:11.040448
1186	3080	توزيع أرباح نقدية	2023-03-20	2023-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.040716
1187	2020	توزيع أرباح نقدية	2022-12-20	2023-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.040994
1188	1010	توزيع أرباح نقدية	2022-12-19	2023-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.041263
1189	4192	توزيع أرباح نقدية	2023-03-19	2023-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.041535
1190	1302	توزيع أرباح نقدية	2023-03-05	2023-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.041802
1191	2270	تغيير السنة المالية	2023-08-24	2023-03-22	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:11.042133
1192	3003	توزيع أرباح نقدية	2023-03-19	2023-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.042466
1193	4012	توزيع أرباح نقدية	2023-02-28	2023-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.042735
1194	3040	توزيع أرباح نقدية	2023-02-20	2023-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.043027
1195	1120	توزيع أرباح نقدية	2023-01-15	2023-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.043334
1196	4190	توزيع أرباح نقدية	2023-03-15	2023-03-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.04359
1197	3020	توزيع أرباح نقدية	2023-02-15	2023-03-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.043867
1198	4334	توزيع أرباح نقدية	2023-03-13	2023-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.044131
1199	4320	توزيع أرباح نقدية	2023-03-12	2023-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.044401
1200	6070	توزيع أرباح نقدية	2023-03-05	2023-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.044694
1201	2222	توزيع أرباح نقدية	2023-03-12	2023-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.524415
1202	1830	توزيع أرباح نقدية	2023-03-12	2023-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.526799
1203	4338	توزيع أرباح نقدية	2023-03-09	2023-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.527098
1204	4342	توزيع أرباح نقدية	2023-03-07	2023-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.527385
1205	2040	توزيع أرباح نقدية	2023-02-23	2023-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.527651
1206	1831	توزيع أرباح نقدية	2023-03-07	2023-03-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.52792
1207	4007	توزيع أرباح نقدية	2023-03-02	2023-03-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.528206
1208	2083	توزيع أرباح نقدية	2023-03-02	2023-03-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.528471
1209	2290	توزيع أرباح نقدية	2022-12-25	2023-03-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.528726
1210	7010	توزيع أرباح نقدية	2023-02-20	2023-02-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.528968
1211	7200	توزيع أرباح نقدية	2023-01-10	2023-02-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.529226
1212	4336	زيادة رأس مال - اكتتاب خاص	2022-01-30	2023-02-27	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:11.529482
1213	4336	زيادة رأس مال - إصدار حقوق أولوية	2022-01-30	2023-02-27	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.529753
1214	4013	توزيع أرباح نقدية	2023-02-19	2023-02-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.530022
1215	4001	توزيع أرباح نقدية	2023-02-12	2023-02-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.530264
1216	2010	توزيع أرباح نقدية	2022-12-13	2023-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.530509
1217	4340	توزيع أرباح نقدية	2023-02-06	2023-02-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.530772
1218	9551	توزيع أرباح نقدية	2022-12-28	2023-02-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.531394
1219	4348	توزيع أرباح نقدية	2023-01-31	2023-02-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.531849
1220	4335	توزيع أرباح نقدية	2023-01-23	2023-02-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.532272
1221	2150	توزيع أرباح نقدية	2022-12-28	2023-02-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.532628
1222	9552	توزيع أرباح نقدية	2022-12-26	2023-02-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.532917
1223	4333	توزيع أرباح نقدية	2023-01-25	2023-01-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.533176
1224	4336	توزيع أرباح نقدية	2023-01-18	2023-01-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.533434
1225	2120	توزيع أسهم خزينة كأسهم منحة	2022-05-23	2023-01-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.533707
1226	9532	توزيع أسهم خزينة كأسهم منحة	2022-06-19	2023-01-25	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.533965
1227	9532	زيادة رأس المال المصرح به	2022-06-19	2023-01-25	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  31250000 إلى  46875000	2025-12-25 15:06:11.534276
1228	4321	توزيع أرباح نقدية	2023-01-02	2023-01-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.534597
1229	2230	توزيع أرباح نقدية	2022-12-19	2023-01-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.534869
1230	4292	توزيع أرباح نقدية	2022-12-07	2023-01-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.535186
1231	4339	توزيع أرباح نقدية	2023-01-01	2023-01-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.535435
1232	2282	توزيع أرباح نقدية	2022-12-13	2023-01-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.535688
1233	2270	توزيع أرباح نقدية	2023-01-03	2023-01-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.536909
1234	4192	توزيع أرباح نقدية	2022-12-27	2023-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.537191
1235	4144	توزيع أرباح نقدية	2022-12-27	2023-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.537534
1236	4344	توزيع أرباح نقدية	2022-12-25	2023-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.537786
1237	4280	توزيع أرباح نقدية	2022-03-27	2023-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.538694
1238	1050	شراء اسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 307060 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.538937
1239	2310	شراء اسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 432710 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.539185
1240	4003	شراء اسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3553452 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.539443
1241	7010	شراء اسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 8192441 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.539708
1242	8210	شراء اسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 154032 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.539962
1243	7202	بيع أسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 166250 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:11.540226
1244	1180	بيع أسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 8062 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:11.541282
1245	1322	بيع أسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 256637 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:11.54154
1246	2050	بيع أسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 18760 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:11.54179
1247	2280	بيع أسهم خزينة	2022-12-29	2022-12-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 1077250 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:11.54204
1248	4240	تغيير السنة المالية	2022-12-07	2022-12-29	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:11.542309
1249	4321	تغيير السنة المالية	2022-12-07	2022-12-29	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:11.542569
1250	4291	توزيع أرباح نقدية	2022-11-16	2022-12-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.542819
1251	4004	زيادة رأس مال - اكتتاب خاص	2022-06-21	2022-12-28	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:11.543148
1252	4050	توزيع أرباح نقدية	2022-12-19	2022-12-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.543761
1253	1182	تغيير اسم الشركة	2022-11-21	2022-12-25	\N	\N	\N	SAR	تم تعديل اسم الشركة من AMLAK إلى AMLAK	2025-12-25 15:06:11.544131
1254	8210	توزيع أسهم خزينة كأسهم منحة	2022-06-13	2022-12-25	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.544535
1255	4004	توزيع أرباح نقدية	2022-12-19	2022-12-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.544858
1256	3001	توزيع أرباح نقدية	2022-12-14	2022-12-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.545146
1257	2080	توزيع أرباح نقدية	2022-12-11	2022-12-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.545403
1258	7204	توزيع أرباح نقدية	2022-12-06	2022-12-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.545655
1259	3060	توزيع أرباح نقدية	2022-12-11	2022-12-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.545896
1260	4347	توزيع أرباح نقدية	2022-12-08	2022-12-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.54614
1261	2250	توزيع أرباح نقدية	2022-12-05	2022-12-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.546374
1262	4007	توزيع أرباح نقدية	2022-11-30	2022-12-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.546651
1263	2330	توزيع أرباح نقدية	2022-09-28	2022-12-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.546881
1264	2310	توزيع أرباح نقدية	2022-12-01	2022-12-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.547131
1265	4342	توزيع أرباح نقدية	2022-11-28	2022-12-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.547379
1266	4240	تغيير اسم الشركة	2022-12-05	2022-12-05	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALHOKAIR إلى CENOMI RETAIL	2025-12-25 15:06:11.547638
1267	4321	تغيير اسم الشركة	2022-12-05	2022-12-05	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALMRAKEZ إلى CENOMI CENTERS	2025-12-25 15:06:11.547921
1268	7010	شراء اسهم خزينة	2022-11-30	2022-11-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 11587718 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.548726
1269	9545	توزيع أرباح نقدية	2022-10-16	2022-11-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.548961
1270	9517	تغيير اسم الشركة	2022-10-17	2022-11-29	\N	\N	\N	SAR	تم تعديل اسم الشركة من MOBI إلى MOBI INDUSTRY	2025-12-25 15:06:11.549207
1271	6014	توزيع أرباح نقدية	2022-11-16	2022-11-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.54946
1272	4334	توزيع أرباح نقدية	2022-11-20	2022-11-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.549704
1273	1202	زيادة رأس المال المصرح به	2022-08-14	2022-11-27	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  500000000 إلى  666666660	2025-12-25 15:06:11.549942
1274	1202	توزيع أسهم خزينة كأسهم منحة	2022-08-14	2022-11-27	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.55018
1275	3040	توزيع أرباح نقدية	2022-11-22	2022-11-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.55042
1276	1322	توزيع أرباح نقدية	2022-11-14	2022-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.550672
1277	4001	توزيع أرباح نقدية	2022-11-16	2022-11-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.550991
1278	4170	زيادة رأس مال - إصدار حقوق أولوية	2021-08-24	2022-11-21	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.551445
1279	8160	زيادة رأس مال - إصدار حقوق أولوية	2018-12-23	2022-11-21	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.551918
1280	4261	توزيع أرباح نقدية	2022-11-14	2022-11-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.552315
1281	4190	توزيع أرباح نقدية	2022-11-09	2022-11-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.55299
1282	4348	توزيع أرباح نقدية	2022-10-31	2022-11-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.553381
1283	2081	توزيع أرباح نقدية	2022-11-03	2022-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.553773
1284	2222	توزيع أرباح نقدية	2022-11-01	2022-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.554164
1285	9530	شراء اسهم خزينة	2022-11-08	2022-11-08	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 210000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.554554
1286	1830	توزيع أرباح نقدية	2022-10-31	2022-11-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.554941
1287	8311	زيادة رأس المال المصرح به	2022-08-18	2022-11-07	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  100000000 إلى  230000000	2025-12-25 15:06:11.555265
1288	8311	زيادة رأس مال - إصدار حقوق أولوية	2022-08-18	2022-11-07	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:11.555578
1289	9535	توزيع أرباح نقدية	2022-09-07	2022-11-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.55589
1290	7010	توزيع أرباح نقدية	2022-10-27	2022-11-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.556234
1291	4144	توزيع أرباح نقدية	2022-10-13	2022-11-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.556568
1292	4324	توزيع أرباح نقدية	2022-10-27	2022-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.556908
1293	4013	توزيع أرباح نقدية	2022-10-23	2022-10-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.557232
1294	4336	توزيع أرباح نقدية	2022-10-17	2022-10-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:11.557562
1295	8311	تخفيض رأس المال المصرح به	2022-08-18	2022-10-23	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  150000000 الى  100000000	2025-12-25 15:06:11.557888
1296	8311	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-08-18	2022-10-23	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:11.558208
1297	8080	إلغاء الإدراج	2022-10-20	2022-10-20	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2022-10-20	2025-12-25 15:06:11.558531
1298	1321	توزيع أسهم خزينة كأسهم منحة	2022-08-08	2022-10-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:11.558846
1299	1321	زيادة رأس المال المصرح به	2022-08-08	2022-10-20	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  210000000 إلى  315000000	2025-12-25 15:06:11.559187
1300	2310	شراء اسهم خزينة	2022-04-19	2022-10-20	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1103131 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:11.559515
1301	4333	توزيع أرباح نقدية	2022-10-17	2022-10-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.033799
1302	8060	زيادة رأس مال - اكتتاب خاص	2022-02-27	2022-10-19	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:12.0345
1303	4331	توزيع أرباح نقدية	2022-10-16	2022-10-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.034824
1304	8180	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-09-05	2022-10-18	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.035097
1305	8180	تخفيض رأس المال المصرح به	2022-09-05	2022-10-18	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  400000000 الى  140000000	2025-12-25 15:06:12.035362
1306	2300	زيادة رأس المال المصرح به	2021-10-18	2022-10-18	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  337000000 إلى  192000000	2025-12-25 15:06:12.03562
1307	2300	زيادة رأس مال - إصدار حقوق أولوية	2021-10-18	2022-10-18	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:12.03589
1308	4339	توزيع أرباح نقدية	2022-10-02	2022-10-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.036147
1309	1202	توزيع أرباح نقدية	2022-10-09	2022-10-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.036408
1310	4346	توزيع أرباح نقدية	2022-09-29	2022-10-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.036677
1311	1820	تخفيض رأس المال المصرح به	2022-06-13	2022-10-12	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  650000000 الى  315000000	2025-12-25 15:06:12.036934
1312	4150	توزيع أرباح نقدية	2022-09-29	2022-10-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.037185
1313	1820	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-06-13	2022-10-11	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.037445
1314	3004	توزيع أرباح نقدية	2022-10-03	2022-10-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.037703
1315	6012	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-08-25	2022-10-10	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.03796
1316	3002	توزيع أرباح نقدية	2022-10-02	2022-10-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.038218
1317	4344	توزيع أرباح نقدية	2022-09-29	2022-10-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.038474
1318	9517	توزيع أرباح نقدية	2022-09-29	2022-10-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.038992
1319	6012	تغيير نظام الشركة	2022-09-28	2022-10-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.039429
1320	6012	تخفيض رأس المال المصرح به	2022-08-25	2022-10-06	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  337500000 الى  158084670	2025-12-25 15:06:12.039694
1321	4003	زيادة رأس المال المصرح به	2022-08-09	2022-10-06	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  600000000 إلى  800000000	2025-12-25 15:06:12.039979
1322	4003	زيادة رأس مال - اكتتاب خاص	2022-08-09	2022-10-06	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:12.040397
1323	4003	تغيير نظام الشركة	2022-08-09	2022-10-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.040702
1324	4003	توزيع أسهم خزينة كأسهم منحة	2022-08-09	2022-10-06	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.040952
1325	4071	توزيع أرباح نقدية	2022-09-04	2022-10-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.041268
1326	7200	توزيع أرباح نقدية	2022-07-03	2022-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.041522
1327	7203	توزيع أرباح نقدية	2022-09-21	2022-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.041791
1328	4322	توزيع أرباح نقدية	2022-08-09	2022-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.042072
1329	4280	توزيع أرباح نقدية	2022-03-27	2022-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.042368
1330	7202	بيع أسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 151942 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:12.042642
1331	1050	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 50000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.042906
1332	1140	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 4342593 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.04321
1333	1180	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 6444720 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.043499
1334	1322	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1458850 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.043794
1335	2330	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 849345 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.044157
1336	3001	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1493478 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.044489
1337	4003	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1262329 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.044862
1338	7010	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1095625 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.056518
1339	8210	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 38147 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.05693
1340	7211	شراء اسهم خزينة	2022-09-30	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1400 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.057195
1341	2270	شراء اسهم خزينة	2020-10-27	2022-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 500250 سهم خزينة بينما كانت قد استهدفت شراء 2749750	2025-12-25 15:06:12.057447
1342	4004	توزيع أرباح نقدية	2022-09-21	2022-09-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.057715
1343	3040	توزيع أرباح نقدية	2022-09-13	2022-09-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.058078
1344	4191	توزيع أرباح نقدية	2022-07-28	2022-09-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.058353
1345	4007	توزيع أرباح نقدية	2022-09-11	2022-09-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.058607
1346	4320	توزيع أرباح نقدية	2022-08-25	2022-09-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.058851
1347	3092	توزيع أرباح نقدية	2022-09-05	2022-09-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.059099
1348	2080	توزيع أرباح نقدية	2022-08-14	2022-09-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.059338
1349	3050	توزيع أرباح نقدية	2022-09-08	2022-09-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.059662
1350	3003	توزيع أرباح نقدية	2022-09-08	2022-09-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.059946
1351	4145	توزيع أرباح نقدية	2022-09-06	2022-09-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.060262
1352	4021	توزيع أرباح نقدية	2022-08-30	2022-09-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.060551
1353	4161	توزيع أرباح نقدية	2022-08-24	2022-09-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.060844
1354	2010	توزيع أرباح نقدية	2022-06-19	2022-09-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.061184
1355	4050	توزيع أرباح نقدية	2022-09-05	2022-09-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.061543
1356	9536	توزيع أرباح نقدية	2022-08-31	2022-09-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.061815
1357	4261	توزيع أرباح نقدية	2022-08-30	2022-09-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.062068
1358	2330	توزيع أرباح نقدية	2022-07-06	2022-09-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.062318
1359	4342	توزيع أرباح نقدية	2022-09-01	2022-09-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.062566
1360	4163	توزيع أرباح نقدية	2022-08-23	2022-09-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.062833
1361	1831	توزيع أرباح نقدية	2022-08-30	2022-09-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.06309
1362	4330	توزيع أرباح نقدية	2022-08-29	2022-09-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.063386
1363	9511	توزيع أرباح نقدية	2022-08-03	2022-09-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.063644
1364	3001	توزيع أرباح نقدية	2022-08-25	2022-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.063883
1365	4001	توزيع أرباح نقدية	2022-08-18	2022-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.064111
1366	3010	توزيع أرباح نقدية	2022-08-09	2022-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.066418
1367	3091	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-04-04	2022-09-01	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.066673
1368	6014	توزيع أرباح نقدية	2022-08-22	2022-08-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.066904
1369	7010	توزيع أسهم خزينة كأسهم منحة	2022-06-12	2022-08-31	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.067139
1370	4250	زيادة رأس مال - اكتتاب خاص	2021-09-13	2022-08-28	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:12.067399
1371	9541	توزيع أرباح نقدية	2022-07-20	2022-08-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.06768
1372	2222	توزيع أرباح نقدية	2022-08-14	2022-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.06804
1373	2190	توزيع أرباح نقدية	2022-08-11	2022-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.068377
1374	1302	توزيع أرباح نقدية	2022-08-09	2022-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.068911
1375	4260	توزيع أرباح نقدية	2022-07-31	2022-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.069206
1376	4348	توزيع أرباح نقدية	2022-07-31	2022-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.069513
1377	9524	توزيع أسهم خزينة كأسهم منحة	2022-04-14	2022-08-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.069819
1378	8050	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-03-17	2022-08-21	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.070117
1379	4051	توزيع أرباح نقدية	2022-08-09	2022-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.070415
1380	6070	توزيع أرباح نقدية	2022-08-10	2022-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.070822
1381	4164	توزيع أرباح نقدية	2022-08-09	2022-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.071115
1382	3080	توزيع أرباح نقدية	2022-08-03	2022-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.071395
1383	4003	توزيع أرباح نقدية	2022-08-09	2022-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.071667
1384	4013	توزيع أرباح نقدية	2022-08-07	2022-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.071935
1385	1830	توزيع أرباح نقدية	2022-08-07	2022-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.07222
1386	4340	توزيع أرباح نقدية	2022-08-03	2022-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.072513
1387	4190	توزيع أرباح نقدية	2022-08-04	2022-08-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.072811
1388	7010	توزيع أرباح نقدية	2022-08-03	2022-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.073101
1389	1301	توزيع أرباح نقدية	2022-08-01	2022-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.07338
1390	1020	توزيع أرباح نقدية	2022-08-01	2022-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.073655
1391	4144	توزيع أسهم خزينة كأسهم منحة	2022-03-23	2022-08-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.073944
1392	4012	توزيع أرباح نقدية	2022-07-28	2022-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.074212
1393	2040	توزيع أرباح نقدية	2022-07-13	2022-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.074507
1394	4345	توزيع أرباح نقدية	2022-07-27	2022-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.074802
1395	1030	توزيع أرباح نقدية	2022-07-24	2022-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.075069
1396	4162	توزيع أرباح نقدية	2022-07-18	2022-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.07533
1397	1150	توزيع أرباح نقدية	2022-07-17	2022-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.075655
1398	1010	توزيع أرباح نقدية	2022-07-18	2022-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.075994
1399	2110	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-06-02	2022-07-28	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.076367
1400	4333	توزيع أرباح نقدية	2022-07-25	2022-07-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.076714
1401	4338	توزيع أرباح نقدية	2022-07-20	2022-07-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.645802
1402	1322	توزيع أرباح نقدية	2022-07-19	2022-07-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.646733
1403	4335	توزيع أرباح نقدية	2022-07-17	2022-07-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.647038
1404	4230	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-04-14	2022-07-27	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.647372
1405	4336	توزيع أرباح نقدية	2022-07-18	2022-07-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.647658
1406	1050	توزيع أرباح نقدية	2022-06-30	2022-07-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.647958
1407	1213	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-03-30	2022-07-21	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.648218
1408	4339	توزيع أرباح نقدية	2022-07-03	2022-07-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.648476
1409	2020	توزيع أرباح نقدية	2022-06-29	2022-07-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.648779
1410	1060	توزيع أرباح نقدية	2022-07-04	2022-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.649044
1411	4344	توزيع أرباح نقدية	2022-07-03	2022-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.64931
1412	1180	توزيع أرباح نقدية	2022-07-03	2022-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.649595
1413	2310	توزيع أرباح نقدية	2022-06-29	2022-07-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.650102
1414	4321	توزيع أرباح نقدية	2022-07-03	2022-07-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.650489
1415	4240	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-11-11	2022-07-04	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.650889
1416	8210	توزيع أرباح نقدية	2022-06-06	2022-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.651302
1417	2170	توزيع أرباح نقدية	2022-06-05	2022-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.651714
1418	2082	توزيع أرباح نقدية	2022-06-01	2022-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.65213
1419	2250	توزيع أرباح نقدية	2022-04-17	2022-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.652566
1420	6016	توزيع أسهم خزينة كأسهم منحة	2022-03-30	2022-07-03	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.652989
1421	4280	توزيع أرباح نقدية	2022-03-27	2022-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.653296
1422	4011	توزيع أرباح نقدية	2022-03-17	2022-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.65371
1423	8170	توزيع أسهم خزينة كأسهم منحة	2022-03-03	2022-07-03	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.654347
1424	6017	شراء اسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 192000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.654755
1425	1180	بيع أسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 94219 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:12.655169
1426	2280	بيع أسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 76000 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:12.655518
1427	1050	شراء اسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5407715 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.655844
1428	1303	شراء اسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 500000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.656198
1429	2050	شراء اسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1328706 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.656579
1430	2310	شراء اسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 8793384 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.6571
1431	7010	شراء اسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 8533732 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.657458
1432	8210	شراء اسهم خزينة	2022-06-30	2022-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 50150 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.657733
1433	1080	توزيع أرباح نقدية	2022-06-27	2022-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.658011
1434	4014	توزيع أرباح نقدية	2022-05-24	2022-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.658292
1435	9530	توزيع أرباح نقدية	2022-03-13	2022-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.658561
1436	4292	زيادة رأس مال - اكتتاب خاص	2021-12-14	2022-06-30	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:12.65882
1437	2270	توزيع أرباح نقدية	2022-05-25	2022-06-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.659089
1438	2030	توزيع أرباح نقدية	2022-03-24	2022-06-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.659383
1439	2170	تغيير اسم الشركة	2022-04-21	2022-06-23	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALUJAIN إلى ALUJAIN	2025-12-25 15:06:12.659803
1440	7200	توزيع أسهم خزينة كأسهم منحة	2022-01-31	2022-06-23	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.660077
1441	4261	توزيع أرباح نقدية	2022-06-07	2022-06-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.660358
1442	8250	تغيير اسم الشركة	2022-05-22	2022-06-22	\N	\N	\N	SAR	تم تعديل اسم الشركة من AXA COOPERATIVE إلى GIG	2025-12-25 15:06:12.660666
1443	4007	توزيع أسهم خزينة كأسهم منحة	2022-03-24	2022-06-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.660949
1444	4141	توزيع أرباح نقدية	2022-05-10	2022-06-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.661228
1445	1304	توزيع أرباح نقدية	2022-05-12	2022-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.661505
1446	2310	شراء اسهم خزينة	2022-06-16	2022-06-16	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 937060 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:12.661787
1447	2290	توزيع أرباح نقدية	2022-06-05	2022-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.662051
1448	9527	توزيع أرباح نقدية	2022-04-17	2022-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.662334
1449	9515	توزيع أرباح نقدية	2022-04-06	2022-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.663414
1450	4050	توزيع أرباح نقدية	2022-04-14	2022-06-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.663678
1451	4144	توزيع أرباح نقدية	2022-03-23	2022-06-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.663949
1452	2100	زيادة رأس مال - إصدار حقوق أولوية	2021-05-23	2022-06-15	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:12.664218
1453	8250	تغيير نظام الشركة	2022-05-22	2022-06-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.664511
1454	1202	توزيع أرباح نقدية	2022-03-17	2022-06-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.664771
1455	3060	توزيع أرباح نقدية	2022-06-02	2022-06-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.665024
1456	1050	توزيع أرباح نقدية	2021-12-23	2022-06-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.665283
1457	4007	توزيع أرباح نقدية	2022-06-02	2022-06-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.665552
1458	2380	تغيير نظام الشركة	2022-05-18	2022-06-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.665815
1459	9516	توزيع أرباح نقدية	2022-03-27	2022-06-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.666129
1460	2070	توزيع أرباح نقدية	2022-03-24	2022-06-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.666465
1461	2380	زيادة رأس المال المصرح به	2015-12-31	2022-06-09	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  16710000000	2025-12-25 15:06:12.666792
1462	2380	زيادة رأس مال - إصدار حقوق أولوية	2015-12-31	2022-06-09	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:12.667116
1463	3030	توزيع أرباح نقدية	2022-06-02	2022-06-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.667442
1464	9521	توزيع أرباح نقدية	2022-04-07	2022-06-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في  توزيع 0.5 SAR	2025-12-25 15:06:12.667772
1465	4080	تغيير اسم الشركة	2021-11-24	2022-06-05	\N	\N	\N	SAR	تم تعديل اسم الشركة من ASEER إلى SINAD HOLDING	2025-12-25 15:06:12.668117
1466	4347	توزيع أرباح نقدية	2022-05-31	2022-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.6685
1467	4162	توزيع أرباح نقدية	2022-03-27	2022-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.668841
1468	1183	توزيع أرباح نقدية	2022-05-30	2022-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.669214
1469	4342	توزيع أرباح نقدية	2022-05-25	2022-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.669565
1470	4324	توزيع أرباح نقدية	2022-03-21	2022-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.669988
1471	2120	توزيع أرباح نقدية	2022-03-13	2022-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.670336
1472	1211	تغيير نظام الشركة	2022-04-27	2022-05-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.670863
1473	1211	توزيع أسهم خزينة كأسهم منحة	2022-02-27	2022-05-31	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:12.67122
1474	1211	زيادة رأس المال المصرح به	2022-02-27	2022-05-31	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  24611822920	2025-12-25 15:06:12.671562
1475	8310	تغيير نظام الشركة	2022-05-25	2022-05-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.671903
1476	7202	توزيع أرباح نقدية	2022-02-15	2022-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.672247
1477	8310	زيادة رأس مال - إصدار حقوق أولوية	2022-01-18	2022-05-30	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:12.672638
1478	8310	زيادة رأس المال المصرح به	2022-01-18	2022-05-30	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  130000000 إلى  430000000	2025-12-25 15:06:12.673006
1479	2090	توزيع أرباح نقدية	2022-03-31	2022-05-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.673378
1480	8110	إلغاء الإدراج	2022-05-24	2022-05-25	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2022-05-25	2025-12-25 15:06:12.673751
1481	4345	توزيع أرباح نقدية	2022-05-16	2022-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.674097
1482	2222	توزيع أرباح نقدية	2022-05-15	2022-05-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.674432
1483	3092	توزيع أرباح نقدية	2021-12-23	2022-05-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.674791
1484	7020	توزيع أرباح نقدية	2021-11-25	2022-05-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.675198
1485	4348	توزيع أرباح نقدية	2022-05-08	2022-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.675534
1486	3040	توزيع أرباح نقدية	2022-05-17	2022-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.675891
1487	4020	تغيير نظام الشركة	2022-04-25	2022-05-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.676386
1488	2150	توزيع أرباح نقدية	2022-03-30	2022-05-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.676656
1489	4020	زيادة رأس المال المصرح به	2021-09-13	2022-05-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  3750000000	2025-12-25 15:06:12.676927
1490	4020	زيادة رأس مال - إصدار حقوق أولوية	2021-09-13	2022-05-19	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:12.677193
1491	4081	توزيع أرباح نقدية	2022-05-15	2022-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.677464
1492	4061	تغيير نظام الشركة	2022-04-25	2022-05-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:12.677735
1493	4005	توزيع أرباح نقدية	2022-04-19	2022-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.678024
1494	4260	توزيع أرباح نقدية	2022-03-30	2022-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.678314
1495	1182	توزيع أرباح نقدية	2022-03-23	2022-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.678591
1496	5110	توزيع أرباح نقدية	2022-03-16	2022-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.678866
1497	9525	توزيع أرباح نقدية	2022-03-14	2022-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.679126
1498	9511	توزيع أرباح نقدية	2022-03-13	2022-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:12.679394
1499	1214	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-09-19	2022-05-18	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:12.679679
1500	4061	زيادة رأس مال - إصدار حقوق أولوية	2021-02-09	2022-05-18	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:12.679952
1501	4061	زيادة رأس المال المصرح به	2021-02-09	2022-05-18	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  105000000 إلى  315000000	2025-12-25 15:06:13.34507
1502	4190	توزيع أرباح نقدية	2022-05-09	2022-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.346002
1503	4100	تغيير السنة المالية	2022-04-21	2022-05-17	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:13.346274
1504	4030	تغيير نظام الشركة	2022-04-11	2022-05-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.346524
1505	4030	زيادة رأس المال المصرح به	2022-02-07	2022-05-17	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  4921875000	2025-12-25 15:06:13.346758
1506	4030	توزيع أسهم خزينة كأسهم منحة	2022-02-07	2022-05-17	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.347302
1507	2050	توزيع أرباح نقدية	2022-02-01	2022-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.347695
1508	1214	تغيير نظام الشركة	2022-04-19	2022-05-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.347927
1509	8250	توزيع أرباح نقدية	2022-03-17	2022-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.34814
1510	1214	تخفيض رأس المال المصرح به	2021-09-19	2022-05-16	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  630000000 الى  482334000	2025-12-25 15:06:13.348352
1511	2222	تغيير نظام الشركة	2022-04-28	2022-05-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.348558
1512	2330	توزيع أرباح نقدية	2022-03-29	2022-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.348761
1513	2222	توزيع أسهم خزينة كأسهم منحة	2022-03-20	2022-05-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.34898
1514	2222	زيادة رأس المال المصرح به	2022-03-20	2022-05-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  75000000000	2025-12-25 15:06:13.349217
1515	1111	توزيع أرباح نقدية	2022-03-06	2022-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.349432
1516	4150	توزيع أرباح نقدية	2022-02-20	2022-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.349646
1517	7010	توزيع أرباح نقدية	2022-04-28	2022-05-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.349849
1518	4140	تغيير نظام الشركة	2022-04-19	2022-05-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.350052
1624	3040	توزيع أرباح نقدية	2022-02-08	2022-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.884715
1519	4140	زيادة رأس المال المصرح به	2020-11-10	2022-05-12	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  21600000 إلى  194400000	2025-12-25 15:06:13.350318
1520	4140	زيادة رأس مال - إصدار حقوق أولوية	2020-11-10	2022-05-12	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.350606
1521	1830	توزيع أرباح نقدية	2022-04-27	2022-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.350816
1522	4336	توزيع أرباح نقدية	2022-04-17	2022-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.351318
1523	3005	توزيع أرباح نقدية	2022-03-17	2022-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.351677
1524	4071	توزيع أرباح نقدية	2022-03-07	2022-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.352031
1525	3007	تغيير نظام الشركة	2022-04-12	2022-05-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.352368
1526	7203	توزيع أرباح نقدية	2022-03-23	2022-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.352694
1527	4051	توزيع أرباح نقدية	2022-03-13	2022-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.353035
1528	4002	توزيع أرباح نقدية	2022-01-17	2022-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.35341
1529	3007	زيادة رأس المال المصرح به	2021-11-15	2022-05-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  150000000 إلى  225000000	2025-12-25 15:06:13.353755
1530	3007	توزيع أرباح نقدية	2021-11-15	2022-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.354106
1531	3007	توزيع أسهم خزينة كأسهم منحة	2021-11-15	2022-05-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.354437
1532	1120	تغيير نظام الشركة	2022-04-14	2022-05-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.354772
1533	2320	توزيع أرباح نقدية	2022-03-30	2022-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.355101
1534	1120	زيادة رأس المال المصرح به	2022-02-20	2022-05-09	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  40000000000	2025-12-25 15:06:13.35542
1535	1120	توزيع أسهم خزينة كأسهم منحة	2022-02-20	2022-05-09	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.355712
1536	4013	توزيع أرباح نقدية	2022-04-24	2022-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.356028
1537	4333	توزيع أرباح نقدية	2022-04-24	2022-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.35622
1538	9517	توزيع أرباح نقدية	2022-04-18	2022-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.356439
1539	3090	توزيع أرباح نقدية	2022-03-27	2022-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.356658
1540	1212	توزيع أرباح نقدية	2022-03-16	2022-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.356872
1541	1303	توزيع أرباح نقدية	2022-03-17	2022-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.357086
1542	8120	زيادة رأس المال المصرح به	2021-10-20	2022-04-21	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  229474640 إلى  458949280	2025-12-25 15:06:13.357309
1543	8120	زيادة رأس مال - إصدار حقوق أولوية	2021-10-20	2022-04-21	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.357526
1544	6001	توزيع أرباح نقدية	2021-12-29	2022-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.357756
1545	4013	توزيع أرباح نقدية	2022-02-20	2022-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.357975
1546	4339	توزيع أرباح نقدية	2022-04-03	2022-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.358185
1547	4280	توزيع أرباح نقدية	2022-03-27	2022-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.358433
1548	3010	توزيع أرباح نقدية	2022-02-28	2022-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.358659
1549	1060	توزيع أرباح نقدية	2022-02-21	2022-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.358874
1550	1180	توزيع أرباح نقدية	2022-01-27	2022-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.359085
1551	2250	توزيع أرباح نقدية	2022-04-17	2022-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.359304
1552	4346	توزيع أرباح نقدية	2022-03-31	2022-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.359573
1553	2281	توزيع أرباح نقدية	2022-03-23	2022-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.359839
1554	4003	توزيع أرباح نقدية	2022-03-08	2022-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.360116
1555	8300	تغيير نظام الشركة	2022-04-04	2022-04-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.360383
1556	3002	توزيع أرباح نقدية	2022-03-16	2022-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.360643
1557	1150	توزيع أرباح نقدية	2021-12-30	2022-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.3609
1558	2020	توزيع أرباح نقدية	2021-12-20	2022-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.361157
1559	8300	زيادة رأس المال المصرح به	2021-09-16	2022-04-14	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  400000000	2025-12-25 15:06:13.361414
1560	8300	زيادة رأس مال - إصدار حقوق أولوية	2021-09-16	2022-04-14	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.361823
1561	3050	توزيع أرباح نقدية	2022-03-03	2022-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.362083
1562	4012	توزيع أرباح نقدية	2022-02-21	2022-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.36234
1563	1080	توزيع أرباح نقدية	2021-12-22	2022-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.362606
1564	2280	توزيع أرباح نقدية	2021-12-16	2022-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.362869
1565	1010	توزيع أرباح نقدية	2021-12-16	2022-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.363124
1566	4344	توزيع أرباح نقدية	2022-03-31	2022-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.363364
1567	2080	توزيع أرباح نقدية	2022-03-24	2022-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.363583
1568	1140	تغيير نظام الشركة	2022-03-17	2022-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.363807
1569	3080	توزيع أرباح نقدية	2022-03-13	2022-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.364021
1570	4146	توزيع أرباح نقدية	2022-03-10	2022-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.36425
1571	1140	توزيع أسهم خزينة كأسهم منحة	2021-11-09	2022-04-12	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.364471
1572	1140	زيادة رأس المال المصرح به	2021-11-09	2022-04-12	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  10000000000	2025-12-25 15:06:13.364695
1573	2002	إلغاء الإدراج	2021-10-27	2022-04-12	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2022-04-12	2025-12-25 15:06:13.364921
1574	4161	توزيع أرباح نقدية	2022-03-30	2022-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.365185
1575	3004	توزيع أرباح نقدية	2022-03-28	2022-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.365411
1576	4007	توزيع أرباح نقدية	2022-03-24	2022-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.365633
1577	4261	توزيع أرباح نقدية	2022-03-21	2022-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.365865
1578	2250	تغيير نظام الشركة	2022-03-20	2022-04-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.366097
1579	3030	توزيع أرباح نقدية	2022-02-01	2022-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.366326
1580	2010	توزيع أرباح نقدية	2021-12-15	2022-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.366611
1581	2250	زيادة رأس مال - اكتتاب خاص	2021-10-27	2022-04-11	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:13.366846
1582	2250	زيادة رأس المال المصرح به	2021-10-27	2022-04-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  7548000000	2025-12-25 15:06:13.367107
1583	4345	تغيير اسم الشركة	2022-03-23	2022-04-05	\N	\N	\N	SAR	تم تعديل اسم الشركة من SWICORP WABEL REIT إلى ALINMA RETAIL REIT	2025-12-25 15:06:13.367333
1584	4330	توزيع أرباح نقدية	2022-02-13	2022-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.367567
1585	2290	توزيع أرباح نقدية	2021-12-23	2022-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.367793
1586	2222	توزيع أرباح نقدية	2022-03-20	2022-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.368016
1587	2081	توزيع أرباح نقدية	2022-03-20	2022-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.368247
1588	4021	توزيع أرباح نقدية	2022-03-13	2022-03-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.368469
1589	2330	تغيير نظام الشركة	2022-02-28	2022-03-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.36869
1590	2330	زيادة رأس المال المصرح به	2022-01-26	2022-03-21	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  2600000000	2025-12-25 15:06:13.368919
1591	2330	توزيع أسهم خزينة كأسهم منحة	2022-01-26	2022-03-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.369137
1592	1831	توزيع أرباح نقدية	2022-03-13	2022-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.369362
1593	3003	توزيع أرباح نقدية	2022-03-10	2022-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.369573
1594	4320	توزيع أرباح نقدية	2022-03-13	2022-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.369798
1595	4190	توزيع أرباح نقدية	2022-03-09	2022-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.370021
1596	4342	توزيع أرباح نقدية	2022-03-07	2022-03-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.370223
1597	2190	توزيع أرباح نقدية	2022-03-02	2022-03-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.370446
1598	4334	توزيع أرباح نقدية	2022-03-07	2022-03-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.371405
1599	2160	تخفيض رأس المال المصرح به	2021-11-23	2022-03-02	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  320000000 الى  99000000	2025-12-25 15:06:13.371627
1600	2160	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-11-23	2022-03-02	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.371849
1601	7200	توزيع أرباح نقدية	2022-01-31	2022-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.87721
1602	4200	توزيع أرباح نقدية	2022-01-18	2022-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.878267
1603	2160	تغيير نظام الشركة	2022-02-23	2022-02-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.878594
1604	7010	توزيع أرباح نقدية	2022-02-21	2022-02-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.878877
1605	4070	تخفيض رأس مال - بتخفيض عدد الأسهم	2022-02-08	2022-02-28	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.879151
1606	4070	تخفيض رأس المال المصرح به	2022-02-08	2022-02-28	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  50000000 الى  175000000	2025-12-25 15:06:13.879433
1607	4070	تغيير نظام الشركة	2022-02-17	2022-02-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.879701
1608	2110	تخفيض رأس المال المصرح به	2021-07-01	2022-02-24	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  360614060 الى  262311060	2025-12-25 15:06:13.879961
1609	2110	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-07-01	2022-02-24	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.880217
1610	2200	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-06-09	2022-02-24	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.880465
1611	2040	توزيع أرباح نقدية	2022-02-17	2022-02-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.880728
1612	4130	تغيير نظام الشركة	2022-01-31	2022-02-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.881009
1613	4130	زيادة رأس مال - إصدار حقوق أولوية	2020-11-10	2022-02-23	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.881259
1614	4130	زيادة رأس المال المصرح به	2020-11-10	2022-02-23	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  177000000 إلى  297000000	2025-12-25 15:06:13.8815
1615	2110	تغيير نظام الشركة	2022-02-17	2022-02-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.881827
1616	4001	توزيع أرباح نقدية	2022-02-15	2022-02-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.882275
1617	2200	تغيير نظام الشركة	2022-02-15	2022-02-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.882712
1618	1830	توزيع أرباح نقدية	2022-02-13	2022-02-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.882988
1619	2200	تخفيض رأس المال المصرح به	2021-06-09	2022-02-21	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  400000000 الى  100000000	2025-12-25 15:06:13.883239
1620	4140	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-12-26	2022-02-20	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.883481
1621	4338	توزيع أرباح نقدية	2022-02-09	2022-02-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.883736
1622	4140	تخفيض رأس المال المصرح به	2021-12-26	2022-02-16	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  64800000 الى  21600000	2025-12-25 15:06:13.884181
1623	4348	توزيع أرباح نقدية	2022-01-31	2022-02-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.884464
1625	1020	توزيع أرباح نقدية	2022-02-07	2022-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.88497
1626	1301	توزيع أرباح نقدية	2022-02-01	2022-02-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.885276
1627	2330	توزيع أرباح نقدية	2021-12-22	2022-02-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.88561
1628	2050	شراء اسهم خزينة	2021-03-10	2022-02-10	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 637955 سهم خزينة بينما كانت قد استهدفت شراء 1200000	2025-12-25 15:06:13.886096
1629	4340	توزيع أرباح نقدية	2022-02-01	2022-02-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.886438
1630	1030	تغيير نظام الشركة	2022-01-11	2022-02-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.886689
1631	1030	زيادة رأس المال المصرح به	2021-12-22	2022-02-02	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  10000000000	2025-12-25 15:06:13.886995
1632	1030	توزيع أرباح نقدية	2021-12-22	2022-02-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.887344
1633	1030	توزيع أسهم خزينة كأسهم منحة	2021-12-22	2022-02-02	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.887618
1634	4335	توزيع أرباح نقدية	2022-01-23	2022-01-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.887902
1635	4321	توزيع أرباح نقدية	2022-01-24	2022-01-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.88846
1636	4333	توزيع أرباح نقدية	2022-01-24	2022-01-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.888734
1637	7040	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-10-11	2022-01-26	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.888989
1638	7040	تخفيض رأس المال المصرح به	2021-10-11	2022-01-26	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  228529000 الى  89999000	2025-12-25 15:06:13.889312
1639	4336	توزيع أرباح نقدية	2022-01-17	2022-01-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.889608
1640	1302	توزيع أرباح نقدية	2021-12-28	2022-01-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.889913
1641	2230	توزيع أرباح نقدية	2021-12-23	2022-01-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.89017
1642	2150	توزيع أرباح نقدية	2022-01-03	2022-01-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.890426
1643	4339	توزيع أرباح نقدية	2022-01-02	2022-01-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.890677
1644	2082	تغيير اسم الشركة	2021-12-15	2022-01-13	\N	\N	\N	SAR	تم تعديل اسم الشركة من ACWA POWER إلى ACWA POWER	2025-12-25 15:06:13.890933
1645	8130	إلغاء الإدراج	2021-07-12	2022-01-13	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2022-01-13	2025-12-25 15:06:13.891197
1646	8070	زيادة رأس مال - اكتتاب خاص	2021-07-12	2022-01-12	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:13.891503
1647	4291	توزيع أرباح نقدية	2021-11-18	2022-01-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.891795
1648	2270	توزيع أرباح نقدية	2022-01-04	2022-01-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.892087
1649	4337	توزيع أرباح نقدية	2021-12-30	2022-01-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.89235
1650	4050	توزيع أرباح نقدية	2021-12-28	2022-01-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.892666
1651	1304	توزيع أرباح نقدية	2021-12-13	2022-01-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.892955
1652	4280	توزيع أرباح نقدية	2021-03-31	2022-01-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.893223
1653	8150	زيادة رأس مال - إصدار حقوق أولوية	2020-01-16	2021-12-30	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.893479
1654	4344	توزيع أرباح نقدية	2021-12-27	2021-12-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.893728
1655	2310	توزيع أرباح نقدية	2021-12-15	2021-12-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.893972
1656	4004	توزيع أرباح نقدية	2021-12-15	2021-12-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.894228
1657	4347	توزيع أرباح نقدية	2021-12-13	2021-12-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.894463
1658	3060	توزيع أرباح نقدية	2021-12-12	2021-12-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.894765
1659	4170	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-04-19	2021-12-14	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.895046
1660	4081	توزيع أرباح نقدية	2021-12-06	2021-12-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.895347
1661	3001	توزيع أرباح نقدية	2021-12-05	2021-12-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.895597
1662	4170	تغيير نظام الشركة	2021-11-18	2021-12-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.895861
1663	4007	توزيع أرباح نقدية	2021-11-11	2021-12-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.89611
1664	4170	تخفيض رأس المال المصرح به	2021-04-19	2021-12-12	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  101500000 الى  52566930	2025-12-25 15:06:13.896361
1665	4110	زيادة رأس مال - إصدار حقوق أولوية	2021-04-15	2021-12-07	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.896609
1666	4331	توزيع أرباح نقدية	2021-12-05	2021-12-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.896861
1667	4337	تغيير اسم الشركة	2021-11-21	2021-12-06	\N	\N	\N	SAR	تم تعديل اسم الشركة من MASHAAR REIT إلى SICO SAUDI REIT	2025-12-25 15:06:13.89712
1668	4344	زيادة رأس مال - إصدار حقوق أولوية	2021-11-18	2021-12-05	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.897422
1669	4344	زيادة رأس مال - اكتتاب خاص	2021-11-18	2021-12-05	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:13.89777
1670	1832	زيادة رأس مال - إصدار حقوق أولوية	2021-01-04	2021-12-02	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.898091
1671	8012	زيادة رأس المال المصرح به	2021-04-06	2021-12-01	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  470664030 إلى  550000000	2025-12-25 15:06:13.898423
1672	8012	توزيع أسهم خزينة كأسهم منحة	2021-04-06	2021-12-01	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:13.898741
1673	2210	بيع أسهم خزينة	2021-11-29	2021-11-29	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 165406 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:13.899339
1674	3040	توزيع أرباح نقدية	2021-11-23	2021-11-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.899672
1675	2220	زيادة رأس مال - إصدار حقوق أولوية	2021-03-01	2021-11-28	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.89999
1676	2220	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-03-01	2021-11-28	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:13.900325
1677	6013	تعديل رمز التداول	2021-11-17	2021-11-23	\N	\N	\N	SAR	تم تعديل رمز التداول من 9501 إلى 6013	2025-12-25 15:06:13.900718
1678	6013	تحويل الشركة من سوق ﻵخر	2021-11-17	2021-11-23	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2021-11-23	2025-12-25 15:06:13.90123
1679	4261	توزيع أرباح نقدية	2021-11-16	2021-11-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.901583
1680	4090	توزيع أرباح نقدية	2021-11-15	2021-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.901959
1681	1830	توزيع أرباح نقدية	2021-11-07	2021-11-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.902302
1682	4180	توزيع أرباح نقدية	2021-11-07	2021-11-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.902636
1683	4348	توزيع أرباح نقدية	2021-10-31	2021-11-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.90298
1684	2330	توزيع أرباح نقدية	2021-10-20	2021-11-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.903314
1685	2140	تغيير نظام الشركة	2021-10-17	2021-11-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.903654
1686	2140	زيادة رأس المال المصرح به	2021-04-18	2021-11-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  737320690 إلى  806363280	2025-12-25 15:06:13.903999
1687	2140	زيادة رأس مال - اكتتاب خاص	2021-04-18	2021-11-10	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:13.904341
1688	4190	توزيع أرباح نقدية	2021-11-04	2021-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.904675
1689	4292	توزيع أرباح نقدية	2021-09-29	2021-11-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.905006
1690	2170	توزيع أرباح نقدية	2021-10-31	2021-11-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.905323
1691	2222	توزيع أرباح نقدية	2021-10-31	2021-11-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.905669
1692	1213	تغيير نظام الشركة	2021-10-13	2021-11-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.90603
1693	1213	زيادة رأس المال المصرح به	2020-09-28	2021-11-07	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  61632010 إلى  211632010	2025-12-25 15:06:13.906373
1694	1213	زيادة رأس مال - إصدار حقوق أولوية	2020-09-28	2021-11-07	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.906692
1695	8030	تغيير نظام الشركة	2021-10-13	2021-11-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.907008
1696	4290	تغيير نظام الشركة	2021-10-11	2021-11-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:13.907319
1697	2190	توزيع أرباح نقدية	2021-08-12	2021-11-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:13.907635
1698	4290	زيادة رأس المال المصرح به	2021-03-30	2021-11-04	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  450000000 إلى  650000000	2025-12-25 15:06:13.907942
1699	4290	زيادة رأس مال - إصدار حقوق أولوية	2021-03-30	2021-11-04	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:13.908255
1700	8030	زيادة رأس المال المصرح به	2020-10-06	2021-11-04	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  700000000 إلى  1050000000	2025-12-25 15:06:13.908565
1701	8030	زيادة رأس مال - إصدار حقوق أولوية	2020-10-06	2021-11-04	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:14.49424
1702	4013	توزيع أرباح نقدية	2021-10-24	2021-10-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.49554
1703	7010	توزيع أرباح نقدية	2021-10-21	2021-10-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.495922
1704	4333	توزيع أرباح نقدية	2021-10-25	2021-10-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.496257
1705	4012	تغيير نظام الشركة	2021-09-30	2021-10-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.496579
1706	4012	زيادة رأس المال المصرح به	2021-07-15	2021-10-24	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  400000000 إلى  300000000	2025-12-25 15:06:14.496896
1707	4012	توزيع أسهم خزينة كأسهم منحة	2021-07-15	2021-10-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:14.497193
1708	4324	توزيع أرباح نقدية	2021-09-08	2021-10-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.497519
1709	4339	توزيع أرباح نقدية	2021-10-03	2021-10-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.497848
1710	4346	توزيع أرباح نقدية	2021-09-30	2021-10-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.49847
1711	4320	توزيع أرباح نقدية	2021-10-10	2021-10-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.498755
1712	4336	توزيع أرباح نقدية	2021-10-10	2021-10-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.49903
1713	4342	توزيع أرباح نقدية	2021-10-05	2021-10-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.499304
1714	9517	توزيع أرباح نقدية	2021-09-09	2021-10-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.499589
1715	4021	توزيع أرباح نقدية	2021-08-15	2021-10-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.499917
1716	4030	توزيع أرباح نقدية	2021-09-21	2021-10-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.500394
1717	3002	توزيع أرباح نقدية	2021-09-22	2021-10-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.500734
1718	4344	توزيع أرباح نقدية	2021-09-27	2021-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.501095
1719	6016	توزيع أرباح نقدية	2021-09-22	2021-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.501615
1720	4004	توزيع أرباح نقدية	2021-09-22	2021-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.502021
1721	4280	توزيع أرباح نقدية	2021-03-31	2021-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.502288
1722	9511	توزيع أرباح نقدية	2021-08-16	2021-09-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.502528
1723	4220	تغيير نظام الشركة	2021-08-16	2021-09-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.502776
1724	4220	زيادة رأس المال المصرح به	2020-09-01	2021-09-27	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  11333333340	2025-12-25 15:06:14.503063
1725	4220	زيادة رأس مال - اكتتاب خاص	2020-09-01	2021-09-27	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:14.503433
1726	4261	توزيع أرباح نقدية	2021-09-16	2021-09-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.503843
1727	4050	توزيع أرباح نقدية	2021-09-09	2021-09-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.504134
1728	4012	توزيع أرباح نقدية	2021-07-15	2021-09-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.504407
1729	2010	توزيع أرباح نقدية	2021-06-22	2021-09-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.504675
1730	8200	تغيير اسم الشركة	2021-06-21	2021-09-20	\N	\N	\N	SAR	تم تعديل اسم الشركة من SAUDI RE إلى SAUDI RE	2025-12-25 15:06:14.505637
1731	3092	توزيع أرباح نقدية	2021-09-08	2021-09-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.506123
1732	4051	تغيير نظام الشركة	2021-08-26	2021-09-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.506449
1733	6013	تغيير نظام الشركة	2021-08-26	2021-09-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.507046
1734	4191	توزيع أرباح نقدية	2021-08-05	2021-09-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.507415
1735	6013	توزيع أسهم خزينة كأسهم منحة	2020-09-27	2021-09-19	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:14.507732
1736	6013	زيادة رأس المال المصرح به	2020-09-27	2021-09-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  25000000 إلى  30000000	2025-12-25 15:06:14.508038
1737	2080	توزيع أرباح نقدية	2021-09-08	2021-09-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.508332
1738	1060	شراء اسهم خزينة	2021-04-01	2021-09-13	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3574316 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:14.508626
1739	4001	توزيع أرباح نقدية	2021-08-29	2021-09-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.509054
1740	4150	توزيع أرباح نقدية	2021-07-14	2021-09-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.509441
1741	2050	شراء اسهم خزينة	2021-03-10	2021-09-09	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 349076 سهم خزينة بينما كانت قد استهدفت شراء 1200000	2025-12-25 15:06:14.50984
1742	4180	تخفيض رأس المال المصرح به	2021-03-07	2021-09-08	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  550000000 الى  275000000	2025-12-25 15:06:14.51016
1743	4180	تخفيض رأس مال - بتخفيض عدد الأسهم	2021-03-07	2021-09-08	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:14.510477
1744	4180	توزيع أرباح نقدية	2021-03-07	2021-09-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.51078
1745	2081	توزيع أرباح نقدية	2021-06-30	2021-09-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.511089
1746	4342	زيادة رأس مال - اكتتاب خاص	2021-03-03	2021-09-05	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:14.511396
1747	4342	زيادة رأس مال - إصدار حقوق أولوية	2021-03-03	2021-09-05	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:14.511966
1748	4260	توزيع أرباح نقدية	2021-08-22	2021-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.512277
1749	4261	تغيير نظام الشركة	2021-08-08	2021-09-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.512582
1750	4342	توزيع أرباح نقدية	2021-08-22	2021-08-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.512888
1751	4161	توزيع أرباح نقدية	2021-08-15	2021-08-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.513221
1752	4320	تغيير نظام الشركة	2021-07-26	2021-08-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.513525
1753	4320	زيادة رأس المال المصرح به	2021-05-02	2021-08-26	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  700000000 إلى  933333330	2025-12-25 15:06:14.513836
1754	4320	توزيع أسهم خزينة كأسهم منحة	2021-05-02	2021-08-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:14.514131
1755	3040	توزيع أرباح نقدية	2021-08-18	2021-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.514419
1756	1831	توزيع أرباح نقدية	2021-08-17	2021-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.514725
1757	4330	توزيع أرباح نقدية	2021-08-15	2021-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.515042
1758	3003	توزيع أرباح نقدية	2021-08-12	2021-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.515339
1759	1302	توزيع أرباح نقدية	2021-08-05	2021-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.515627
1760	2330	توزيع أرباح نقدية	2021-06-30	2021-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.515913
1761	3010	توزيع أرباح نقدية	2021-08-16	2021-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.516203
1762	4190	توزيع أرباح نقدية	2021-08-11	2021-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.516487
1763	2222	توزيع أرباح نقدية	2021-08-08	2021-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.516769
1764	1830	توزيع أرباح نقدية	2021-08-08	2021-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.517084
1765	3005	توزيع أرباح نقدية	2021-08-01	2021-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.51753
1766	1180	توزيع أرباح نقدية	2021-08-09	2021-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.518048
1767	4013	توزيع أرباح نقدية	2021-08-08	2021-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.518615
1768	4348	توزيع أرباح نقدية	2021-08-01	2021-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.519064
1769	4340	توزيع أرباح نقدية	2021-08-05	2021-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.519522
1770	3004	توزيع أرباح نقدية	2021-08-04	2021-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.519969
1771	3050	توزيع أرباح نقدية	2021-07-29	2021-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.520374
1772	1020	توزيع أرباح نقدية	2021-08-03	2021-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.520804
1773	3080	توزيع أرباح نقدية	2021-08-02	2021-08-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.52122
1774	1150	توزيع أرباح نقدية	2021-08-01	2021-08-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.521576
1775	7010	توزيع أرباح نقدية	2021-08-02	2021-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.52196
1776	1060	توزيع أرباح نقدية	2021-08-01	2021-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.522334
1777	1301	توزيع أرباح نقدية	2021-07-29	2021-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.522708
1778	2040	توزيع أرباح نقدية	2021-07-27	2021-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.523082
1779	3060	توزيع أرباح نقدية	2021-07-26	2021-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.523561
1780	7200	توزيع أرباح نقدية	2021-07-07	2021-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.523849
1781	4336	توزيع أرباح نقدية	2021-07-13	2021-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.524165
1782	4338	توزيع أرباح نقدية	2021-07-13	2021-07-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.524474
1783	4003	توزيع أرباح نقدية	2021-07-12	2021-07-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.524908
1784	4339	توزيع أرباح نقدية	2021-07-01	2021-07-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.525203
1785	8240	تغيير نظام الشركة	2021-06-23	2021-07-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.525505
1786	8200	تغيير نظام الشركة	2021-06-21	2021-07-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.525993
1787	8200	توزيع أسهم خزينة كأسهم منحة	2021-03-30	2021-07-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:14.52628
1788	8200	زيادة رأس المال المصرح به	2021-03-30	2021-07-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  810000000 إلى  891000000	2025-12-25 15:06:14.526566
1789	8240	توزيع أسهم خزينة كأسهم منحة	2021-03-25	2021-07-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:14.526921
1790	8240	زيادة رأس المال المصرح به	2021-03-25	2021-07-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  300000000	2025-12-25 15:06:14.527221
1791	4333	توزيع أرباح نقدية	2021-07-13	2021-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.527517
1792	4335	توزيع أرباح نقدية	2021-07-04	2021-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.527813
1793	6012	تغيير نظام الشركة	2021-06-21	2021-07-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:14.528118
1794	6012	زيادة رأس المال المصرح به	2020-09-08	2021-07-14	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  225000000 إلى  337500000	2025-12-25 15:06:14.528423
1795	6012	زيادة رأس مال - إصدار حقوق أولوية	2020-09-08	2021-07-14	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:14.528725
1796	2270	توزيع أرباح نقدية	2021-06-13	2021-07-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.529016
1797	1820	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-10-28	2021-07-13	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:14.529368
1798	1820	زيادة رأس مال - إصدار حقوق أولوية	2020-10-28	2021-07-13	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:14.529763
1799	1050	توزيع أرباح نقدية	2021-07-04	2021-07-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:14.530125
1800	1820	تخفيض رأس المال المصرح به	2020-10-28	2021-07-11	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  550000000 الى  343000000	2025-12-25 15:06:14.53049
1801	1820	زيادة رأس المال المصرح به	2020-10-28	2021-07-11	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  343000000 إلى  650000000	2025-12-25 15:06:15.079243
1802	4180	تغيير نظام الشركة	2021-06-14	2021-07-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.079687
1803	1120	توزيع أرباح نقدية	2021-06-30	2021-07-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.079967
1804	1080	توزيع أرباح نقدية	2021-06-24	2021-07-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.080222
1805	2290	توزيع أرباح نقدية	2021-06-17	2021-07-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.080544
1806	4321	توزيع أرباح نقدية	2021-04-28	2021-07-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.080931
1807	4344	توزيع أرباح نقدية	2021-06-27	2021-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.081343
1808	2310	توزيع أرباح نقدية	2021-06-23	2021-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.08172
1809	2020	توزيع أرباح نقدية	2021-06-14	2021-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.082135
1810	2250	توزيع أرباح نقدية	2021-06-03	2021-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.082514
1811	4280	توزيع أرباح نقدية	2021-03-31	2021-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.082921
1812	4342	توزيع أرباح نقدية	2021-06-24	2021-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.083292
1813	4161	تغيير نظام الشركة	2021-06-07	2021-06-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.083706
1814	8260	تغيير نظام الشركة	2021-06-02	2021-06-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.084179
1815	2001	تغيير نظام الشركة	2021-06-01	2021-06-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.084623
1816	2001	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-10-11	2021-06-29	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:15.085005
1817	2001	تخفيض رأس المال المصرح به	2020-10-11	2021-06-29	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  1206000000 الى  674508630	2025-12-25 15:06:15.085363
1818	8260	زيادة رأس مال - إصدار حقوق أولوية	2019-04-29	2021-06-29	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:15.085749
1819	8260	زيادة رأس المال المصرح به	2019-04-29	2021-06-29	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  500000000	2025-12-25 15:06:15.086119
1820	1010	توزيع أرباح نقدية	2021-06-21	2021-06-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.086488
1821	8210	توزيع أرباح نقدية	2021-04-25	2021-06-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.086864
1822	3008	تغيير نظام الشركة	2021-05-26	2021-06-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.087224
1823	2120	توزيع أرباح نقدية	2021-03-23	2021-06-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.08812
1824	3008	توزيع أسهم خزينة كأسهم منحة	2021-03-09	2021-06-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:15.08852
1825	3008	زيادة رأس المال المصرح به	2021-03-09	2021-06-24	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  90417600 إلى  113022000	2025-12-25 15:06:15.088925
1826	2080	توزيع أرباح نقدية	2021-04-28	2021-06-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.089295
1827	4050	توزيع أرباح نقدية	2021-03-28	2021-06-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.08972
1828	8070	تغيير نظام الشركة	2021-05-19	2021-06-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.090153
1829	8070	زيادة رأس المال المصرح به	2021-01-13	2021-06-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  300000000 إلى  400000000	2025-12-25 15:06:15.09071
1830	8070	توزيع أسهم خزينة كأسهم منحة	2021-01-13	2021-06-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:15.091207
1831	3030	توزيع أرباح نقدية	2021-06-02	2021-06-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.091701
1832	4011	تغيير نظام الشركة	2021-04-28	2021-06-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.092148
1833	4011	زيادة رأس مال - إصدار حقوق أولوية	2020-10-11	2021-06-03	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:15.092603
1834	4011	زيادة رأس المال المصرح به	2020-10-11	2021-06-03	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  430000000 إلى  575000000	2025-12-25 15:06:15.092918
1835	4320	توزيع أرباح نقدية	2021-03-04	2021-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.093218
1836	4190	توزيع أرباح نقدية	2021-05-27	2021-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.093508
1837	8100	تغيير نظام الشركة	2021-05-09	2021-05-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.093917
1838	6050	تغيير نظام الشركة	2021-05-02	2021-05-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.094425
1839	2070	توزيع أرباح نقدية	2021-03-23	2021-05-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.094824
1840	2170	تغيير نظام الشركة	2021-04-28	2021-05-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.095151
1841	4005	توزيع أرباح نقدية	2021-03-28	2021-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.095478
1842	2230	توزيع أرباح نقدية	2021-04-08	2021-05-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.095824
1843	4290	توزيع أرباح نقدية	2021-03-30	2021-05-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.096124
1844	4347	توزيع أرباح نقدية	2021-05-23	2021-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.096417
1845	2310	تغيير نظام الشركة	2021-05-02	2021-05-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.096711
1846	1182	توزيع أرباح نقدية	2021-03-30	2021-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.09696
1847	7020	توزيع أرباح نقدية	2020-12-17	2021-05-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.097238
1848	8310	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-12-08	2021-05-24	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:15.09753
1849	8310	تغيير نظام الشركة	2020-12-08	2021-05-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.097784
1850	8310	تخفيض رأس المال المصرح به	2020-12-08	2021-05-24	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  240000000 الى  130000000	2025-12-25 15:06:15.098042
1851	1304	توزيع أرباح نقدية	2021-05-06	2021-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.098292
1852	4348	توزيع أرباح نقدية	2021-04-29	2021-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.098535
1853	2330	توزيع أرباح نقدية	2021-03-31	2021-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.098815
1854	4007	توزيع أرباح نقدية	2021-03-28	2021-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.099103
1855	2222	توزيع أرباح نقدية	2021-05-04	2021-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.099436
1856	4210	تغيير اسم الشركة	2021-04-08	2021-05-17	\N	\N	\N	SAR	تم تعديل اسم الشركة من SRMG إلى SRMG	2025-12-25 15:06:15.099739
1857	1180	توزيع أرباح نقدية	2021-04-04	2021-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.100152
1858	9511	تغيير نظام الشركة	2021-04-13	2021-05-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.100476
1859	2090	توزيع أرباح نقدية	2021-03-30	2021-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.10077
1860	1050	توزيع أرباح نقدية	2021-03-02	2021-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.101633
1861	2190	توزيع أرباح نقدية	2021-02-28	2021-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.101925
1862	9511	توزيع أسهم خزينة كأسهم منحة	2021-02-28	2021-05-06	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:15.102206
1863	3040	توزيع أرباح نقدية	2021-05-02	2021-05-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.102471
1864	7010	توزيع أرباح نقدية	2021-04-22	2021-05-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.102734
1865	4230	تغيير نظام الشركة	2021-04-08	2021-05-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.102998
1866	4013	توزيع أرباح نقدية	2021-04-25	2021-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.103258
1867	8010	توزيع أرباح نقدية	2021-04-06	2021-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.10352
1868	8130	تغيير نظام الشركة	2021-03-30	2021-05-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.103796
1869	4002	توزيع أرباح نقدية	2021-02-25	2021-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.104061
1870	4260	توزيع أرباح نقدية	2021-02-07	2021-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.10431
1871	3005	توزيع أرباح نقدية	2021-03-10	2021-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.104559
1872	2050	توزيع أرباح نقدية	2021-01-27	2021-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.104806
1873	6001	توزيع أسهم خزينة كأسهم منحة	2020-12-28	2021-04-29	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:15.105152
1874	6012	تغيير نظام الشركة	2021-04-06	2021-04-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.10539
1875	5110	توزيع أرباح نقدية	2021-03-30	2021-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.10564
1876	1832	توزيع أرباح نقدية	2020-12-23	2021-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.10595
1877	2160	تغيير نظام الشركة	2021-04-05	2021-04-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.106216
1878	7010	تغيير نظام الشركة	2021-04-05	2021-04-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.106513
1879	7010	توزيع أرباح نقدية	2021-03-25	2021-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.106792
1880	1303	توزيع أرباح نقدية	2021-03-17	2021-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.107055
1881	3007	توزيع أرباح نقدية	2021-02-25	2021-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.107322
1882	4030	توزيع أرباح نقدية	2021-01-28	2021-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.107573
1883	7010	توزيع أرباح نقدية	2021-01-21	2021-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.107926
1884	2310	شراء اسهم خزينة	2021-04-26	2021-04-26	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:15.108221
1885	4348	زيادة رأس مال - إصدار حقوق أولوية	2021-04-22	2021-04-26	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:15.108562
1886	4348	زيادة رأس مال - اكتتاب خاص	2021-04-22	2021-04-26	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:15.108838
1887	6002	توزيع أرباح نقدية	2021-03-09	2021-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.109102
1888	8030	تغيير نظام الشركة	2021-03-31	2021-04-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.109397
1889	4051	توزيع أرباح نقدية	2021-03-04	2021-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.109667
1890	8030	تخفيض رأس المال المصرح به	2020-10-06	2021-04-25	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  800000000 الى  700000000	2025-12-25 15:06:15.109949
1891	8030	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-10-06	2021-04-25	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:15.110192
1892	1030	تغيير نظام الشركة	2021-03-31	2021-04-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.110431
1893	2030	توزيع أرباح نقدية	2021-03-04	2021-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.110718
1894	1030	توزيع أرباح نقدية	2021-03-04	2021-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.110974
1895	4013	توزيع أرباح نقدية	2021-02-21	2021-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.111241
1896	3092	توزيع أرباح نقدية	2020-12-29	2021-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.111662
1897	2002	توزيع أرباح نقدية	2021-03-09	2021-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.111925
1898	4150	توزيع أرباح نقدية	2021-03-11	2021-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.11218
1899	4336	توزيع أرباح نقدية	2021-04-13	2021-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.112454
1900	4339	توزيع أرباح نقدية	2021-04-01	2021-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.112725
1901	4346	توزيع أرباح نقدية	2021-03-31	2021-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.606902
1902	4200	تغيير نظام الشركة	2021-03-18	2021-04-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.607968
1903	4200	زيادة رأس المال المصرح به	2021-01-19	2021-04-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  600000000 إلى  750000000	2025-12-25 15:06:15.608514
1904	4200	توزيع أرباح نقدية	2021-01-19	2021-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.60932
1905	4200	توزيع أسهم خزينة كأسهم منحة	2021-01-19	2021-04-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:15.61025
1906	2010	توزيع أرباح نقدية	2020-12-16	2021-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.610804
1907	2280	توزيع أرباح نقدية	2020-12-15	2021-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.61122
1908	1140	تغيير نظام الشركة	2021-03-23	2021-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.612272
1909	8300	تغيير نظام الشركة	2021-03-21	2021-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.612878
1910	7200	تغيير نظام الشركة	2021-03-18	2021-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.613307
1911	1212	توزيع أرباح نقدية	2021-03-11	2021-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.614437
1912	3080	توزيع أرباح نقدية	2021-03-07	2021-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.615169
1913	3050	توزيع أرباح نقدية	2021-03-03	2021-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.615654
1914	3010	توزيع أرباح نقدية	2021-03-01	2021-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.615982
1915	7200	توزيع أسهم خزينة كأسهم منحة	2021-01-04	2021-04-12	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:15.616325
1916	7200	زيادة رأس المال المصرح به	2021-01-04	2021-04-12	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  250000000	2025-12-25 15:06:15.61672
1917	2020	توزيع أرباح نقدية	2020-12-15	2021-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.617085
1918	1150	تغيير نظام الشركة	2021-03-14	2021-04-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.617546
1919	1150	توزيع أرباح نقدية	2021-03-03	2021-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.618337
1920	3030	توزيع أرباح نقدية	2021-02-03	2021-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.618702
1921	6040	تغيير نظام الشركة	2021-03-14	2021-04-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.619045
1922	6040	زيادة رأس المال المصرح به	2020-02-16	2021-04-07	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  241767000 إلى  391767000	2025-12-25 15:06:15.61953
1923	6040	زيادة رأس مال - إصدار حقوق أولوية	2020-02-16	2021-04-07	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:15.620055
1924	4344	توزيع أرباح نقدية	2021-04-01	2021-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.620743
1925	4020	تغيير نظام الشركة	2021-03-10	2021-04-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.621184
1926	4280	توزيع أرباح نقدية	2021-03-31	2021-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.621589
1927	1090	إلغاء الإدراج	2020-10-11	2021-04-04	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2021-04-04	2025-12-25 15:06:15.622052
1928	1060	تغيير نظام الشركة	2021-04-09	2021-04-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.622443
1929	3002	توزيع أرباح نقدية	2021-02-28	2021-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.622974
1930	1180	تغيير اسم الشركة	2021-02-09	2021-04-01	\N	\N	\N	SAR	تم تعديل اسم الشركة من NCB إلى SNB	2025-12-25 15:06:15.623665
1931	1180	زيادة رأس مال - اكتتاب خاص	2020-10-11	2021-04-01	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:15.624725
1932	1180	زيادة رأس المال المصرح به	2020-10-11	2021-04-01	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  44780000000	2025-12-25 15:06:15.627827
1933	1180	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 2699726 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.630043
1934	1810	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 146225 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.630486
1935	2040	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 500000 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.630904
1936	2160	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 365000 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.63127
1937	2222	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 8393616 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.632045
1938	2280	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 469244 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.636886
1939	2380	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 800 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.637872
1940	3080	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 8398 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.638538
1941	8210	بيع أسهم خزينة	2021-03-31	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 162163 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:15.639101
1942	2040	تغيير نظام الشركة	2021-03-09	2021-03-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.639945
1943	2330	تغيير نظام الشركة	2021-03-07	2021-03-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.640436
1944	2200	تغيير نظام الشركة	2021-03-07	2021-03-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.640825
1945	1080	توزيع أرباح نقدية	2021-03-04	2021-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.641189
1946	1060	شراء اسهم خزينة	2021-03-01	2021-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1332210 سهم خزينة بينما كانت قد استهدفت شراء 4000000	2025-12-25 15:06:15.641907
1947	2040	زيادة رأس المال المصرح به	2021-02-04	2021-03-31	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  600000000 إلى  800000000	2025-12-25 15:06:15.642369
1948	2040	توزيع أسهم خزينة كأسهم منحة	2021-02-04	2021-03-31	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:15.64283
1949	2290	توزيع أرباح نقدية	2020-12-24	2021-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.643197
1950	2330	توزيع أرباح نقدية	2020-12-22	2021-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.644407
1951	1120	توزيع أرباح نقدية	2021-03-01	2021-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.64503
1952	4090	توزيع أرباح نقدية	2020-12-17	2021-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.645565
1953	4004	توزيع أرباح نقدية	2021-03-23	2021-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.645951
1954	4330	توزيع أرباح نقدية	2021-03-22	2021-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.646363
1955	4008	توزيع أرباح نقدية	2021-03-14	2021-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.647031
1956	4003	توزيع أرباح نقدية	2021-03-18	2021-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.647469
1957	4001	توزيع أرباح نقدية	2021-03-14	2021-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.647865
1958	1010	توزيع أرباح نقدية	2021-02-28	2021-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.648326
1959	2222	توزيع أرباح نقدية	2021-03-21	2021-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.648709
1960	4190	توزيع أرباح نقدية	2021-03-17	2021-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.649082
1961	3001	توزيع أرباح نقدية	2021-02-08	2021-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.649462
1962	1831	توزيع أرباح نقدية	2021-03-17	2021-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.649852
1963	1302	توزيع أرباح نقدية	2021-03-07	2021-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.650171
1964	4334	توزيع أرباح نقدية	2021-03-15	2021-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.650471
1965	4003	شراء اسهم خزينة	2021-03-16	2021-03-15	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 81784 سهم خزينة بينما كانت قد استهدفت شراء 100000	2025-12-25 15:06:15.650794
1966	3004	توزيع أرباح نقدية	2021-03-09	2021-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.651128
1967	4180	توزيع أرباح نقدية	2021-03-07	2021-03-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.651428
1968	3003	توزيع أرباح نقدية	2021-02-28	2021-03-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.651976
1969	2360	تغيير نظام الشركة	2021-01-31	2021-03-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.652364
1970	8290	إلغاء الإدراج	2021-01-04	2021-03-01	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2021-03-01	2025-12-25 15:06:15.652744
1971	3060	توزيع أرباح نقدية	2020-12-13	2021-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.653133
1972	8012	زيادة رأس مال - اكتتاب خاص	2020-08-24	2021-02-28	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:15.65349
1973	8012	زيادة رأس المال المصرح به	2020-08-24	2021-02-28	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  350000000 إلى  470664030	2025-12-25 15:06:15.653932
1974	1301	توزيع أرباح نقدية	2021-02-17	2021-02-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.654234
1975	3001	تغيير نظام الشركة	2021-01-25	2021-02-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.654545
1976	4348	توزيع أرباح نقدية	2021-01-31	2021-02-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.654858
1977	1304	توزيع أرباح نقدية	2020-12-23	2021-02-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.65522
1978	4338	توزيع أرباح نقدية	2021-02-08	2021-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.655541
1979	4340	توزيع أرباح نقدية	2021-02-01	2021-02-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.655877
1980	3040	توزيع أرباح نقدية	2021-02-04	2021-02-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.65623
1981	6001	توزيع أرباح نقدية	2020-12-28	2021-02-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.656553
1982	4342	توزيع أرباح نقدية	2021-01-25	2021-02-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.656884
1983	4161	تغيير نظام الشركة	2021-01-07	2021-01-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.657237
1984	6070	توزيع أرباح نقدية	2020-12-24	2021-01-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.65754
1985	6020	تغيير نظام الشركة	2020-12-09	2021-01-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.657869
1986	2320	توزيع أرباح نقدية	2020-12-31	2021-01-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.658289
1987	4336	توزيع أرباح نقدية	2021-01-18	2021-01-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.65869
1988	4333	توزيع أرباح نقدية	2021-01-17	2021-01-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.658999
1989	4339	توزيع أرباح نقدية	2021-01-03	2021-01-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.659425
1990	4291	توزيع أرباح نقدية	2020-11-22	2021-01-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.65997
1991	1832	تغيير اسم الشركة	2020-10-07	2021-01-14	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALSAMAANI إلى SADR	2025-12-25 15:06:15.660279
1992	4292	توزيع أرباح نقدية	2020-10-26	2021-01-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.660566
1993	4335	توزيع أرباح نقدية	2021-01-03	2021-01-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.66087
1994	7200	توزيع أرباح نقدية	2021-01-04	2021-01-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.661183
1995	2270	توزيع أرباح نقدية	2021-01-05	2021-01-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.661598
1996	4321	توزيع أرباح نقدية	2020-12-30	2021-01-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.661955
1997	2250	توزيع أرباح نقدية	2020-12-22	2021-01-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:15.662314
1998	9510	تغيير نظام الشركة	2020-12-10	2021-01-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:15.662842
1999	2020	تغيير اسم الشركة	2020-10-27	2021-01-03	\N	\N	\N	SAR	تم تعديل اسم الشركة من SAFCO إلى SABIC AGRI-NUTRIENTS	2025-12-25 15:06:15.663318
2000	9510	زيادة رأس المال المصرح به	2020-07-15	2021-01-03	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  60000000 إلى  120000000	2025-12-25 15:06:15.663714
2001	9510	توزيع أسهم خزينة كأسهم منحة	2020-07-15	2021-01-03	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:16.233365
2002	4280	توزيع أرباح نقدية	2020-03-31	2021-01-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.234224
2003	2310	شراء اسهم خزينة	2021-01-19	2020-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2670000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:16.234707
2004	1020	تغيير نظام الشركة	2020-12-07	2020-12-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.235137
2005	2290	تغيير نظام الشركة	2020-12-07	2020-12-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.235528
2006	8120	تغيير اسم الشركة	2019-01-24	2020-12-30	\N	\N	\N	SAR	تم تعديل اسم الشركة من Gulf Union إلى GULF UNION ALAHLIA	2025-12-25 15:06:16.23677
2007	4344	توزيع أرباح نقدية	2020-12-24	2020-12-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.237233
2008	3092	تغيير نظام الشركة	2020-12-06	2020-12-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.237686
2009	4004	توزيع أرباح نقدية	2020-12-15	2020-12-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.238081
2010	2310	توزيع أرباح نقدية	2020-12-15	2020-12-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.238437
2011	1213	تغيير نظام الشركة	2020-11-29	2020-12-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.238895
2012	1213	تخفيض رأس المال المصرح به	2020-09-28	2020-12-21	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  178160000 الى  61632010	2025-12-25 15:06:16.239287
2013	1213	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-09-28	2020-12-21	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:16.239713
2014	8311	تغيير نظام الشركة	2020-11-09	2020-12-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.240163
2015	1832	تعديل رمز التداول	2020-12-06	2020-12-10	\N	\N	\N	SAR	تم تعديل رمز التداول من 9504 إلى 1832	2025-12-25 15:06:16.24083
2016	2300	تغيير نظام الشركة	2020-11-15	2020-12-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.241457
2017	8140	إلغاء الإدراج	2020-10-11	2020-12-07	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2020-12-07	2025-12-25 15:06:16.241927
2018	2300	زيادة رأس المال المصرح به	2019-09-16	2020-12-07	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  92000000 إلى  192000000	2025-12-25 15:06:16.242372
2019	2300	زيادة رأس مال - إصدار حقوق أولوية	2019-09-16	2020-12-07	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.242737
2020	1832	تحويل الشركة من سوق ﻵخر	2020-12-03	2020-12-06	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2020-12-06	2025-12-25 15:06:16.243059
2021	8120	زيادة رأس مال - اكتتاب خاص	2020-06-07	2020-12-06	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:16.243326
2022	2160	تغيير نظام الشركة	2020-11-22	2020-12-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.243604
2023	2160	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-06-14	2020-12-02	\N	\N	\N	SAR	تخفيض رأس المال من   344,517,000  الى 200,000,000  وعدد الاسهم الى 20,000,000 بقيمة اسمية للسهم 10 	2025-12-25 15:06:16.243916
2024	2160	زيادة رأس مال - إصدار حقوق أولوية	2020-06-14	2020-12-02	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.244549
2025	2160	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-06-14	2020-12-02	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:16.245155
2026	2160	تخفيض رأس المال المصرح به	2020-06-14	2020-12-02	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  344517000 الى  200000000	2025-12-25 15:06:16.245689
2027	2160	زيادة رأس مال - إصدار حقوق أولوية	2019-10-06	2020-12-02	\N	\N	\N	SAR	زياده راس المال من 200,000,000  الى 320,000,000  من خلال اصدار 12,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:16.246085
2028	2160	زيادة رأس المال المصرح به	2019-10-06	2020-12-02	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  320000000	2025-12-25 15:06:16.246526
2029	2360	توزيع أرباح نقدية	2020-11-11	2020-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.24693
2030	7010	شراء اسهم خزينة	2020-04-21	2020-11-26	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2982700 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:16.247367
2031	1303	شراء اسهم خزينة	2020-04-06	2020-11-26	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 312867 سهم خزينة بينما كانت قد استهدفت شراء 350000	2025-12-25 15:06:16.247865
2032	4161	توزيع أرباح نقدية	2020-11-10	2020-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.248267
2033	2020	تغيير نظام الشركة	2020-10-27	2020-11-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.248694
2034	2020	زيادة رأس مال - اكتتاب خاص	2019-12-25	2020-11-19	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:16.249071
2035	2020	زيادة رأس المال المصرح به	2019-12-25	2020-11-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  4760354040	2025-12-25 15:06:16.249438
2036	4180	توزيع أرباح نقدية	2020-11-11	2020-11-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.249851
2037	9511	توزيع أرباح نقدية	2020-10-11	2020-11-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.250249
2038	3003	توزيع أرباح نقدية	2020-11-08	2020-11-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.250604
2039	1302	توزيع أرباح نقدية	2020-10-25	2020-11-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.251056
2040	4190	توزيع أرباح نقدية	2020-11-04	2020-11-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.251448
2041	2222	توزيع أرباح نقدية	2020-11-03	2020-11-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.252448
2042	4342	توزيع أرباح نقدية	2020-11-02	2020-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.252847
2043	4347	توزيع أرباح نقدية	2020-11-04	2020-11-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.253199
2044	3040	توزيع أرباح نقدية	2020-11-01	2020-11-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.253591
2045	4050	توزيع أرباح نقدية	2020-10-27	2020-11-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.253994
2046	4348	توزيع أرباح نقدية	2020-10-29	2020-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.254331
2047	4013	توزيع أرباح نقدية	2020-10-25	2020-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.254698
2048	1832	تغيير نظام الشركة	2020-10-07	2020-11-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.255054
2049	7010	توزيع أرباح نقدية	2020-10-21	2020-10-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.255401
2050	4061	تغيير نظام الشركة	2020-10-06	2020-10-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.259115
2051	4061	زيادة رأس مال - إصدار حقوق أولوية	2019-12-04	2020-10-28	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.259569
2052	4061	زيادة رأس المال المصرح به	2019-12-04	2020-10-28	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  15000000 إلى  105000000	2025-12-25 15:06:16.260096
2053	3003	توزيع أرباح نقدية	2019-11-05	2020-10-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.260509
2054	3003	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-11-05	2020-10-28	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:16.260901
2055	3003	تخفيض رأس المال المصرح به	2019-11-05	2020-10-26	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  1892000000 الى  1400000000	2025-12-25 15:06:16.261268
2056	2330	توزيع أرباح نقدية	2020-09-29	2020-10-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.261613
2057	4336	توزيع أرباح نقدية	2020-10-15	2020-10-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.261918
2058	4344	توزيع أرباح نقدية	2020-10-14	2020-10-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.262279
2059	4331	توزيع أرباح نقدية	2020-10-12	2020-10-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.262628
2060	4339	توزيع أرباح نقدية	2020-10-01	2020-10-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.263073
2061	7030	تغيير نظام الشركة	2020-09-21	2020-10-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.263607
2062	7030	زيادة رأس المال المصرح به	2020-02-10	2020-10-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  8987291750	2025-12-25 15:06:16.264731
2063	7030	زيادة رأس مال - إصدار حقوق أولوية	2020-02-10	2020-10-15	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.265112
2064	7030	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-02-10	2020-10-13	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:16.265425
2065	4333	توزيع أرباح نقدية	2020-10-07	2020-10-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.26581
2066	7030	تغيير نظام الشركة	2020-09-17	2020-10-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.266149
2067	7030	تخفيض رأس المال المصرح به	2020-02-10	2020-10-11	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  null الى  4487291750	2025-12-25 15:06:16.266535
2068	4030	توزيع أرباح نقدية	2020-09-21	2020-10-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.266929
2069	8120	تغيير نظام الشركة	2020-09-13	2020-10-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.26729
2070	3008	زيادة رأس المال المصرح به	2019-11-17	2020-10-06	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  9041760 إلى  45208800	2025-12-25 15:06:16.267718
2071	3008	زيادة رأس مال - إصدار حقوق أولوية	2019-11-17	2020-10-06	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.268147
2072	3002	توزيع أرباح نقدية	2020-09-24	2020-10-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.268512
2073	3060	توزيع أرباح نقدية	2020-07-23	2020-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.268894
2074	1182	توزيع أرباح نقدية	2020-07-13	2020-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.269253
2075	4280	توزيع أرباح نقدية	2020-03-31	2020-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.269654
2076	7010	شراء اسهم خزينة	2020-03-17	2020-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1785384 سهم خزينة بينما كانت قد استهدفت شراء 5500000	2025-12-25 15:06:16.270011
2077	1301	توزيع أرباح نقدية	2020-09-16	2020-09-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.270464
2078	3092	توزيع أرباح نقدية	2020-09-13	2020-09-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.270792
2079	1301	توزيع أرباح نقدية	2020-01-14	2020-09-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.271119
2080	1301	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-01-14	2020-09-16	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:16.271442
2081	4012	توزيع أرباح نقدية	2020-07-20	2020-09-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.271765
2082	4004	زيادة رأس المال المصرح به	2020-09-13	2020-09-14	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  750000000 إلى  900000000	2025-12-25 15:06:16.272238
2083	4150	توزيع أرباح نقدية	2020-07-22	2020-09-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.272588
2084	4004	توزيع أسهم خزينة كأسهم منحة	2020-02-27	2020-09-14	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:16.272939
2085	2050	شراء اسهم خزينة	2020-01-29	2020-09-14	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 341675 سهم خزينة بينما كانت قد استهدفت شراء 700000	2025-12-25 15:06:16.273376
2086	1301	تخفيض رأس المال المصرح به	2020-01-14	2020-09-14	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  438750000 الى  351000000	2025-12-25 15:06:16.273788
2087	4191	توزيع أرباح نقدية	2020-07-15	2020-09-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.274133
2088	1831	توزيع أرباح نقدية	2020-09-02	2020-09-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.274503
2089	3004	توزيع أرباح نقدية	2020-08-30	2020-09-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.274889
2090	4330	توزيع أرباح نقدية	2020-08-26	2020-09-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.275231
2091	4001	توزيع أرباح نقدية	2020-08-23	2020-09-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.275555
2092	2010	توزيع أرباح نقدية	2020-06-17	2020-09-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.275975
2093	2120	توزيع أرباح نقدية	2020-08-19	2020-08-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.276405
2094	6070	توزيع أرباح نقدية	2020-08-20	2020-08-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.27679
2095	3005	توزيع أرباح نقدية	2020-07-28	2020-08-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.277111
2096	8150	تخفيض رأس المال المصرح به	2020-01-16	2020-08-27	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  200000000 الى  141000000	2025-12-25 15:06:16.277511
2097	8150	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-01-16	2020-08-27	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:16.277849
2098	3040	توزيع أرباح نقدية	2020-08-23	2020-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.278169
2099	4013	توزيع أرباح نقدية	2020-08-16	2020-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.278603
2100	4338	توزيع أرباح نقدية	2020-08-17	2020-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.279204
2101	4190	توزيع أرباح نقدية	2020-08-11	2020-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.74778
2102	4008	توزيع أرباح نقدية	2020-07-26	2020-08-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.750294
2103	2222	توزيع أرباح نقدية	2020-08-09	2020-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.751433
2104	4340	توزيع أرباح نقدية	2020-08-06	2020-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.751994
2105	3010	توزيع أرباح نقدية	2020-07-26	2020-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.752383
2106	4342	توزيع أرباح نقدية	2020-07-28	2020-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.75275
2107	3050	توزيع أرباح نقدية	2020-07-23	2020-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.753189
2108	4003	توزيع أرباح نقدية	2020-07-20	2020-08-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.753848
2109	4090	توزيع أرباح نقدية	2020-07-16	2020-08-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.754307
2110	4260	توزيع أرباح نقدية	2020-07-23	2020-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.754713
2111	7010	توزيع أرباح نقدية	2020-07-22	2020-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.755147
2112	4348	توزيع أرباح نقدية	2020-07-22	2020-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.755574
2113	4337	توزيع أرباح نقدية	2020-07-15	2020-07-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.756046
2114	7200	توزيع أرباح نقدية	2020-07-05	2020-07-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.756559
2115	2140	تغيير اسم الشركة	2020-06-03	2020-07-22	\N	\N	\N	SAR	تم تعديل اسم الشركة من ADC إلى AYYAN	2025-12-25 15:06:16.756985
2116	4141	تعديل رمز التداول	2020-07-15	2020-07-21	\N	\N	\N	SAR	تم تعديل رمز التداول من 9502 إلى 4141	2025-12-25 15:06:16.757376
2117	4141	تحويل الشركة من سوق ﻵخر	2020-07-15	2020-07-21	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2020-07-21	2025-12-25 15:06:16.757717
2118	4333	توزيع أرباح نقدية	2020-07-15	2020-07-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.758086
2119	1810	تغيير نظام الشركة	2020-07-19	2020-07-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.758496
2120	4321	توزيع أرباح نقدية	2020-07-14	2020-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.758882
2121	4070	تغيير نظام الشركة	2020-07-16	2020-07-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.759202
2122	4339	توزيع أرباح نقدية	2020-07-06	2020-07-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.75953
2123	4070	زيادة رأس مال - إصدار حقوق أولوية	2019-03-25	2020-07-16	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.759876
2124	4070	زيادة رأس المال المصرح به	2019-03-25	2020-07-16	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  75000000 إلى  175000000	2025-12-25 15:06:16.760234
2125	4336	توزيع أرباح نقدية	2020-07-12	2020-07-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.760909
2126	4335	توزيع أرباح نقدية	2020-07-02	2020-07-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.761389
2127	2290	توزيع أرباح نقدية	2020-05-11	2020-07-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.761808
2128	4344	توزيع أرباح نقدية	2020-07-02	2020-07-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.765306
2129	4348	زيادة رأس مال - إصدار حقوق أولوية	2020-06-28	2020-07-06	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.765844
2130	4348	زيادة رأس مال - اكتتاب خاص	2020-01-29	2020-07-06	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:16.766465
2131	4013	توزيع أرباح نقدية	2020-06-28	2020-07-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.767163
2132	4331	تغيير اسم الشركة	2020-06-03	2020-07-02	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALJAZIRA REIT إلى ALJAZIRA REIT	2025-12-25 15:06:16.767635
2133	2330	توزيع أرباح نقدية	2020-06-24	2020-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.768076
2134	8210	تغيير نظام الشركة	2020-06-09	2020-07-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.76848
2135	9511	توزيع أرباح نقدية	2020-05-31	2020-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.769041
2136	2250	توزيع أرباح نقدية	2020-04-16	2020-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.769472
2137	4280	توزيع أرباح نقدية	2020-03-31	2020-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.769867
2138	7204	تخفيض رأس المال المصرح به	2020-01-26	2020-07-01	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  400000000 الى  500000	2025-12-25 15:06:16.770463
2139	1060	بيع أسهم خزينة	2020-06-30	2020-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 9392 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:16.770863
2140	1090	بيع أسهم خزينة	2020-06-30	2020-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 125283 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:16.771252
2141	1180	شراء اسهم خزينة	2020-06-30	2020-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3785953 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:16.771835
2142	2280	بيع أسهم خزينة	2020-06-30	2020-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 848412 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:16.772377
2143	4003	شراء اسهم خزينة	2020-03-18	2020-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 400000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:16.772852
2144	2310	شراء اسهم خزينة	2019-12-09	2020-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 155066 سهم خزينة بينما كانت قد استهدفت شراء 73126989	2025-12-25 15:06:16.773372
2145	1832	تغيير نظام الشركة	2020-06-03	2020-06-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.77377
2146	2140	تغيير نظام الشركة	2020-06-03	2020-06-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.774232
2147	1832	توزيع أسهم خزينة كأسهم منحة	2019-11-21	2020-06-28	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:16.774743
2148	1832	توزيع أرباح نقدية	2019-11-21	2020-06-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.77522
2149	1832	زيادة رأس المال المصرح به	2019-11-21	2020-06-28	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  15000000 إلى  25000000	2025-12-25 15:06:16.775632
2150	4050	توزيع أرباح نقدية	2020-05-14	2020-06-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.775984
2151	2020	توزيع أرباح نقدية	2020-05-14	2020-06-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.776634
2152	2270	تغيير نظام الشركة	2020-05-19	2020-06-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.777103
2153	8040	تغيير نظام الشركة	2020-05-17	2020-06-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.778361
2154	2270	توزيع أرباح نقدية	2020-05-06	2020-06-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.779481
2155	8040	زيادة رأس مال - إصدار حقوق أولوية	2018-06-05	2020-06-17	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.784715
2156	8040	زيادة رأس المال المصرح به	2018-06-05	2020-06-17	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  600000000	2025-12-25 15:06:16.785822
2157	4190	توزيع أرباح نقدية	2020-06-11	2020-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.786245
2158	3030	توزيع أرباح نقدية	2020-06-10	2020-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.786612
2159	4260	توزيع أرباح نقدية	2020-04-20	2020-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.786926
2160	8312	تغيير نظام الشركة	2020-04-05	2020-06-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.787289
2161	3060	توزيع أرباح نقدية	2020-03-05	2020-06-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.787618
2162	5110	تغيير نظام الشركة	2020-05-12	2020-06-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.787971
2163	5110	توزيع أرباح نقدية	2020-04-21	2020-06-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.788354
2164	7200	توزيع أسهم خزينة كأسهم منحة	2020-01-05	2020-06-02	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:16.788765
2165	7200	تغيير نظام الشركة	2020-01-05	2020-06-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.789132
2166	7200	زيادة رأس المال المصرح به	2020-01-05	2020-06-02	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  160000000 إلى  200000000	2025-12-25 15:06:16.789681
2167	2222	توزيع أرباح نقدية	2020-05-12	2020-05-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.790104
2168	4347	توزيع أرباح نقدية	2020-05-19	2020-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.790603
2169	6050	تغيير نظام الشركة	2020-04-13	2020-05-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.790997
2170	6001	توزيع أرباح نقدية	2020-04-01	2020-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.791348
2171	4320	توزيع أرباح نقدية	2020-04-01	2020-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.791775
2172	2070	توزيع أرباح نقدية	2020-03-31	2020-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.792103
2173	6050	زيادة رأس مال - إصدار حقوق أولوية	2018-05-24	2020-05-17	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:16.792438
2174	6050	زيادة رأس المال المصرح به	2018-05-24	2020-05-17	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  101100000 إلى  400000000	2025-12-25 15:06:16.794453
2175	8240	تغيير نظام الشركة	2020-04-22	2020-05-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.794899
2176	4250	تغيير نظام الشركة	2020-04-20	2020-05-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.795285
2177	2001	تغيير نظام الشركة	2020-03-12	2020-05-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.795701
2178	1213	تغيير اسم الشركة	2020-02-27	2020-05-14	\N	\N	\N	SAR	تم تعديل اسم الشركة من Al Sorayai Group إلى NASEEJ	2025-12-25 15:06:16.796051
2179	1050	توزيع أرباح نقدية	2019-12-30	2020-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.796428
2180	1212	تغيير نظام الشركة	2020-04-20	2020-05-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.796824
2181	4342	توزيع أرباح نقدية	2020-05-04	2020-05-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.797129
2182	8200	تغيير نظام الشركة	2020-04-19	2020-05-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.797583
2183	4013	تغيير نظام الشركة	2020-04-16	2020-05-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.797955
2184	2230	تغيير نظام الشركة	2020-04-16	2020-05-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.79847
2185	4210	تغيير نظام الشركة	2020-04-15	2020-05-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.798886
2186	6070	توزيع أرباح نقدية	2020-03-19	2020-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.799215
2187	3040	توزيع أرباح نقدية	2020-05-04	2020-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.800449
2188	6010	تغيير نظام الشركة	2020-04-14	2020-05-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.800849
2189	4290	توزيع أرباح نقدية	2020-03-26	2020-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.80122
2190	4003	توزيع أسهم خزينة كأسهم منحة	2020-03-08	2020-05-06	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:16.801654
2191	4003	تغيير نظام الشركة	2020-03-08	2020-05-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.802089
2192	4003	زيادة رأس المال المصرح به	2020-03-08	2020-05-06	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  500000000 إلى  600000000	2025-12-25 15:06:16.802472
2193	6010	توزيع أسهم خزينة كأسهم منحة	2019-11-10	2020-05-06	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:16.802832
2194	6010	زيادة رأس المال المصرح به	2019-11-10	2020-05-06	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  847000000 إلى  1016400000	2025-12-25 15:06:16.803178
2195	1830	تغيير نظام الشركة	2020-04-05	2020-05-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.803483
2196	2310	تغيير نظام الشركة	2020-04-07	2020-04-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:16.803809
2197	2050	توزيع أرباح نقدية	2020-01-29	2020-04-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.80415
2198	7010	توزيع أرباح نقدية	2020-04-21	2020-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.804551
2199	4200	توزيع أرباح نقدية	2020-03-31	2020-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.804946
2200	4345	توزيع أرباح نقدية	2020-04-16	2020-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:16.805251
2201	1213	تغيير نظام الشركة	2020-02-27	2020-04-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.271379
2202	1140	توزيع أرباح نقدية	2020-02-11	2020-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.271904
2203	2330	توزيع أرباح نقدية	2020-04-01	2020-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.272479
2204	4002	توزيع أرباح نقدية	2020-03-16	2020-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.27317
2205	8311	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-01-19	2020-04-23	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:17.273439
2206	8311	تخفيض رأس المال المصرح به	2020-01-19	2020-04-23	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  300000000 الى  150000000	2025-12-25 15:06:17.273684
2207	8311	تغيير نظام الشركة	2020-01-19	2020-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.273899
2208	1060	توزيع أرباح نقدية	2020-01-01	2020-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.274144
2209	2030	توزيع أرباح نقدية	2020-03-11	2020-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.274369
2210	3030	توزيع أرباح نقدية	2020-02-06	2020-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.276031
2211	2010	توزيع أرباح نقدية	2019-12-18	2020-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.276598
2212	6002	توزيع أرباح نقدية	2020-03-12	2020-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.277006
2213	7010	توزيع أرباح نقدية	2020-01-22	2020-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.277418
2214	4030	توزيع أرباح نقدية	2020-01-20	2020-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.277738
2215	4333	توزيع أرباح نقدية	2020-04-15	2020-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.278165
2216	4150	توزيع أرباح نقدية	2020-03-12	2020-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.278744
2217	4100	توزيع أرباح نقدية	2020-03-12	2020-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.282543
2218	3010	توزيع أرباح نقدية	2020-03-02	2020-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.286373
2219	3007	توزيع أرباح نقدية	2020-02-27	2020-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.2996
2220	4051	توزيع أرباح نقدية	2020-03-15	2020-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.30112
2221	2002	توزيع أرباح نقدية	2020-03-05	2020-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.302241
2222	4339	توزيع أرباح نقدية	2020-04-01	2020-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.303555
2223	2090	توزيع أرباح نقدية	2020-03-17	2020-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.309415
2224	1020	توزيع أرباح نقدية	2020-01-26	2020-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.326267
2225	4005	توزيع أرباح نقدية	2020-01-26	2020-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.327744
2226	7201	تعديل رمز التداول	2020-04-12	2020-04-15	\N	\N	\N	SAR	تم تعديل رمز التداول من 9505 إلى 7201	2025-12-25 15:06:17.328244
2227	3080	تغيير نظام الشركة	2020-03-23	2020-04-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.328709
2228	3080	توزيع أرباح نقدية	2020-03-18	2020-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.32926
2229	7201	تحويل الشركة من سوق ﻵخر	2020-03-17	2020-04-15	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2020-04-15	2025-12-25 15:06:17.329716
2230	2190	تغيير نظام الشركة	2020-03-22	2020-04-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.330407
2231	2190	توزيع أرباح نقدية	2020-02-27	2020-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.331038
2232	4330	توزيع أرباح نقدية	2020-04-05	2020-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.331517
2233	4010	توزيع أرباح نقدية	2020-02-19	2020-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.332077
2234	4344	توزيع أرباح نقدية	2020-04-07	2020-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.332742
2235	2100	تخفيض رأس المال المصرح به	2020-03-16	2020-04-09	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  200000000 الى  77170350	2025-12-25 15:06:17.33406
2236	2100	تغيير نظام الشركة	2020-03-16	2020-04-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.334722
2237	2100	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-03-16	2020-04-09	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:17.336616
2238	1150	زيادة رأس المال المصرح به	2019-12-15	2020-04-09	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  20000000000	2025-12-25 15:06:17.338432
2239	1150	تغيير نظام الشركة	2019-12-15	2020-04-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.345438
2240	1150	توزيع أسهم خزينة كأسهم منحة	2019-12-15	2020-04-09	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:17.346331
2241	4346	توزيع أرباح نقدية	2020-03-31	2020-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.34689
2242	3005	توزيع أرباح نقدية	2020-02-25	2020-04-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.347245
2243	3020	توزيع أرباح نقدية	2020-02-11	2020-04-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.34759
2244	3050	توزيع أرباح نقدية	2020-03-05	2020-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.352796
2245	2280	توزيع أرباح نقدية	2019-12-09	2020-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.366966
2246	4001	توزيع أرباح نقدية	2020-03-18	2020-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.369836
2247	4280	توزيع أرباح نقدية	2020-03-31	2020-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.371763
2248	1180	توزيع أرباح نقدية	2019-12-25	2020-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.372579
2249	2330	توزيع أرباح نقدية	2019-12-09	2020-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.373494
2250	2280	شراء اسهم خزينة	2020-03-31	2020-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5442852 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:17.381078
2251	1060	بيع أسهم خزينة	2020-03-31	2020-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 659738 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.381593
2252	1090	بيع أسهم خزينة	2020-03-31	2020-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 319874 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.38187
2253	1180	بيع أسهم خزينة	2020-03-31	2020-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 3032199 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.382259
2254	2380	بيع أسهم خزينة	2020-03-31	2020-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 4000 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.382579
2255	8210	بيع أسهم خزينة	2020-03-31	2020-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 113840 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.382829
2256	1080	توزيع أرباح نقدية	2019-12-29	2020-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.383284
2257	1120	توزيع أرباح نقدية	2020-02-03	2020-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.383698
2258	2020	توزيع أرباح نقدية	2019-12-16	2020-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.383961
2259	4090	توزيع أرباح نقدية	2020-02-27	2020-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.384292
2260	1090	توزيع أرباح نقدية	2020-01-09	2020-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.384542
2261	1010	توزيع أرباح نقدية	2019-12-30	2020-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.384902
2262	1831	توزيع أرباح نقدية	2020-03-18	2020-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.385525
2263	4004	توزيع أرباح نقدية	2020-02-27	2020-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.386381
2264	4334	توزيع أرباح نقدية	2020-03-17	2020-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.386929
2265	2222	توزيع أرباح نقدية	2020-03-15	2020-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.38733
2266	6040	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-11-11	2020-03-19	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:17.389205
2267	4338	توزيع أرباح نقدية	2020-03-16	2020-03-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.39114
2268	4190	توزيع أرباح نقدية	2020-03-12	2020-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.393116
2269	4332	توزيع أرباح نقدية	2020-03-10	2020-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.393939
2270	4003	توزيع أرباح نقدية	2020-03-08	2020-03-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.394839
2271	2290	توزيع أرباح نقدية	2019-12-25	2020-03-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.395406
2272	6004	توزيع أرباح نقدية	2020-02-18	2020-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.395981
2273	2320	توزيع أرباح نقدية	2020-03-02	2020-03-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.396443
2274	1210	توزيع أرباح نقدية	2019-12-19	2020-03-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.396779
2275	4012	توزيع أرباح نقدية	2020-02-18	2020-03-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.397934
2276	4336	توزيع أرباح نقدية	2020-03-03	2020-03-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.399642
2277	8011	إلغاء الإدراج	2020-01-02	2020-03-03	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2020-03-03	2025-12-25 15:06:17.400492
2278	8060	زيادة رأس المال المصرح به	2020-03-01	2020-03-01	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  528000000 إلى  646397060	2025-12-25 15:06:17.401235
2279	7040	تخفيض رأس مال - بتخفيض عدد الأسهم	2020-01-23	2020-03-01	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:17.402266
2280	7040	تخفيض رأس المال المصرح به	2020-01-23	2020-03-01	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  350529000 الى  228529000	2025-12-25 15:06:17.402871
2281	7040	تغيير نظام الشركة	2020-01-23	2020-03-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.403175
2282	8060	زيادة رأس مال - اكتتاب خاص	2019-09-29	2020-03-01	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:17.408304
2283	3091	تغيير نظام الشركة	2020-02-03	2020-02-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.408925
2284	4012	تغيير اسم الشركة	2020-02-24	2020-02-24	\N	\N	\N	SAR	تم تعديل اسم الشركة من THOB ALASEEL إلى ALASEEL	2025-12-25 15:06:17.409437
2285	2170	تغيير اسم الشركة	2020-01-14	2020-02-24	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALUJAIN إلى ALUJAIN	2025-12-25 15:06:17.409806
2286	4348	توزيع أرباح نقدية	2020-01-30	2020-02-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.410074
2287	4340	توزيع أرباح نقدية	2020-02-09	2020-02-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.410361
2288	4336	زيادة رأس مال - اكتتاب خاص	2020-01-21	2020-02-05	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:17.410693
2289	4336	زيادة رأس المال المصرح به	2020-01-21	2020-02-05	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  600000000 إلى  681086520	2025-12-25 15:06:17.410978
2290	2170	تغيير نظام الشركة	2020-01-14	2020-02-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.411432
2291	2140	تغيير نظام الشركة	2020-01-02	2020-02-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.412856
2292	2140	زيادة رأس المال المصرح به	2019-03-20	2020-02-03	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  490000000 إلى  737320690	2025-12-25 15:06:17.413393
2293	2140	زيادة رأس مال - اكتتاب خاص	2019-03-20	2020-02-03	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:17.413643
2294	3040	توزيع أرباح نقدية	2020-01-30	2020-02-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.413933
2295	8060	تغيير نظام الشركة	2020-01-05	2020-01-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.414263
2296	2080	تغيير نظام الشركة	2019-12-31	2020-01-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.414633
2297	1213	تغيير نظام الشركة	2019-12-31	2020-01-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.414895
2298	1213	زيادة رأس مال - إصدار حقوق أولوية	2019-09-25	2020-01-23	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:17.4153
2299	1213	زيادة رأس المال المصرح به	2019-09-25	2020-01-23	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  65500000 إلى  178160000	2025-12-25 15:06:17.415875
2300	4337	توزيع أرباح نقدية	2020-01-13	2020-01-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.41625
2301	4336	توزيع أرباح نقدية	2020-01-16	2020-01-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.88792
2302	4342	توزيع أرباح نقدية	2020-01-13	2020-01-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.888456
2303	4292	تغيير نظام الشركة	2019-12-29	2020-01-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.888989
2304	4292	توزيع أرباح نقدية	2019-10-30	2020-01-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.889311
2305	4339	توزيع أرباح نقدية	2020-01-01	2020-01-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.889645
2306	4333	توزيع أرباح نقدية	2020-01-12	2020-01-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.889894
2307	7200	توزيع أرباح نقدية	2020-01-05	2020-01-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.89014
2308	4335	توزيع أرباح نقدية	2020-01-02	2020-01-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.890387
2309	3090	تغيير نظام الشركة	2019-12-11	2020-01-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.890655
2310	4344	توزيع أرباح نقدية	2019-12-29	2020-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.890908
2311	2360	توزيع أرباح نقدية	2019-12-22	2020-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.891155
2312	2250	توزيع أرباح نقدية	2019-12-22	2020-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.891371
2313	2110	تغيير نظام الشركة	2019-12-10	2020-01-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.891648
2314	4061	تغيير نظام الشركة	2019-12-10	2020-01-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.891913
2315	4061	تخفيض رأس المال المصرح به	2019-11-26	2020-01-01	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  15000000 الى  196000000	2025-12-25 15:06:17.892191
2316	4061	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-11-26	2020-01-01	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:17.892444
2317	2110	زيادة رأس المال المصرح به	2019-04-16	2020-01-01	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  110614060 إلى  360614060	2025-12-25 15:06:17.892694
2318	2110	زيادة رأس مال - إصدار حقوق أولوية	2019-04-16	2020-01-01	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:17.892941
2319	4280	توزيع أرباح نقدية	2019-03-28	2020-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.893187
2320	1060	شراء اسهم خزينة	2019-12-31	2019-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1632165 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:17.893419
2321	2040	شراء اسهم خزينة	2019-12-31	2019-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 397000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:17.89371
2322	1090	بيع أسهم خزينة	2019-12-31	2019-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 68987 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.893968
2323	2160	بيع أسهم خزينة	2019-12-31	2019-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 1358308 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.894195
2324	2310	بيع أسهم خزينة	2019-12-31	2019-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 24538 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.894456
2325	2380	بيع أسهم خزينة	2019-12-31	2019-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 4800 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:17.894803
2326	2280	شراء اسهم خزينة	2019-04-08	2019-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 4054580 سهم خزينة بينما كانت قد استهدفت شراء 10000000	2025-12-25 15:06:17.895013
2327	4291	تغيير نظام الشركة	2019-12-04	2019-12-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.895232
2328	4291	توزيع أرباح نقدية	2019-11-06	2019-12-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.895424
2329	8120	تغيير نظام الشركة	2019-11-25	2019-12-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.895657
2330	4321	توزيع أرباح نقدية	2019-12-08	2019-12-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.895968
2331	8250	تغيير نظام الشركة	2019-11-24	2019-12-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.896169
2332	1020	تغيير نظام الشركة	2019-10-09	2019-12-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.896381
2333	8250	توزيع أسهم خزينة كأسهم منحة	2019-03-03	2019-12-17	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:17.89658
2334	8250	زيادة رأس المال المصرح به	2019-03-03	2019-12-17	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  450000000 إلى  500000000	2025-12-25 15:06:17.89684
2335	1050	تغيير نظام الشركة	2019-11-21	2019-12-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.897027
2336	3040	توزيع أرباح نقدية	2019-12-08	2019-12-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.897282
2337	2080	توزيع أرباح نقدية	2019-05-16	2019-12-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.897484
2338	2080	توزيع أرباح نقدية	2019-05-16	2019-12-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.90553
2339	1830	توزيع أرباح نقدية	2019-12-02	2019-12-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.906056
2340	2270	توزيع أرباح نقدية	2019-12-02	2019-12-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.908811
2341	4051	تحويل الشركة من سوق ﻵخر	2019-11-28	2019-12-04	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2019-12-04	2025-12-25 15:06:17.909081
2342	4051	تعديل رمز التداول	2019-11-28	2019-12-04	\N	\N	\N	SAR	تم تعديل رمز التداول من 9503 إلى 4051	2025-12-25 15:06:17.909292
2343	1303	شراء اسهم خزينة	2019-12-01	2019-12-01	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 169033 سهم خزينة بينما كانت قد استهدفت شراء 500000	2025-12-25 15:06:17.909485
2344	4004	توزيع أرباح نقدية	2019-11-12	2019-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.909681
2345	8270	توزيع أرباح نقدية	2019-09-26	2019-11-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.909933
2346	4001	توزيع أرباح نقدية	2019-11-12	2019-11-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.910171
2347	6004	توزيع أرباح نقدية	2019-11-06	2019-11-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.91046
2348	3007	توزيع أرباح نقدية	2019-10-24	2019-11-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.91082
2349	6012	تعديل رمز التداول	2019-11-17	2019-11-21	\N	\N	\N	SAR	تم تعديل رمز التداول من 9506 إلى 6012	2025-12-25 15:06:17.911259
2350	6012	تحويل الشركة من سوق ﻵخر	2019-11-17	2019-11-21	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2019-11-21	2025-12-25 15:06:17.911747
2351	8210	شراء اسهم خزينة	2019-11-13	2019-11-21	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 142526 سهم خزينة بينما كانت قد استهدفت شراء 15000000	2025-12-25 15:06:17.911961
2352	2320	توزيع أرباح نقدية	2019-11-11	2019-11-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.912211
2353	4347	توزيع أرباح نقدية	2019-11-17	2019-11-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.912461
2354	4190	توزيع أرباح نقدية	2019-11-06	2019-11-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.912645
2355	4348	توزيع أرباح نقدية	2019-10-31	2019-11-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.912848
2356	4090	توزيع أرباح نقدية	2019-11-13	2019-11-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.913033
2357	4191	تعديل رمز التداول	2019-11-05	2019-11-11	\N	\N	\N	SAR	تم تعديل رمز التداول من 9500 إلى 4191	2025-12-25 15:06:17.913226
2358	4191	تحويل الشركة من سوق ﻵخر	2019-11-04	2019-11-11	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2019-11-11	2025-12-25 15:06:17.924247
2359	4012	تعديل رمز التداول	2019-11-05	2019-11-10	\N	\N	\N	SAR	تم تعديل رمز التداول من 9507 إلى 4012	2025-12-25 15:06:17.925755
2360	4012	تحويل الشركة من سوق ﻵخر	2019-11-04	2019-11-10	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2019-11-10	2025-12-25 15:06:17.92608
2361	1211	زيادة رأس مال - اكتتاب خاص	2019-06-26	2019-11-10	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:17.926595
2362	2300	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-09-16	2019-11-05	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:17.926978
2363	2300	تخفيض رأس المال المصرح به	2019-09-16	2019-11-05	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  92000000 الى  245000000	2025-12-25 15:06:17.927248
2364	1211	زيادة رأس المال المصرح به	2019-06-26	2019-11-05	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  12305911460	2025-12-25 15:06:17.927584
2365	3008	تعديل رمز التداول	2019-10-29	2019-11-03	\N	\N	\N	SAR	تم تعديل رمز التداول من 9508 إلى 3008	2025-12-25 15:06:17.92787
2366	4260	توزيع أرباح نقدية	2019-10-27	2019-11-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.9281
2367	7200	توزيع أرباح نقدية	2019-10-16	2019-11-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.928309
2368	3008	تحويل الشركة من سوق ﻵخر	2019-10-15	2019-11-03	\N	\N	\N	SAR	نقل أسهم الشركة إلى سوق آخر اعتبار من 2019-11-03	2025-12-25 15:06:17.928527
2369	1303	شراء اسهم خزينة	2019-10-31	2019-10-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 7100 سهم خزينة بينما كانت قد استهدفت شراء 500000	2025-12-25 15:06:17.92879
2370	7010	توزيع أرباح نقدية	2019-10-22	2019-10-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.928986
2371	1303	شراء اسهم خزينة	2019-04-25	2019-10-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 11000 سهم خزينة بينما كانت قد استهدفت شراء 500000	2025-12-25 15:06:17.929175
2372	4340	زيادة رأس مال - اكتتاب خاص	2019-03-31	2019-10-30	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:17.929396
2373	4340	زيادة رأس مال - إصدار حقوق أولوية	2019-03-31	2019-10-30	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:17.929605
2374	4336	توزيع أرباح نقدية	2019-10-16	2019-10-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.9298
2375	2330	توزيع أرباح نقدية	2019-10-13	2019-10-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.930011
2376	4342	توزيع أرباح نقدية	2019-10-09	2019-10-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.93032
2377	4339	توزيع أرباح نقدية	2019-10-01	2019-10-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.93065
2378	2080	توزيع أرباح نقدية	2019-05-16	2019-10-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.931035
2379	2080	توزيع أرباح نقدية	2019-05-16	2019-10-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.931471
2380	4333	توزيع أرباح نقدية	2019-10-09	2019-10-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.932075
2381	4030	توزيع أرباح نقدية	2019-09-29	2019-10-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.932329
2382	6002	توزيع أرباح نقدية	2019-09-12	2019-10-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.932536
2383	4344	توزيع أرباح نقدية	2019-10-01	2019-10-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.932736
2384	3060	توزيع أرباح نقدية	2019-08-06	2019-10-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.933322
2385	2310	توزيع أرباح نقدية	2019-09-26	2019-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.933663
2386	1831	توزيع أرباح نقدية	2019-09-16	2019-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.933886
2387	3050	توزيع أرباح نقدية	2019-08-05	2019-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.934252
2388	4280	توزيع أرباح نقدية	2019-03-28	2019-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.934636
2389	8140	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-03-13	2019-09-19	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:17.934871
2390	2230	تغيير نظام الشركة	2019-09-18	2019-09-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.93508
2391	2330	تغيير نظام الشركة	2019-09-18	2019-09-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:17.935385
2392	2230	تغيير اسم الشركة	2019-09-18	2019-09-18	\N	\N	\N	SAR	تم تعديل اسم الشركة من CHEMICAL إلى CHEMICAL	2025-12-25 15:06:17.935666
2393	2330	توزيع أسهم خزينة كأسهم منحة	2019-05-26	2019-09-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:17.935873
2394	2230	توزيع أسهم خزينة كأسهم منحة	2019-03-28	2019-09-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:17.942442
2395	2010	توزيع أرباح نقدية	2019-05-23	2019-09-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.942756
2396	1830	توزيع أرباح نقدية	2019-09-04	2019-09-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.943026
2397	4150	توزيع أرباح نقدية	2019-07-17	2019-09-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:17.943243
2398	6013	زيادة رأس المال المصرح به	2019-04-10	2019-09-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  12500000 إلى  25000000	2025-12-25 15:06:17.943454
2399	6013	توزيع أسهم خزينة كأسهم منحة	2019-04-10	2019-09-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:17.943699
2400	2160	تخفيض رأس المال المصرح به	2019-08-04	2019-09-09	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  1155000000 الى  34451700	2025-12-25 15:06:17.94391
2401	2160	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-08-04	2019-09-09	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:18.44079
2402	8210	شراء اسهم خزينة	2019-09-03	2019-09-03	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 169460 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:18.441402
2403	3005	توزيع أرباح نقدية	2019-08-01	2019-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.441674
2404	4008	توزيع أرباح نقدية	2019-07-23	2019-09-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.441909
2405	1213	تخفيض رأس المال المصرح به	2019-07-25	2019-08-29	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  22550000 الى  65500000	2025-12-25 15:06:18.442168
2406	1213	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-07-25	2019-08-29	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:18.442424
2407	4190	توزيع أرباح نقدية	2019-08-06	2019-08-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.442631
2408	4330	توزيع أرباح نقدية	2019-08-20	2019-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.442832
2409	6004	توزيع أرباح نقدية	2019-08-07	2019-08-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.443102
2410	4191	توزيع أرباح نقدية	2019-06-30	2019-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.443364
2411	4191	توزيع أسهم خزينة كأسهم منحة	2019-02-20	2019-08-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:18.443627
2412	4191	زيادة رأس المال المصرح به	2019-02-20	2019-08-22	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  160000000 إلى  200000000	2025-12-25 15:06:18.443847
2413	1060	توزيع أرباح نقدية	2019-08-05	2019-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.444064
2414	4348	توزيع أرباح نقدية	2019-07-31	2019-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.444298
2415	2080	توزيع أرباح نقدية	2019-05-16	2019-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.44932
2416	2080	توزيع أرباح نقدية	2019-05-16	2019-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.449515
2417	4180	توزيع أرباح نقدية	2019-08-05	2019-08-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.449719
2418	3040	توزيع أرباح نقدية	2019-08-05	2019-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.44993
2419	4090	توزيع أرباح نقدية	2019-08-04	2019-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.450129
2420	4031	توزيع أرباح نقدية	2019-07-31	2019-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.450319
2421	3010	توزيع أرباح نقدية	2019-08-04	2019-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.450505
2422	6001	توزيع أسهم خزينة كأسهم منحة	2019-03-24	2019-08-06	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:18.450672
2423	1020	توزيع أرباح نقدية	2019-08-01	2019-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.450838
2424	6070	توزيع أرباح نقدية	2019-07-30	2019-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.451008
2425	1180	توزيع أرباح نقدية	2019-07-29	2019-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.45121
2426	4338	توزيع أرباح نقدية	2019-07-29	2019-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.451378
2427	4340	توزيع أرباح نقدية	2019-07-23	2019-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.451552
2428	1090	توزيع أرباح نقدية	2019-07-30	2019-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.452889
2429	7010	توزيع أرباح نقدية	2019-07-22	2019-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.453086
2430	4012	توزيع أرباح نقدية	2019-07-22	2019-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.453294
2431	1140	توزيع أرباح نقدية	2019-07-21	2019-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.453465
2432	4346	توزيع أرباح نقدية	2019-07-11	2019-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.453642
2433	1120	توزيع أرباح نقدية	2019-07-21	2019-07-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.454277
2434	1301	توزيع أرباح نقدية	2019-07-18	2019-07-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.454439
2435	4003	توزيع أرباح نقدية	2019-07-09	2019-07-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.454606
2436	4336	توزيع أرباح نقدية	2019-07-16	2019-07-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.454768
2437	4332	توزيع أرباح نقدية	2019-07-10	2019-07-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.455381
2438	2020	توزيع أرباح نقدية	2019-05-19	2019-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.45556
2439	4342	توزيع أرباح نقدية	2019-07-08	2019-07-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.455743
2440	4339	توزيع أرباح نقدية	2019-07-01	2019-07-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.455909
2441	1010	توزيع أرباح نقدية	2019-07-07	2019-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.456085
2442	1050	توزيع أرباح نقدية	2019-07-03	2019-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.456249
2443	4333	توزيع أرباح نقدية	2019-07-08	2019-07-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.456413
2444	1080	توزيع أرباح نقدية	2019-07-04	2019-07-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.456574
2445	4337	توزيع أرباح نقدية	2019-07-02	2019-07-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.456779
2446	2290	توزيع أرباح نقدية	2019-05-12	2019-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.45695
2447	4344	توزيع أرباح نقدية	2019-06-25	2019-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.457135
2448	2330	توزيع أرباح نقدية	2019-05-26	2019-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.457306
2449	8210	توزيع أرباح نقدية	2019-04-30	2019-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.457477
2450	2250	توزيع أرباح نقدية	2019-04-09	2019-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.45767
2451	4280	توزيع أرباح نقدية	2019-03-28	2019-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.457914
2452	1060	شراء اسهم خزينة	2019-06-30	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 881182 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:18.458164
2453	1090	بيع أسهم خزينة	2019-06-30	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 170862 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:18.458408
2454	1810	شراء اسهم خزينة	2019-06-30	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 6490000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:18.458654
2455	2280	بيع أسهم خزينة	2019-06-30	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 357061 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:18.458922
2456	2310	بيع أسهم خزينة	2019-06-30	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 397021 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:18.459219
2457	2380	بيع أسهم خزينة	2019-06-30	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 7200 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:18.459515
2458	8210	بيع أسهم خزينة	2019-06-30	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 54598 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:18.459819
2459	4335	توزيع أرباح نقدية	2019-06-23	2019-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.460083
2460	2040	شراء اسهم خزينة	2019-01-23	2019-06-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 103000 سهم خزينة بينما كانت قد استهدفت شراء 500000	2025-12-25 15:06:18.460304
2461	4331	توزيع أرباح نقدية	2019-06-23	2019-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.46053
2462	6012	تغيير اسم الشركة	2019-05-23	2019-06-20	\N	\N	\N	SAR	تم تعديل اسم الشركة من RAYDAN إلى RAYDAN	2025-12-25 15:06:18.460773
2463	8170	توزيع أسهم خزينة كأسهم منحة	2019-02-20	2019-06-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:18.460977
2464	6012	تغيير نظام الشركة	2019-05-23	2019-06-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.46122
2465	4090	توزيع أرباح نقدية	2019-06-12	2019-06-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.461477
2466	1202	تغيير نظام الشركة	2019-05-21	2019-06-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.461743
2467	6004	توزيع أرباح نقدية	2019-05-12	2019-06-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.461991
2468	1060	زيادة رأس مال - اكتتاب خاص	2019-03-11	2019-06-17	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:18.462223
2469	1040	إلغاء الإدراج	2018-06-16	2019-06-17	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2019-06-17	2025-12-25 15:06:18.462456
2470	3030	توزيع أرباح نقدية	2019-05-29	2019-06-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.462701
2471	2270	توزيع أرباح نقدية	2019-05-09	2019-06-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.462946
2472	3060	توزيع أرباح نقدية	2019-03-19	2019-06-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.463204
2473	1030	شراء اسهم خزينة	2019-03-07	2019-05-28	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 18749860 سهم خزينة بينما كانت قد استهدفت شراء 18749860	2025-12-25 15:06:18.463645
2474	4004	شراء اسهم خزينة	2019-02-03	2019-05-27	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 3740000 سهم خزينة بينما كانت قد استهدفت شراء 3750000	2025-12-25 15:06:18.463834
2475	4110	تغيير نظام الشركة	2019-04-24	2019-05-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.464067
2476	4012	توزيع أرباح نقدية	2019-02-24	2019-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.464287
2477	8060	توزيع أرباح نقدية	2019-04-09	2019-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.464529
2478	8060	توزيع أسهم خزينة كأسهم منحة	2019-04-09	2019-05-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:18.464811
2479	4190	توزيع أرباح نقدية	2019-05-01	2019-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.465055
2480	1830	توزيع أرباح نقدية	2019-05-13	2019-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.465312
2481	3007	توزيع أرباح نقدية	2019-03-19	2019-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.465552
2482	2260	إلغاء الإدراج	2018-10-03	2019-05-20	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2019-05-20	2025-12-25 15:06:18.465884
2483	2310	تغيير نظام الشركة	2019-05-19	2019-05-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.466177
2484	2310	زيادة رأس المال المصرح به	2019-05-19	2019-05-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  7333333320	2025-12-25 15:06:18.466497
2485	3007	تغيير نظام الشركة	2019-05-19	2019-05-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.46684
2486	2310	تغيير اسم الشركة	2019-03-07	2019-05-19	\N	\N	\N	SAR	تم تعديل اسم الشركة من Sipchem إلى SIPCHEM	2025-12-25 15:06:18.467144
2487	2310	زيادة رأس مال - اكتتاب خاص	2018-10-03	2019-05-19	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:18.467451
2488	2080	توزيع أرباح نقدية	2019-03-18	2019-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.467789
2489	2080	توزيع أرباح نقدية	2019-03-18	2019-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.468069
2490	1060	تغيير نظام الشركة	2019-03-11	2019-05-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.468365
2491	1060	زيادة رأس المال المصرح به	2019-03-11	2019-05-16	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  20547945220	2025-12-25 15:06:18.46865
2492	4090	تغيير اسم الشركة	2019-04-21	2019-05-15	\N	\N	\N	SAR	تم تعديل اسم الشركة من Taiba إلى TAIBA	2025-12-25 15:06:18.46897
2493	4010	توزيع أرباح نقدية	2019-03-14	2019-05-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.469295
2494	1832	توزيع أرباح نقدية	2018-12-10	2019-05-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.469615
2495	2190	توزيع أرباح نقدية	2019-02-26	2019-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.469884
2496	7010	توزيع أرباح نقدية	2019-04-22	2019-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.470138
2497	4150	تغيير نظام الشركة	2019-04-21	2019-05-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.470424
2498	4250	تغيير نظام الشركة	2019-04-04	2019-05-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.470689
2499	4150	زيادة رأس المال المصرح به	2019-02-24	2019-05-05	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1333333330 إلى  1777777770	2025-12-25 15:06:18.47095
2500	4150	توزيع أرباح نقدية	2019-02-24	2019-05-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.471309
2501	4150	توزيع أسهم خزينة كأسهم منحة	2019-02-24	2019-05-05	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:18.996796
2502	4347	توزيع أرباح نقدية	2019-04-25	2019-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.997347
2503	1050	تغيير نظام الشركة	2019-04-09	2019-05-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.997563
2504	4100	توزيع أرباح نقدية	2019-03-25	2019-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.9978
2505	1050	توزيع أرباح نقدية	2018-12-27	2019-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.997983
2506	3080	توزيع أرباح نقدية	2019-03-19	2019-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.998151
2507	5110	توزيع أرباح نقدية	2019-03-13	2019-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.998363
2508	6002	توزيع أرباح نقدية	2019-03-12	2019-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.99854
2509	2120	تغيير نظام الشركة	2019-03-24	2019-04-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.998705
2510	4320	تغيير نظام الشركة	2019-04-07	2019-04-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.999514
2511	4290	تغيير نظام الشركة	2019-03-31	2019-04-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:18.999685
2512	4320	توزيع أرباح نقدية	2019-03-20	2019-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:18.99991
2513	3040	توزيع أرباح نقدية	2019-04-23	2019-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.000163
2514	7040	تغيير نظام الشركة	2019-04-03	2019-04-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.000428
2515	7010	تغيير نظام الشركة	2019-04-03	2019-04-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.000661
2516	4031	توزيع أرباح نقدية	2019-03-28	2019-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.00098
2517	7040	تخفيض رأس المال المصرح به	2019-03-24	2019-04-25	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  472500000 الى  350529000	2025-12-25 15:06:19.001234
2518	7040	تخفيض رأس مال - بتخفيض عدد الأسهم	2019-03-24	2019-04-25	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:19.001537
2519	2030	توزيع أرباح نقدية	2019-03-07	2019-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.001764
2520	7010	توزيع أرباح نقدية	2018-12-16	2019-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.00201
2521	7010	توزيع أرباح نقدية	2018-12-16	2019-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.002283
2522	3008	تغيير نظام الشركة	2019-03-26	2019-04-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.002585
2523	4005	توزيع أرباح نقدية	2019-03-24	2019-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.002849
2524	3008	توزيع أسهم خزينة كأسهم منحة	2019-03-06	2019-04-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.003165
2525	3008	زيادة رأس المال المصرح به	2019-03-06	2019-04-24	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  37674000 إلى  45208800	2025-12-25 15:06:19.00342
2526	4050	تغيير نظام الشركة	2019-03-27	2019-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.003663
2527	4050	توزيع أرباح نقدية	2019-03-20	2019-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.003836
2528	4002	توزيع أرباح نقدية	2019-02-25	2019-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.004001
2529	4336	توزيع أرباح نقدية	2019-04-16	2019-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.004159
2530	4003	توزيع أرباح نقدية	2019-04-09	2019-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.004317
2531	1212	تغيير نظام الشركة	2019-03-26	2019-04-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.004474
2532	4180	توزيع أرباح نقدية	2019-03-20	2019-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.004718
2533	4051	توزيع أرباح نقدية	2019-03-14	2019-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.004911
2534	3050	توزيع أرباح نقدية	2019-03-07	2019-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.005105
2535	4001	توزيع أرباح نقدية	2019-03-06	2019-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.005294
2536	4260	توزيع أرباح نقدية	2019-02-03	2019-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.005462
2537	4342	توزيع أرباح نقدية	2019-04-10	2019-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.005629
2538	1020	تغيير نظام الشركة	2019-03-26	2019-04-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.005838
2539	3030	توزيع أرباح نقدية	2019-02-06	2019-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.006018
2540	1020	توزيع أرباح نقدية	2019-01-06	2019-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.006191
2541	2150	توزيع أرباح نقدية	2019-04-09	2019-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.006353
2542	4339	توزيع أرباح نقدية	2019-04-01	2019-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.006514
2543	2260	تغيير نظام الشركة	2019-03-25	2019-04-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.006674
2544	4333	توزيع أرباح نقدية	2019-04-10	2019-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.006834
2545	1810	تغيير نظام الشركة	2019-03-24	2019-04-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.007016
2546	1810	تغيير اسم الشركة	2019-03-24	2019-04-15	\N	\N	\N	SAR	تم تعديل اسم الشركة من ALTAYYAR إلى SEERA	2025-12-25 15:06:19.007187
2547	1810	زيادة رأس المال المصرح به	2019-03-04	2019-04-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  2096500000 إلى  3000000000	2025-12-25 15:06:19.008285
2548	1810	زيادة رأس مال - اكتتاب خاص	2019-03-04	2019-04-15	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:19.008723
2549	1810	توزيع أسهم خزينة كأسهم منحة	2019-02-28	2019-04-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.008936
2550	4030	توزيع أرباح نقدية	2018-12-11	2019-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.009133
2551	2320	توزيع أرباح نقدية	2019-03-24	2019-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.009349
2552	6070	تغيير نظام الشركة	2019-03-19	2019-04-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.009565
2553	6070	توزيع أرباح نقدية	2019-03-06	2019-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.009801
2554	1180	توزيع أرباح نقدية	2018-12-23	2019-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.009985
2555	4090	تغيير نظام الشركة	2019-03-19	2019-04-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.010172
2556	1140	تغيير نظام الشركة	2019-03-18	2019-04-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.010354
2557	2090	توزيع أرباح نقدية	2019-03-14	2019-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.010533
2558	4090	توزيع أرباح نقدية	2019-03-07	2019-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.010709
2559	2010	توزيع أرباح نقدية	2018-12-19	2019-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.010882
2560	1140	توزيع أسهم خزينة كأسهم منحة	2018-12-17	2019-04-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.011053
2561	1140	زيادة رأس المال المصرح به	2018-12-17	2019-04-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  750000000	2025-12-25 15:06:19.011225
2562	4090	زيادة رأس مال - اكتتاب خاص	2017-12-27	2019-04-10	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:19.011403
2563	2250	تغيير نظام الشركة	2019-03-14	2019-04-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.011576
2564	3010	تغيير نظام الشركة	2019-03-14	2019-04-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.011744
2565	2280	تغيير نظام الشركة	2019-03-13	2019-04-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.011904
2566	2020	تغيير نظام الشركة	2019-03-12	2019-04-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.01207
2567	3010	توزيع أرباح نقدية	2019-03-03	2019-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.012231
2568	2002	توزيع أرباح نقدية	2019-02-26	2019-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.012387
2569	2020	توزيع أرباح نقدية	2018-12-17	2019-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.012543
2570	2280	توزيع أرباح نقدية	2018-12-10	2019-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.012699
2571	3003	توزيع أرباح نقدية	2019-03-03	2019-04-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.012857
2572	2290	توزيع أرباح نقدية	2018-12-20	2019-04-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.013019
2573	4008	توزيع أرباح نقدية	2019-02-27	2019-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.013175
2574	1120	توزيع أرباح نقدية	2019-01-06	2019-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.013333
2575	1120	توزيع أسهم خزينة كأسهم منحة	2019-01-06	2019-04-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.013487
2576	2070	توزيع أرباح نقدية	2019-03-05	2019-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.013647
2577	2360	تغيير نظام الشركة	2019-03-05	2019-04-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.013805
2578	3020	تغيير نظام الشركة	2019-02-27	2019-04-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.013962
2579	1060	توزيع أرباح نقدية	2018-12-27	2019-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.014119
2580	4280	توزيع أرباح نقدية	2019-03-28	2019-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.014275
2581	4344	توزيع أرباح نقدية	2019-03-27	2019-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.014456
2582	2330	توزيع أرباح نقدية	2019-03-20	2019-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.014623
2583	1040	بيع أسهم خزينة	2019-03-31	2019-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 1148884 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.014786
2584	1050	بيع أسهم خزينة	2019-03-31	2019-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 321721 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.015826
2585	1180	بيع أسهم خزينة	2019-03-31	2019-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 3981404 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.016138
2586	2280	بيع أسهم خزينة	2019-03-31	2019-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 475872 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.016442
2587	2380	بيع أسهم خزينة	2019-03-31	2019-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 76800 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.016747
2588	8210	بيع أسهم خزينة	2019-03-31	2019-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 47675 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.017054
2589	2270	شراء اسهم خزينة	2018-11-12	2019-03-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 500250 سهم خزينة بينما كانت قد استهدفت شراء 3250000	2025-12-25 15:06:19.017351
2590	2340	توزيع أرباح نقدية	2019-02-28	2019-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.017696
2591	1080	توزيع أسهم خزينة كأسهم منحة	2018-12-24	2019-03-28	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.018006
2592	1080	توزيع أرباح نقدية	2018-12-24	2019-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.018363
2593	1080	زيادة رأس المال المصرح به	2018-12-24	2019-03-28	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  15000000000	2025-12-25 15:06:19.018728
2594	1150	توزيع أرباح نقدية	2018-12-02	2019-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.019046
2595	1090	توزيع أرباح نقدية	2018-12-27	2019-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.019391
2596	6004	توزيع أرباح نقدية	2019-02-27	2019-03-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.019744
2597	2330	توزيع أرباح نقدية	2018-12-18	2019-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.020038
2598	1010	توزيع أرباح نقدية	2018-12-13	2019-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.020333
2599	4190	توزيع أرباح نقدية	2019-03-11	2019-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.02061
2600	1304	تغيير نظام الشركة	2019-02-21	2019-03-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.020919
2601	4200	تغيير نظام الشركة	2019-02-14	2019-03-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.53762
2602	4200	زيادة رأس المال المصرح به	2019-01-17	2019-03-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  500000000 إلى  600000000	2025-12-25 15:06:19.538204
2603	4200	توزيع أسهم خزينة كأسهم منحة	2019-01-17	2019-03-19	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.538468
2604	4200	توزيع أرباح نقدية	2019-01-17	2019-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.538739
2605	4345	توزيع أرباح نقدية	2019-03-11	2019-03-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.539604
2606	4330	توزيع أرباح نقدية	2019-03-06	2019-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.539848
2607	4334	توزيع أرباح نقدية	2019-03-05	2019-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.540091
2608	1202	توزيع أرباح نقدية	2019-03-10	2019-03-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.540343
2609	1211	تغيير نظام الشركة	2019-02-17	2019-03-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.5406
2610	1830	توزيع أرباح نقدية	2019-02-27	2019-03-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.540966
2611	2120	توزيع أرباح نقدية	2018-12-30	2019-03-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.541272
2612	4004	توزيع أسهم خزينة كأسهم منحة	2018-12-13	2019-02-27	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.541598
2613	4332	توزيع أرباح نقدية	2019-02-18	2019-02-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.541926
2614	4291	توزيع أرباح نقدية	2018-11-29	2019-02-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.542243
2615	4342	توزيع أرباح نقدية	2019-02-12	2019-02-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.542544
2616	4338	توزيع أرباح نقدية	2019-02-13	2019-02-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.54284
2617	4340	توزيع أرباح نقدية	2019-02-11	2019-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.543059
2618	8310	تغيير نظام الشركة	2018-12-04	2019-01-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.543354
2619	8310	زيادة رأس مال - إصدار حقوق أولوية	2016-09-07	2019-01-29	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:19.545132
2620	8310	زيادة رأس المال المصرح به	2016-09-07	2019-01-29	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  140000000 إلى  240000000	2025-12-25 15:06:19.545314
2621	7204	تغيير اسم الشركة	2019-01-24	2019-01-27	\N	\N	\N	SAR	تم تعديل اسم الشركة من ENBD REIT إلى ENBD REIT	2025-12-25 15:06:19.545491
2622	4336	توزيع أرباح نقدية	2019-01-16	2019-01-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.545661
2623	2260	توزيع أرباح نقدية	2018-12-05	2019-01-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.545831
2624	2340	تغيير نظام الشركة	2018-12-10	2019-01-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.546001
2625	4333	توزيع أرباح نقدية	2019-01-13	2019-01-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.546172
2626	8270	توزيع أسهم خزينة كأسهم منحة	2018-06-04	2019-01-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.546339
2627	8270	تغيير نظام الشركة	2018-06-04	2019-01-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.546511
2628	8270	زيادة رأس المال المصرح به	2018-06-04	2019-01-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  250000000 إلى  300000000	2025-12-25 15:06:19.546678
2629	4337	توزيع أرباح نقدية	2019-01-02	2019-01-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.546846
2630	8170	تغيير اسم الشركة	2018-04-04	2019-01-03	\N	\N	\N	SAR	تم تعديل اسم الشركة من Trade Union إلى ALETIHAD	2025-12-25 15:06:19.547013
2631	2310	توزيع أرباح نقدية	2018-12-24	2019-01-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.547182
2632	4344	توزيع أرباح نقدية	2018-12-27	2019-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.547394
2633	4335	توزيع أرباح نقدية	2018-12-26	2019-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.547563
2634	2250	توزيع أرباح نقدية	2018-10-28	2019-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.547752
2635	4280	توزيع أرباح نقدية	2018-03-29	2019-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.547924
2636	4339	توزيع أرباح نقدية	2018-03-27	2019-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.548136
2637	1030	بيع أسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 4941829 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.548483
2638	1140	بيع أسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 495675 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.548707
2639	2310	بيع أسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 107753 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.548901
2640	2380	بيع أسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 8000 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.549099
2641	6050	بيع أسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من بيع 50 سهم خزينة بينما كانت قد استهدفت بيع null	2025-12-25 15:06:19.549288
2642	2280	شراء اسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1114138 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:19.549481
2643	4180	شراء اسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 638 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:19.549692
2644	8210	شراء اسهم خزينة	2018-12-31	2018-12-31	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 152811 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:19.54991
2645	3040	توزيع أرباح نقدية	2018-12-27	2018-12-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.5501
2646	3040	تغيير نظام الشركة	2018-11-29	2018-12-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.550291
2647	6050	تغيير نظام الشركة	2018-11-26	2018-12-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.550479
2648	6050	تخفيض رأس المال المصرح به	2018-05-24	2018-12-27	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  200000000 الى  101100000	2025-12-25 15:06:19.550673
2649	6050	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-05-24	2018-12-27	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:19.550857
2650	1302	تغيير نظام الشركة	2018-11-29	2018-12-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.551043
2651	4337	تغيير نظام الشركة	2018-12-04	2018-12-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.551229
2652	4004	توزيع أرباح نقدية	2018-12-13	2018-12-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.55141
2653	6004	توزيع أرباح نقدية	2018-11-07	2018-12-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.551597
2654	2270	تغيير نظام الشركة	2018-11-21	2018-12-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.551833
2655	4008	تغيير نظام الشركة	2018-11-21	2018-12-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.552353
2656	6004	تغيير نظام الشركة	2018-11-15	2018-12-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.552753
2657	4008	زيادة رأس المال المصرح به	2018-10-24	2018-12-18	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  240000000 إلى  360000000	2025-12-25 15:06:19.553103
2658	4008	توزيع أسهم خزينة كأسهم منحة	2018-10-24	2018-12-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.553324
2659	8311	تغيير نظام الشركة	2018-11-21	2018-12-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.553571
2660	8311	زيادة رأس المال المصرح به	2017-12-14	2018-12-13	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  100000000 إلى  300000000	2025-12-25 15:06:19.55378
2661	8311	زيادة رأس مال - إصدار حقوق أولوية	2017-12-14	2018-12-13	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:19.553968
2662	4012	توزيع أرباح نقدية	2018-10-29	2018-12-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.554153
2663	1830	تغيير نظام الشركة	2018-11-15	2018-12-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.55437
2664	2080	توزيع أرباح نقدية	2018-05-13	2018-12-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.554553
2665	4347	توزيع أرباح نقدية	2018-11-29	2018-12-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.554763
2666	2270	توزيع أرباح نقدية	2018-11-28	2018-12-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.554965
2667	2230	توزيع أرباح نقدية	2018-09-09	2018-12-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.555155
2668	7020	تغيير نظام الشركة	2018-11-07	2018-11-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.556182
2669	8210	تغيير نظام الشركة	2018-11-01	2018-11-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.556791
2670	8210	توزيع أسهم خزينة كأسهم منحة	2018-04-15	2018-11-25	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.557552
2671	8210	زيادة رأس المال المصرح به	2018-04-15	2018-11-25	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  800000000 إلى  1200000000	2025-12-25 15:06:19.558054
2672	2320	توزيع أرباح نقدية	2018-11-07	2018-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.55865
2673	3040	توزيع أرباح نقدية	2018-11-08	2018-11-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.559217
2674	4180	توزيع أرباح نقدية	2018-11-07	2018-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.559845
2675	4190	توزيع أرباح نقدية	2018-11-04	2018-11-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.560424
2676	4090	توزيع أرباح نقدية	2018-11-05	2018-11-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.561041
2677	2370	تخفيض رأس المال المصرح به	2018-07-24	2018-11-05	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  600000000 الى  400000000	2025-12-25 15:06:19.562013
2678	2370	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-07-24	2018-11-05	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:19.562719
2679	1202	توزيع أرباح نقدية	2018-10-30	2018-11-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.563391
2680	1830	توزيع أرباح نقدية	2018-10-28	2018-11-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.563932
2681	7010	توزيع أرباح نقدية	2018-10-24	2018-10-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.564635
2682	4342	توزيع أرباح نقدية	2018-10-22	2018-10-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.565257
2683	4190	تغيير نظام الشركة	2018-09-26	2018-10-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.565799
2684	4190	توزيع أسهم خزينة كأسهم منحة	2018-08-08	2018-10-29	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:19.566382
2685	4190	زيادة رأس المال المصرح به	2018-08-08	2018-10-29	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  900000000 إلى  1200000000	2025-12-25 15:06:19.566931
2686	4344	توزيع أرباح نقدية	2018-10-17	2018-10-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.567611
2687	2380	تغيير نظام الشركة	2018-10-01	2018-10-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.568415
2688	4336	توزيع أرباح نقدية	2018-10-16	2018-10-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.569016
2689	3060	توزيع أرباح نقدية	2018-07-22	2018-10-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.569714
2690	2080	توزيع أرباح نقدية	2018-05-13	2018-10-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.570366
2691	2170	تغيير نظام الشركة	2018-09-19	2018-10-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.570942
2692	4140	تغيير نظام الشركة	2018-08-06	2018-10-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.571357
2693	4140	زيادة رأس مال - إصدار حقوق أولوية	2017-11-19	2018-10-10	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:19.571893
2694	4140	زيادة رأس المال المصرح به	2017-11-19	2018-10-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  10800000 إلى  64800000	2025-12-25 15:06:19.572481
2695	6070	تغيير نظام الشركة	2018-09-09	2018-10-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.573086
2696	2330	توزيع أرباح نقدية	2018-09-26	2018-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.573517
2697	4339	توزيع أرباح نقدية	2018-09-12	2018-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.57382
2698	2180	تغيير نظام الشركة	2018-09-06	2018-10-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:19.574289
2699	3050	توزيع أرباح نقدية	2018-08-08	2018-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.574763
2700	4280	توزيع أرباح نقدية	2018-03-29	2018-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:19.57525
2701	1040	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 5037687 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.101342
2702	1060	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 176194 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.102294
2703	1090	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 42913419 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.102748
2704	1202	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 300000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.103134
2705	1030	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 4941829 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.103509
2706	1050	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 6000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.103896
2707	1140	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 4463147 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.104283
2708	1150	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 10032556 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.10466
2709	1180	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 10590589 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.105447
2710	1320	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 457689 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.10646
2711	2090	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2138 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.107122
2712	2160	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 1935691 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.107707
2713	2210	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 165406 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.108351
2714	2280	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 11255678 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.108926
2715	2310	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 735554 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.109427
2716	2330	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 695152 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.110062
2717	2380	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 291863 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.11059
3022	1140	توزيع أرباح نقدية	2017-09-26	2017-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.940776
2718	6050	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 100 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.111189
2719	8030	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 158 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.11181
2720	8210	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 305623 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.112374
2721	3080	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 8398 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.113008
2722	4003	شراء اسهم خزينة	2018-09-30	2018-09-30	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2000000 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.113441
2723	1030	شراء اسهم خزينة	2018-06-24	2018-09-27	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 56245350 سهم خزينة بينما كانت قد استهدفت شراء null	2025-12-25 15:06:20.114071
2724	4333	توزيع أرباح نقدية	2018-09-19	2018-09-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.114381
2725	4003	تغيير نظام الشركة	2018-08-02	2018-09-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.114915
2726	4003	زيادة رأس مال - اكتتاب خاص	2018-06-07	2018-09-19	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:20.115406
2727	4003	زيادة رأس المال المصرح به	2018-06-07	2018-09-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  500000000 إلى  420000000	2025-12-25 15:06:20.115919
2728	4003	توزيع أسهم خزينة كأسهم منحة	2018-06-07	2018-09-19	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.1164
2729	4002	تغيير نظام الشركة	2018-07-19	2018-09-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.116971
2730	6004	توزيع أرباح نقدية	2018-08-05	2018-09-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.117564
2731	4010	تغيير نظام الشركة	2018-08-13	2018-09-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.118056
2732	2300	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-04-10	2018-09-11	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:20.118809
2733	2300	تخفيض رأس المال المصرح به	2018-04-10	2018-09-11	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  450000000 الى  245000000	2025-12-25 15:06:20.119402
2734	2300	تغيير نظام الشركة	2018-04-10	2018-09-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.11981
2735	8030	تغيير نظام الشركة	2018-02-08	2018-09-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.120298
2736	8030	زيادة رأس مال - إصدار حقوق أولوية	2018-02-08	2018-09-11	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:20.120782
2737	8030	زيادة رأس المال المصرح به	2018-02-08	2018-09-11	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  400000000 إلى  800000000	2025-12-25 15:06:20.121334
2738	4191	توزيع أرباح نقدية	2018-07-30	2018-09-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.121831
2739	4008	توزيع أرباح نقدية	2018-07-23	2018-09-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.122505
2740	4333	زيادة رأس مال - اكتتاب خاص	2017-12-28	2018-09-04	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:20.122979
2741	2110	تغيير نظام الشركة	2018-08-16	2018-09-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.123629
2742	2110	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-08-02	2018-09-03	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:20.124063
2743	2110	تخفيض رأس المال المصرح به	2018-08-02	2018-09-03	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  404114000 الى  110614060	2025-12-25 15:06:20.124701
2744	2070	توزيع أرباح نقدية	2018-07-31	2018-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.126505
2745	2010	توزيع أرباح نقدية	2018-06-05	2018-09-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.126848
2746	4335	توزيع أرباح نقدية	2018-08-13	2018-08-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.127127
2747	6002	توزيع أرباح نقدية	2018-07-30	2018-08-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.127468
2748	4190	توزيع أرباح نقدية	2018-08-08	2018-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.127944
2749	2260	توزيع أرباح نقدية	2018-08-12	2018-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.128507
2750	3008	تغيير نظام الشركة	2018-07-26	2018-08-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.129193
2751	3008	توزيع أسهم خزينة كأسهم منحة	2018-04-08	2018-08-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.129825
2752	3008	زيادة رأس المال المصرح به	2018-04-08	2018-08-26	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  31395000 إلى  37674000	2025-12-25 15:06:20.130312
2753	4010	توزيع أرباح نقدية	2018-08-08	2018-08-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.130978
2754	3040	توزيع أرباح نقدية	2018-08-07	2018-08-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.13164
2755	4090	توزيع أرباح نقدية	2018-08-02	2018-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.132271
2756	4330	توزيع أرباح نقدية	2018-08-02	2018-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.132787
2757	4344	توزيع أرباح نقدية	2018-08-02	2018-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.133209
2758	4338	توزيع أرباح نقدية	2018-08-01	2018-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.133631
2759	1180	توزيع أرباح نقدية	2018-07-30	2018-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.13414
2760	1060	توزيع أرباح نقدية	2018-07-24	2018-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.134765
2761	2310	توزيع أرباح نقدية	2018-07-26	2018-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.135197
2762	2080	توزيع أرباح نقدية	2018-05-13	2018-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.135932
2763	7010	توزيع أرباح نقدية	2018-07-26	2018-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.136518
2764	4150	توزيع أرباح نقدية	2018-07-15	2018-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.137192
2765	8180	تغيير نظام الشركة	2018-04-30	2018-07-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.137738
2766	8180	زيادة رأس المال المصرح به	2018-04-30	2018-07-30	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  250000000 إلى  400000000	2025-12-25 15:06:20.138255
2767	8180	توزيع أسهم خزينة كأسهم منحة	2018-04-30	2018-07-30	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.138838
2768	4332	توزيع أرباح نقدية	2018-07-23	2018-07-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.139179
2769	4342	توزيع أرباح نقدية	2018-07-23	2018-07-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.139541
2770	4331	توزيع أرباح نقدية	2018-07-17	2018-07-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.139971
2771	6013	تغيير نظام الشركة	2018-07-04	2018-07-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.140549
2772	2020	توزيع أرباح نقدية	2018-06-10	2018-07-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.141066
2773	4336	توزيع أرباح نقدية	2018-07-16	2018-07-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.141578
2774	4340	توزيع أرباح نقدية	2018-07-15	2018-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.142073
2775	1120	توزيع أرباح نقدية	2018-07-15	2018-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.142626
2776	4031	توزيع أرباح نقدية	2018-07-11	2018-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.143129
2777	4333	توزيع أرباح نقدية	2018-07-16	2018-07-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.143599
2778	4003	توزيع أرباح نقدية	2018-07-09	2018-07-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.144149
2779	1050	توزيع أرباح نقدية	2018-07-01	2018-07-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.144613
2780	1010	توزيع أرباح نقدية	2018-07-04	2018-07-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.145374
2781	1090	توزيع أرباح نقدية	2018-07-02	2018-07-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.146015
2782	1080	توزيع أرباح نقدية	2018-07-01	2018-07-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.146554
2783	4012	توزيع أسهم خزينة كأسهم منحة	2018-02-28	2018-07-05	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.148012
2784	4012	تغيير نظام الشركة	2018-07-04	2018-07-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.148354
2785	2270	تغيير نظام الشركة	2018-05-31	2018-07-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.148577
2786	2290	توزيع أرباح نقدية	2018-05-27	2018-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.148783
2787	2270	توزيع أرباح نقدية	2018-04-23	2018-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.148981
2788	4337	توزيع أرباح نقدية	2018-07-01	2018-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.149194
2789	4280	توزيع أرباح نقدية	2018-03-29	2018-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.149402
2790	2330	توزيع أرباح نقدية	2018-06-10	2018-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.149667
2791	4020	تغيير نظام الشركة	2018-06-03	2018-07-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.14987
2792	4020	توزيع أسهم خزينة كأسهم منحة	2018-05-09	2018-07-01	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.150157
2793	4020	توزيع أرباح نقدية	2018-05-09	2018-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.150378
2794	4020	زيادة رأس المال المصرح به	2018-05-09	2018-07-01	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1200000000 إلى  2400000000	2025-12-25 15:06:20.150695
2795	8180	توزيع أرباح نقدية	2018-04-30	2018-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.150933
2796	2250	توزيع أرباح نقدية	2018-04-18	2018-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.15124
2797	4339	توزيع أرباح نقدية	2018-03-27	2018-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.151503
2798	6012	توزيع أرباح نقدية	2018-06-03	2018-06-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.151752
2799	5110	توزيع أرباح نقدية	2018-03-21	2018-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.151952
2800	4009	توزيع أرباح نقدية	2018-03-29	2018-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.152196
2801	6004	توزيع أرباح نقدية	2018-05-06	2018-06-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.700547
2802	8311	تغيير نظام الشركة	2018-05-20	2018-06-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.701298
2803	8311	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-05-10	2018-06-11	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:20.701857
2804	8311	تخفيض رأس المال المصرح به	2018-05-10	2018-06-11	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  100000000 الى  200000000	2025-12-25 15:06:20.702224
2805	8100	تغيير نظام الشركة	2018-05-16	2018-06-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.702606
2806	8190	تخفيض رأس المال المصرح به	2018-04-22	2018-06-10	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  490000000 الى  400000000	2025-12-25 15:06:20.702995
2807	8190	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-04-22	2018-06-10	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:20.703383
2808	8190	تغيير نظام الشركة	2018-04-22	2018-06-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.703623
2809	8100	توزيع أسهم خزينة كأسهم منحة	2018-03-28	2018-06-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.703858
2810	8100	زيادة رأس المال المصرح به	2018-03-28	2018-06-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  250000000 إلى  300000000	2025-12-25 15:06:20.704097
2811	3030	توزيع أرباح نقدية	2018-05-28	2018-06-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.704333
2812	8110	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-04-02	2018-06-06	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:20.704588
2813	8110	تخفيض رأس المال المصرح به	2018-04-02	2018-06-06	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  122000000 الى  100000000	2025-12-25 15:06:20.704945
2814	4002	تغيير نظام الشركة	2018-05-13	2018-06-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.705851
2815	8312	تغيير نظام الشركة	2018-05-03	2018-06-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.718912
2816	4002	توزيع أسهم خزينة كأسهم منحة	2018-01-30	2018-06-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.745274
2817	4002	زيادة رأس المال المصرح به	2018-01-30	2018-06-04	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  500000000 إلى  1000000000	2025-12-25 15:06:20.75449
2818	4090	توزيع أرباح نقدية	2018-05-30	2018-06-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.758021
2819	8210	توزيع أرباح نقدية	2018-04-17	2018-06-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.781581
2820	8060	تغيير نظام الشركة	2018-05-07	2018-05-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.781878
2821	8060	توزيع أسهم خزينة كأسهم منحة	2017-10-30	2018-05-30	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.782117
2822	8060	زيادة رأس المال المصرح به	2017-10-30	2018-05-30	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  400000000 إلى  440000000	2025-12-25 15:06:20.782325
2823	4031	توزيع أرباح نقدية	2018-04-17	2018-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.782551
2824	4320	توزيع أرباح نقدية	2018-04-01	2018-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.782801
2825	4012	توزيع أرباح نقدية	2018-02-28	2018-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.783005
2826	2050	توزيع أرباح نقدية	2018-02-08	2018-05-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.783229
2827	2190	توزيع أرباح نقدية	2018-03-28	2018-05-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.783425
2828	4050	توزيع أسهم خزينة كأسهم منحة	2018-03-13	2018-05-23	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.783724
2829	4050	توزيع أرباح نقدية	2018-03-13	2018-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.783944
2830	4004	توزيع أرباح نقدية	2017-12-13	2018-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.784233
2831	4100	توزيع أرباح نقدية	2018-04-02	2018-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.784422
2832	8070	توزيع أسهم خزينة كأسهم منحة	2018-02-15	2018-05-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.784618
2833	8012	توزيع أرباح نقدية	2018-04-11	2018-05-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.784908
2834	1212	توزيع أرباح نقدية	2018-03-28	2018-05-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.785181
2835	4190	توزيع أرباح نقدية	2018-05-08	2018-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.785399
2836	2080	توزيع أرباح نقدية	2018-05-13	2018-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.785651
2837	4300	توزيع أرباح نقدية	2018-04-26	2018-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.785839
2838	1180	تغيير نظام الشركة	2018-04-24	2018-05-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.786016
2839	4300	تغيير نظام الشركة	2018-04-24	2018-05-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.786193
2840	6070	توزيع أرباح نقدية	2018-03-22	2018-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.786368
2841	1210	توزيع أرباح نقدية	2018-02-27	2018-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.786553
2842	1180	زيادة رأس المال المصرح به	2017-12-31	2018-05-16	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  30000000000	2025-12-25 15:06:20.786737
2843	1180	توزيع أسهم خزينة كأسهم منحة	2017-12-31	2018-05-16	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.786931
2844	1180	توزيع أرباح نقدية	2017-12-31	2018-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.787098
2845	1301	توزيع أرباح نقدية	2018-04-02	2018-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.787266
2846	4180	توزيع أرباح نقدية	2018-03-29	2018-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.787453
2847	2150	توزيع أرباح نقدية	2017-12-19	2018-05-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.787626
2848	4008	تغيير نظام الشركة	2018-04-19	2018-05-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.787791
2849	4080	تغيير نظام الشركة	2018-04-17	2018-05-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.787972
2850	1303	توزيع أرباح نقدية	2018-03-21	2018-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.788158
2851	4230	تغيير نظام الشركة	2018-04-19	2018-05-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.788329
2852	2220	توزيع أرباح نقدية	2017-12-28	2018-05-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.788506
2853	1020	توزيع أرباح نقدية	2018-02-08	2018-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.788673
2854	7201	تغيير نظام الشركة	2018-04-10	2018-05-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.788837
2855	7201	توزيع أرباح نقدية	2018-03-26	2018-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.789
2856	3080	توزيع أرباح نقدية	2018-03-21	2018-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.789169
2857	7010	توزيع أرباح نقدية	2018-04-22	2018-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.799616
2858	2140	تغيير نظام الشركة	2018-04-11	2018-05-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.799928
2859	3003	توزيع أرباح نقدية	2018-03-28	2018-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.800127
2860	4051	توزيع أرباح نقدية	2018-03-05	2018-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.800317
2861	4002	توزيع أرباح نقدية	2018-01-29	2018-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.800487
2862	2340	تغيير نظام الشركة	2018-04-16	2018-05-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.800666
2863	2340	توزيع أرباح نقدية	2018-03-08	2018-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.800857
2864	4006	توزيع أرباح نقدية	2018-03-28	2018-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.801044
2865	4260	توزيع أرباح نقدية	2018-02-01	2018-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.801227
2866	3001	تغيير نظام الشركة	2018-04-09	2018-04-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.801398
2867	4110	تغيير نظام الشركة	2018-04-04	2018-04-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.801581
2868	4110	توزيع أسهم خزينة كأسهم منحة	2018-02-20	2018-04-30	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.801745
2869	4110	زيادة رأس المال المصرح به	2018-02-20	2018-04-30	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  240000000 إلى  300000000	2025-12-25 15:06:20.80191
2870	4040	توزيع أرباح نقدية	2018-01-29	2018-04-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.807362
2871	3040	توزيع أرباح نقدية	2018-04-22	2018-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.807765
2872	2040	تغيير نظام الشركة	2018-04-16	2018-04-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.808062
2873	2040	زيادة رأس المال المصرح به	2018-02-11	2018-04-29	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  500000000 إلى  600000000	2025-12-25 15:06:20.808581
2874	2040	توزيع أسهم خزينة كأسهم منحة	2018-02-11	2018-04-29	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.808913
2875	7010	توزيع أرباح نقدية	2018-01-25	2018-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.809767
2876	4290	تغيير نظام الشركة	2018-04-11	2018-04-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.810227
2877	4290	توزيع أسهم خزينة كأسهم منحة	2018-03-28	2018-04-25	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.810887
2878	4290	توزيع أرباح نقدية	2018-03-28	2018-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.811678
2879	4290	زيادة رأس المال المصرح به	2018-03-28	2018-04-25	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  400000000 إلى  450000000	2025-12-25 15:06:20.812118
2880	2380	توزيع أرباح نقدية	2018-03-08	2018-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.812692
2881	2030	توزيع أرباح نقدية	2018-03-01	2018-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.813452
2882	1030	توزيع أرباح نقدية	2018-02-14	2018-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.813969
2883	4001	تغيير نظام الشركة	2018-04-12	2018-04-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.814715
2884	8130	تغيير نظام الشركة	2018-04-12	2018-04-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.815203
2885	8130	توزيع أرباح نقدية	2018-04-10	2018-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.815544
2886	4001	توزيع أرباح نقدية	2018-03-20	2018-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.815915
2887	4001	توزيع أسهم خزينة كأسهم منحة	2018-03-20	2018-04-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:20.816292
2888	6002	توزيع أرباح نقدية	2018-01-31	2018-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.816673
2889	4342	توزيع أرباح نقدية	2018-04-16	2018-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.817168
2890	1202	تغيير نظام الشركة	2018-04-11	2018-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.817618
2891	1320	تغيير نظام الشركة	2018-04-11	2018-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.818036
2892	3007	تغيير نظام الشركة	2018-04-09	2018-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.8184
2893	4011	تغيير نظام الشركة	2018-04-08	2018-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.818902
2894	1202	توزيع أرباح نقدية	2018-03-04	2018-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.820333
2895	3007	توزيع أرباح نقدية	2018-02-27	2018-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.821143
2896	4336	توزيع أرباح نقدية	2018-04-16	2018-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.821572
2897	1050	تغيير نظام الشركة	2018-04-05	2018-04-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.821888
2898	2070	تغيير نظام الشركة	2018-04-03	2018-04-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:20.822183
2899	2070	توزيع أرباح نقدية	2018-03-22	2018-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.822477
2900	1050	توزيع أرباح نقدية	2018-03-04	2018-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:20.822991
2901	2260	توزيع أرباح نقدية	2017-12-28	2018-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.390523
2902	8011	تغيير نظام الشركة	2018-04-05	2018-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.391736
2903	8170	تغيير نظام الشركة	2018-04-04	2018-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.392457
2904	8011	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-02-19	2018-04-19	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:21.393087
2905	8011	تخفيض رأس المال المصرح به	2018-02-19	2018-04-19	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  350000000 الى  180000000	2025-12-25 15:06:21.393583
2906	3050	توزيع أرباح نقدية	2018-03-07	2018-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.394215
2907	2010	توزيع أرباح نقدية	2017-12-19	2018-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.394537
2908	4030	توزيع أرباح نقدية	2017-12-14	2018-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.394967
2909	2240	توزيع أرباح نقدية	2018-03-26	2018-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.395263
2910	2002	توزيع أرباح نقدية	2018-03-08	2018-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.395502
2911	4150	توزيع أرباح نقدية	2018-03-04	2018-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.395806
2912	1302	توزيع أرباح نقدية	2018-03-26	2018-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.396045
2913	4090	توزيع أرباح نقدية	2018-03-25	2018-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.396317
2914	3060	توزيع أرباح نقدية	2018-03-15	2018-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.396529
2915	1090	توزيع أرباح نقدية	2018-03-01	2018-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.396733
2916	4005	توزيع أرباح نقدية	2018-02-18	2018-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.397018
2917	3030	توزيع أرباح نقدية	2018-02-07	2018-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.397281
2918	1832	تغيير نظام الشركة	2018-04-01	2018-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.397582
2919	1140	توزيع أرباح نقدية	2018-01-14	2018-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.397868
2920	1832	زيادة رأس المال المصرح به	2017-12-28	2018-04-12	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  11250000 إلى  15000000	2025-12-25 15:06:21.398097
2921	1832	توزيع أسهم خزينة كأسهم منحة	2017-12-28	2018-04-12	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:21.398446
2922	1832	توزيع أرباح نقدية	2017-12-28	2018-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.39871
2923	2320	توزيع أرباح نقدية	2018-03-29	2018-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.398974
2924	1150	توزيع أرباح نقدية	2017-12-13	2018-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.399233
2925	4333	توزيع أرباح نقدية	2018-04-08	2018-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.399479
2926	2280	توزيع أرباح نقدية	2017-12-11	2018-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.39971
2927	3010	توزيع أرباح نقدية	2018-02-19	2018-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.400012
2928	6004	توزيع أرباح نقدية	2018-03-28	2018-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.400342
2929	2060	تغيير نظام الشركة	2018-03-26	2018-04-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.400567
2930	6001	توزيع أرباح نقدية	2017-12-24	2018-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.400771
2931	4190	توزيع أرباح نقدية	2018-03-25	2018-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.400986
2932	2290	توزيع أرباح نقدية	2017-12-28	2018-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.40417
2933	1080	توزيع أرباح نقدية	2017-12-21	2018-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.404404
2934	4280	توزيع أرباح نقدية	2018-03-29	2018-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.404624
2935	2310	توزيع أرباح نقدية	2017-12-20	2018-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.404822
2936	4339	توزيع أرباح نقدية	2018-03-29	2018-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.405013
2937	2330	توزيع أرباح نقدية	2018-03-19	2018-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.405209
2938	4010	توزيع أرباح نقدية	2018-02-27	2018-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.405404
2939	1060	تغيير نظام الشركة	2018-03-14	2018-03-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.405651
2940	1060	توزيع أرباح نقدية	2017-12-24	2018-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.405857
2941	1040	تغيير نظام الشركة	2018-03-14	2018-03-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.406066
2942	4003	توزيع أرباح نقدية	2018-02-22	2018-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.406268
2943	1040	توزيع أرباح نقدية	2017-12-26	2018-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.406458
2944	1010	توزيع أرباح نقدية	2017-12-28	2018-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.406637
2945	1120	توزيع أرباح نقدية	2018-02-18	2018-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.406831
2946	1020	تغيير نظام الشركة	2018-02-28	2018-03-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.40704
2947	2020	توزيع أرباح نقدية	2018-02-21	2018-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.407242
2948	1020	زيادة رأس مال - إصدار حقوق أولوية	2015-01-14	2018-03-20	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:21.40742
2949	1020	زيادة رأس المال المصرح به	2015-01-14	2018-03-20	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  8200000000	2025-12-25 15:06:21.407591
2950	4334	توزيع أرباح نقدية	2018-03-14	2018-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.407778
2951	2330	توزيع أرباح نقدية	2017-12-05	2018-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.408028
2952	4330	زيادة رأس مال - اكتتاب خاص	2017-05-22	2018-03-19	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:21.408348
2953	4330	زيادة رأس مال - إصدار حقوق أولوية	2017-05-22	2018-03-19	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:21.408595
2954	2080	تغيير نظام الشركة	2018-01-03	2018-03-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.408784
2955	4200	توزيع أرباح نقدية	2018-01-18	2018-03-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.408979
2956	4008	توزيع أرباح نقدية	2018-02-11	2018-03-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.409245
2957	4335	توزيع أرباح نقدية	2018-02-26	2018-03-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.409431
2958	1211	تغيير نظام الشركة	2018-02-15	2018-03-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.409612
2959	3040	توزيع أرباح نقدية	2018-01-29	2018-03-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.409803
2960	1810	توزيع أرباح نقدية	2018-02-11	2018-02-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.410019
2961	4330	توزيع أرباح نقدية	2018-01-22	2018-02-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.4102
2962	7040	تخفيض رأس المال المصرح به	2018-01-18	2018-02-14	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  630000000 الى  472500000	2025-12-25 15:06:21.410376
2963	7040	تخفيض رأس مال - بتخفيض عدد الأسهم	2018-01-18	2018-02-14	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:21.410782
2964	2120	توزيع أرباح نقدية	2017-05-10	2018-02-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.410962
2965	4336	توزيع أرباح نقدية	2018-01-28	2018-02-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.411135
2966	1304	توزيع أرباح نقدية	2018-01-22	2018-01-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.41131
2967	4031	تغيير نظام الشركة	2018-01-08	2018-01-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.411528
2968	4333	توزيع أرباح نقدية	2018-01-14	2018-01-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.411737
2969	2110	تغيير نظام الشركة	2018-01-04	2018-01-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.411916
2970	4331	تغيير نظام الشركة	2017-12-17	2018-01-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.414437
2971	4332	توزيع أرباح نقدية	2018-01-02	2018-01-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.414767
2972	8080	تغيير نظام الشركة	2017-04-02	2018-01-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.414981
2973	4011	تغيير نظام الشركة	2017-12-27	2018-01-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.415179
2974	4145	تخفيض رأس المال المصرح به	2018-01-02	2018-01-02	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  300000000 الى  200000000	2025-12-25 15:06:21.415397
2975	8200	تغيير نظام الشركة	2017-05-25	2018-01-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.415648
2976	8200	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-05-25	2018-01-02	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:21.416024
2977	8200	تخفيض رأس المال المصرح به	2017-05-25	2018-01-02	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  1000000000 الى  810000000	2025-12-25 15:06:21.41637
2978	2360	توزيع أرباح نقدية	2017-12-24	2018-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.416676
2979	2250	توزيع أرباح نقدية	2017-10-08	2018-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.417008
2980	4280	توزيع أرباح نقدية	2017-04-12	2018-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.417295
2981	1201	تغيير نظام الشركة	2017-12-06	2017-12-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.418839
2982	1213	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-11-09	2017-12-31	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:21.419253
2983	1213	تخفيض رأس المال المصرح به	2017-11-09	2017-12-31	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  375000000 الى  225000000	2025-12-25 15:06:21.419555
2984	1213	تغيير نظام الشركة	2017-11-09	2017-12-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.419885
2985	4007	توزيع أرباح نقدية	2017-12-11	2017-12-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.420163
2986	2230	توزيع أرباح نقدية	2017-12-17	2017-12-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.420494
2987	4140	تغيير نظام الشركة	2017-12-10	2017-12-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.42077
2988	6004	تغيير نظام الشركة	2017-12-07	2017-12-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.426555
2989	4140	تخفيض رأس المال المصرح به	2017-11-12	2017-12-24	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  108000000 الى  10800000	2025-12-25 15:06:21.427006
2990	4140	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-11-12	2017-12-24	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:21.427266
2991	1214	تغيير نظام الشركة	2017-11-23	2017-12-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.427501
2992	6090	تغيير نظام الشركة	2017-11-30	2017-12-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.42772
2993	6090	تغيير اسم الشركة	2017-09-27	2017-12-20	\N	\N	\N	SAR	تم تعديل اسم الشركة من JAZADCO إلى JAZADCO	2025-12-25 15:06:21.427928
2994	4210	تغيير نظام الشركة	2017-12-07	2017-12-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.42819
2995	2080	توزيع أرباح نقدية	2017-11-02	2017-12-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.428406
2996	4260	تغيير نظام الشركة	2017-11-27	2017-12-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.428605
2997	6010	تغيير نظام الشركة	2017-11-29	2017-12-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.428932
2998	2320	توزيع أرباح نقدية	2017-11-28	2017-12-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.429121
2999	2270	توزيع أرباح نقدية	2017-11-29	2017-12-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.429325
3000	3002	تغيير نظام الشركة	2017-11-23	2017-12-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.429575
3001	3010	توزيع أرباح نقدية	2017-09-25	2017-12-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.935733
3002	2190	تغيير نظام الشركة	2017-11-16	2017-11-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.936377
3003	4003	تغيير نظام الشركة	2017-11-15	2017-11-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.936664
3004	3007	تغيير نظام الشركة	2017-11-07	2017-11-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.936909
3005	4190	توزيع أرباح نقدية	2017-11-06	2017-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.937337
3006	6004	توزيع أرباح نقدية	2017-11-05	2017-11-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.937567
3007	4031	توزيع أرباح نقدية	2017-11-12	2017-11-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.937851
3008	4331	توزيع أرباح نقدية	2017-11-01	2017-11-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.938072
3009	2080	توزيع أرباح نقدية	2017-11-02	2017-11-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.938256
3010	7010	توزيع أرباح نقدية	2017-10-26	2017-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.938442
3011	3040	توزيع أرباح نقدية	2017-10-16	2017-10-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.938622
3012	8240	توزيع أسهم خزينة كأسهم منحة	2017-04-20	2017-10-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:21.938802
3013	8240	زيادة رأس المال المصرح به	2017-04-20	2017-10-22	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  100000000 إلى  200000000	2025-12-25 15:06:21.938977
3014	4333	توزيع أرباح نقدية	2017-10-15	2017-10-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.939152
3015	2330	توزيع أرباح نقدية	2017-10-04	2017-10-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.939355
3016	2010	تغيير نظام الشركة	2017-09-14	2017-10-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.939553
3017	2280	تغيير نظام الشركة	2017-06-08	2017-10-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.939752
3018	2280	توزيع أسهم خزينة كأسهم منحة	2017-06-08	2017-10-09	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:21.93995
3019	2280	زيادة رأس المال المصرح به	2017-06-08	2017-10-09	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  10000000000	2025-12-25 15:06:21.940137
3020	4090	توزيع أرباح نقدية	2017-09-28	2017-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.940318
3021	4001	توزيع أرباح نقدية	2017-09-25	2017-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.940569
3023	4280	توزيع أرباح نقدية	2017-04-12	2017-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.940988
3024	2360	توزيع أرباح نقدية	2017-09-25	2017-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.941255
3025	8020	زيادة رأس مال - إصدار حقوق أولوية	2016-04-19	2017-10-01	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:21.942523
3026	8020	زيادة رأس المال المصرح به	2016-04-19	2017-10-01	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  120000000 إلى  500000000	2025-12-25 15:06:21.942769
3027	4031	توزيع أرباح نقدية	2017-09-17	2017-09-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.942944
3028	4012	تغيير نظام الشركة	2017-09-12	2017-09-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.943128
3029	4012	توزيع أرباح نقدية	2017-06-19	2017-09-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.943301
3030	8030	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-08-23	2017-09-25	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:21.943467
3031	8030	تخفيض رأس المال المصرح به	2017-08-23	2017-09-25	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  1000000000 الى  400000000	2025-12-25 15:06:21.94363
3032	8030	تغيير نظام الشركة	2017-08-23	2017-09-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.943794
3033	4008	توزيع أرباح نقدية	2017-07-27	2017-09-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.943959
3034	4191	توزيع أرباح نقدية	2017-08-16	2017-09-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.944126
3035	4141	تغيير نظام الشركة	2017-07-30	2017-09-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.944293
3036	2020	توزيع أرباح نقدية	2017-08-27	2017-09-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.944455
3037	2170	تغيير نظام الشركة	2017-05-17	2017-09-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.944622
3038	4332	توزيع أرباح نقدية	2017-08-20	2017-08-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.944787
3039	2315	تغيير نظام الشركة	2017-08-20	2017-08-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.944949
3040	6004	توزيع أرباح نقدية	2017-08-15	2017-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.94511
3041	2320	توزيع أرباح نقدية	2017-08-03	2017-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.945272
3042	1810	توزيع أرباح نقدية	2017-05-03	2017-08-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.945436
3043	1180	شراء اسهم خزينة	2017-08-17	2017-08-17	\N	\N	\N	SAR	أعلنت الشركة عن انتهائها من شراء 2105503 سهم خزينة بينما كانت قد استهدفت شراء 4000000	2025-12-25 15:06:21.945603
3044	4190	توزيع أرباح نقدية	2017-08-07	2017-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.945781
3045	3060	توزيع أرباح نقدية	2017-07-02	2017-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.946115
3046	3010	توزيع أرباح نقدية	2017-08-09	2017-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.946463
3047	4020	توزيع أرباح نقدية	2017-08-08	2017-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.946824
3048	8190	تغيير نظام الشركة	2017-07-31	2017-08-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.947193
3049	4150	توزيع أرباح نقدية	2017-07-12	2017-08-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.947573
3050	2240	توزيع أرباح نقدية	2017-08-02	2017-08-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.948075
3051	1090	توزيع أرباح نقدية	2017-08-03	2017-08-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.950719
3052	1060	توزيع أرباح نقدية	2017-07-20	2017-08-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.95204
3053	4010	توزيع أرباح نقدية	2017-07-30	2017-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.952801
3054	4090	توزيع أرباح نقدية	2017-07-30	2017-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.954204
3055	7010	توزيع أرباح نقدية	2017-07-26	2017-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.966604
3056	3050	توزيع أرباح نقدية	2017-07-10	2017-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.969105
3057	7201	تغيير نظام الشركة	2017-07-06	2017-08-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.970544
3058	2230	توزيع أرباح نقدية	2017-05-25	2017-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.973818
3059	2080	توزيع أرباح نقدية	2017-07-26	2017-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.974277
3060	2010	توزيع أرباح نقدية	2017-06-21	2017-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.974538
3061	2300	تغيير نظام الشركة	2017-06-07	2017-07-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.974933
3062	6060	تغيير نظام الشركة	2017-05-25	2017-07-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.975177
3063	1120	توزيع أرباح نقدية	2017-07-12	2017-07-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.992023
3064	3091	توزيع أسهم خزينة كأسهم منحة	2017-01-15	2017-07-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:21.993326
3065	3091	زيادة رأس المال المصرح به	2017-01-15	2017-07-18	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1300000000 إلى  1430000000	2025-12-25 15:06:21.994
3066	3091	تغيير نظام الشركة	2017-01-15	2017-07-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.994221
3067	6002	توزيع أرباح نقدية	2017-07-11	2017-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.994489
3068	1050	توزيع أرباح نقدية	2017-07-10	2017-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.994732
3069	1302	توزيع أرباح نقدية	2017-06-07	2017-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.995348
3070	4070	تغيير نظام الشركة	2017-06-01	2017-07-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.995869
3071	2130	تغيير نظام الشركة	2017-05-25	2017-07-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.997524
3072	4003	توزيع أرباح نقدية	2017-07-10	2017-07-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.997835
3073	3040	توزيع أرباح نقدية	2017-07-05	2017-07-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:21.998073
3074	4007	تغيير نظام الشركة	2017-06-14	2017-07-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:21.998763
3075	6020	توزيع أرباح نقدية	2017-05-22	2017-07-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.000248
3076	2120	توزيع أرباح نقدية	2017-05-10	2017-07-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.001111
3077	1010	توزيع أرباح نقدية	2017-06-21	2017-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.001566
3078	1080	توزيع أرباح نقدية	2017-06-18	2017-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.001854
3079	2290	توزيع أرباح نقدية	2017-06-07	2017-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.002705
3080	2150	توزيع أرباح نقدية	2017-05-25	2017-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.003086
3081	4280	توزيع أرباح نقدية	2017-04-12	2017-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.003383
3082	2330	توزيع أرباح نقدية	2017-05-17	2017-06-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.003617
3083	1180	توزيع أرباح نقدية	2017-06-15	2017-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.003814
3084	8310	تغيير نظام الشركة	2017-05-10	2017-06-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.00401
3085	8110	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-03-20	2017-06-19	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:22.004242
3086	8110	تخفيض رأس المال المصرح به	2017-03-20	2017-06-19	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  205000000 الى  122000000	2025-12-25 15:06:22.004475
3087	4330	توزيع أرباح نقدية	2017-05-22	2017-06-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.004671
3088	8110	تغيير نظام الشركة	2017-06-15	2017-06-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.005084
3089	3005	تغيير نظام الشركة	2017-05-04	2017-06-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.007337
3090	2380	تغيير نظام الشركة	2017-05-17	2017-06-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.008356
3091	4009	توزيع أرباح نقدية	2017-03-05	2017-06-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.009278
3092	4001	تغيير نظام الشركة	2017-03-26	2017-06-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.010105
3093	3030	توزيع أرباح نقدية	2017-05-24	2017-06-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.010736
3094	4110	توزيع أرباح نقدية	2017-05-14	2017-06-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.012094
3095	4050	تغيير نظام الشركة	2017-05-11	2017-06-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.012856
3096	2110	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-04-19	2017-06-07	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:22.013505
3097	8311	تغيير نظام الشركة	2017-05-22	2017-06-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.014602
3098	8050	تغيير نظام الشركة	2017-05-21	2017-06-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.015524
3099	4090	تغيير نظام الشركة	2017-05-11	2017-06-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.016178
3100	2001	تغيير نظام الشركة	2017-04-20	2017-06-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.021705
3101	8070	تغيير نظام الشركة	2017-03-08	2017-06-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.578398
3102	7020	تغيير نظام الشركة	2017-05-10	2017-06-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.582315
3103	2110	تخفيض رأس المال المصرح به	2017-04-19	2017-06-05	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  760000000 الى  404114000	2025-12-25 15:06:22.582981
3104	2320	تغيير نظام الشركة	2017-05-01	2017-06-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.583649
3105	1330	تغيير نظام الشركة	2017-05-17	2017-05-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.584307
3106	8220	إلغاء الإدراج	2017-05-29	2017-05-30	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2017-05-30	2025-12-25 15:06:22.584716
3107	6040	تغيير نظام الشركة	2017-05-04	2017-05-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.587027
3108	4031	توزيع أرباح نقدية	2017-05-21	2017-05-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.588238
3109	2090	تغيير نظام الشركة	2017-05-03	2017-05-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.596364
3110	2090	توزيع أرباح نقدية	2017-03-14	2017-05-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.601375
3111	4280	تغيير نظام الشركة	2017-04-30	2017-05-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.602524
3112	7040	تغيير نظام الشركة	2017-04-23	2017-05-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.602857
3113	2150	تغيير نظام الشركة	2017-05-11	2017-05-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.60306
3114	2270	توزيع أرباح نقدية	2017-05-04	2017-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.603513
3115	4002	تغيير نظام الشركة	2017-04-16	2017-05-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.603806
3116	2220	توزيع أرباح نقدية	2016-12-22	2017-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.604017
3117	2150	زيادة رأس مال - اكتتاب خاص	2016-10-11	2017-05-25	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:22.604229
3118	2150	زيادة رأس المال المصرح به	2016-10-11	2017-05-25	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  300000000 إلى  329000000	2025-12-25 15:06:22.604459
3119	8300	تغيير نظام الشركة	2017-05-09	2017-05-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.6047
3120	2160	تغيير نظام الشركة	2017-04-25	2017-05-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.612671
3121	1050	تغيير نظام الشركة	2017-04-25	2017-05-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.614252
3122	1202	توزيع أرباح نقدية	2017-03-15	2017-05-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.615753
3123	4051	توزيع أرباح نقدية	2017-05-11	2017-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.622469
3124	4051	تغيير نظام الشركة	2017-05-11	2017-05-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.62271
3125	8280	تغيير نظام الشركة	2017-05-11	2017-05-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.622854
3126	6002	تغيير نظام الشركة	2017-05-09	2017-05-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.622997
3127	8270	تغيير نظام الشركة	2017-04-27	2017-05-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.623138
3128	8270	توزيع أرباح نقدية	2017-04-06	2017-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.623258
3129	8120	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-03-22	2017-05-23	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:22.623387
3130	6002	توزيع أرباح نقدية	2017-02-21	2017-05-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.623511
3131	6002	توزيع أسهم خزينة كأسهم منحة	2017-02-21	2017-05-23	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:22.623635
3132	6002	زيادة رأس المال المصرح به	2017-02-21	2017-05-23	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  462000000 إلى  646800000	2025-12-25 15:06:22.623757
3133	1304	توزيع أرباح نقدية	2017-05-16	2017-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.623894
3134	6004	توزيع أرباح نقدية	2017-05-04	2017-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.624042
3135	8060	تغيير نظام الشركة	2017-04-27	2017-05-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.624167
3136	4100	توزيع أرباح نقدية	2017-03-23	2017-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.624462
3137	8060	تغيير اسم الشركة	2017-03-05	2017-05-22	\N	\N	\N	SAR	تم تعديل اسم الشركة من Walaa إلى Walaa	2025-12-25 15:06:22.624579
3138	4230	توزيع أرباح نقدية	2017-02-15	2017-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.624699
3139	4230	تغيير نظام الشركة	2017-01-12	2017-05-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.62482
3140	8120	تغيير نظام الشركة	2017-05-21	2017-05-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.624946
3141	8120	تخفيض رأس المال المصرح به	2017-03-22	2017-05-21	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  220000000 الى  150000000	2025-12-25 15:06:22.625087
3142	6080	إلغاء الإدراج	2017-05-17	2017-05-18	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2017-05-18	2025-12-25 15:06:22.625208
3143	4170	تغيير نظام الشركة	2017-05-07	2017-05-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.625327
3144	8140	تغيير نظام الشركة	2017-05-03	2017-05-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.625445
3145	8012	تغيير نظام الشركة	2017-05-03	2017-05-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.625563
3146	8240	تغيير نظام الشركة	2017-04-06	2017-05-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.62568
3147	8012	توزيع أرباح نقدية	2017-03-01	2017-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.625795
3148	4190	توزيع أرباح نقدية	2017-05-08	2017-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.625912
3149	1212	تغيير نظام الشركة	2017-04-20	2017-05-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.626027
3150	8180	تغيير نظام الشركة	2017-04-19	2017-05-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.626145
3151	1212	توزيع أرباح نقدية	2017-03-19	2017-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.626259
3152	8180	توزيع أرباح نقدية	2017-03-05	2017-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.626383
3153	2200	تغيير نظام الشركة	2017-05-04	2017-05-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.626504
3154	8260	تغيير نظام الشركة	2017-05-04	2017-05-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.626625
3155	2210	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-12-28	2017-05-16	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:22.626743
3156	4003	زيادة رأس المال المصرح به	2017-02-21	2017-05-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  360000000 إلى  420000000	2025-12-25 15:06:22.626863
3157	4003	توزيع أسهم خزينة كأسهم منحة	2017-02-21	2017-05-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:22.626984
3158	8312	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-02-15	2017-05-15	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:22.627106
3159	8312	تخفيض رأس المال المصرح به	2017-02-15	2017-05-15	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  450000000 الى  300000000	2025-12-25 15:06:22.627226
3160	7010	توزيع أرباح نقدية	2017-05-04	2017-05-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.627344
3161	2210	تغيير نظام الشركة	2017-04-27	2017-05-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.627459
3162	2210	تخفيض رأس المال المصرح به	2016-12-28	2017-05-14	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  1285200000 الى  235200000	2025-12-25 15:06:22.627576
3163	8090	إلغاء الإدراج	2017-05-10	2017-05-11	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2017-05-11	2025-12-25 15:06:22.627693
3164	8170	تغيير نظام الشركة	2017-05-09	2017-05-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.627818
3165	8312	تغيير نظام الشركة	2017-04-25	2017-05-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.627934
3166	1210	تغيير نظام الشركة	2017-04-12	2017-05-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.628052
3167	1210	توزيع أرباح نقدية	2017-03-05	2017-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.628168
3168	3001	توزيع أرباح نقدية	2017-02-15	2017-05-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.628286
3169	2080	توزيع أرباح نقدية	2017-05-03	2017-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.628411
3170	8210	تغيير نظام الشركة	2017-04-25	2017-05-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.628533
3171	8210	توزيع أرباح نقدية	2017-03-13	2017-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.628683
3172	1140	توزيع أرباح نقدية	2016-12-29	2017-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.631619
3173	8130	تغيير نظام الشركة	2017-04-27	2017-05-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.631835
3174	8130	توزيع أرباح نقدية	2017-03-07	2017-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.632036
3175	1310	إلغاء الإدراج	2017-05-02	2017-05-07	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2017-05-07	2025-12-25 15:06:22.632272
3176	4008	تغيير نظام الشركة	2017-04-10	2017-05-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.632476
3177	4140	تغيير نظام الشركة	2017-02-02	2017-05-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.632682
3178	2240	توزيع أرباح نقدية	2017-01-19	2017-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.632879
3179	4006	توزيع أرباح نقدية	2017-01-18	2017-05-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.633078
3180	1180	تغيير نظام الشركة	2017-04-04	2017-05-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.633271
3181	4320	تغيير نظام الشركة	2017-04-04	2017-05-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.633456
3182	1180	توزيع أرباح نقدية	2017-01-29	2017-05-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.633643
3183	4130	زيادة رأس المال المصرح به	2017-04-06	2017-05-03	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  150000000 إلى  295000000	2025-12-25 15:06:22.63383
3184	6090	تغيير نظام الشركة	2017-03-08	2017-05-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.633999
3185	4130	تخفيض رأس المال المصرح به	2017-02-22	2017-05-03	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  295000000 الى  177000000	2025-12-25 15:06:22.634131
3186	4130	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-02-22	2017-05-03	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:22.634249
3187	6090	توزيع أرباح نقدية	2017-01-01	2017-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.634372
3188	4130	زيادة رأس مال - اكتتاب خاص	2015-07-09	2017-05-03	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:22.634496
3189	4300	تغيير نظام الشركة	2017-04-06	2017-05-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.634616
3190	4180	تغيير نظام الشركة	2017-04-02	2017-05-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.634734
3191	2180	تغيير نظام الشركة	2017-03-22	2017-05-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.634859
3192	2180	توزيع أرباح نقدية	2017-01-31	2017-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.634984
3193	4090	توزيع أرباح نقدية	2017-04-13	2017-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.635102
3194	1090	تغيير نظام الشركة	2017-04-05	2017-05-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.635227
3195	3060	تغيير نظام الشركة	2017-04-02	2017-05-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.635345
3196	3060	توزيع أرباح نقدية	2017-02-05	2017-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.635475
3197	1090	توزيع أرباح نقدية	2017-01-01	2017-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.635589
3198	8250	تغيير نظام الشركة	2017-03-30	2017-04-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:22.635705
3199	4004	توزيع أرباح نقدية	2017-02-23	2017-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.635828
3200	3040	توزيع أرباح نقدية	2017-04-20	2017-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:22.635945
3201	1060	تغيير نظام الشركة	2017-03-30	2017-04-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.163622
3202	1303	توزيع أرباح نقدية	2017-03-14	2017-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.164802
3203	1060	توزيع أرباح نقدية	2016-12-27	2017-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.165099
3204	4220	تغيير نظام الشركة	2017-04-20	2017-04-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.165333
3205	4002	توزيع أرباح نقدية	2017-01-23	2017-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.165582
3206	8200	تغيير نظام الشركة	2017-04-10	2017-04-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.165833
3207	4080	تغيير نظام الشركة	2017-03-15	2017-04-24	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.166181
3208	4080	توزيع أرباح نقدية	2016-12-21	2017-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.166555
3209	2030	تغيير نظام الشركة	2017-04-12	2017-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.23522
3210	6070	تغيير نظام الشركة	2017-03-27	2017-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.241053
3211	2230	تغيير نظام الشركة	2017-03-23	2017-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.242541
3212	3090	تغيير نظام الشركة	2017-03-20	2017-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.243226
3213	1810	تغيير نظام الشركة	2017-03-19	2017-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.244981
3214	3050	تغيير نظام الشركة	2017-03-16	2017-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.246035
3215	4010	تغيير نظام الشركة	2017-03-07	2017-04-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.246468
3216	3050	توزيع أرباح نقدية	2017-02-16	2017-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.247892
3217	4010	توزيع أرباح نقدية	2017-02-07	2017-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.248437
3218	1050	توزيع أرباح نقدية	2017-01-19	2017-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.248666
3219	6070	توزيع أرباح نقدية	2016-12-12	2017-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.25063
3220	2050	تغيير نظام الشركة	2017-03-26	2017-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.251224
3221	2040	تغيير نظام الشركة	2017-03-26	2017-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.251458
3222	1302	تغيير نظام الشركة	2017-03-23	2017-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.251655
3223	4001	توزيع أرباح نقدية	2017-03-22	2017-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.251858
3224	5110	تغيير نظام الشركة	2017-03-22	2017-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.252498
3225	2310	تغيير نظام الشركة	2017-03-22	2017-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.252863
3226	6050	تغيير نظام الشركة	2017-03-21	2017-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.253194
3227	5110	توزيع أرباح نقدية	2017-02-21	2017-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.253443
3228	4260	توزيع أرباح نقدية	2017-01-19	2017-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.25366
3229	4260	توزيع أسهم خزينة كأسهم منحة	2017-01-19	2017-04-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:23.253866
3230	2040	توزيع أرباح نقدية	2016-12-29	2017-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.254071
3231	6050	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-10-20	2017-04-20	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:23.25433
3232	6050	تخفيض رأس المال المصرح به	2016-10-20	2017-04-20	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  535375000 الى  200000000	2025-12-25 15:06:23.254608
3233	4240	تغيير نظام الشركة	2017-03-23	2017-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.254954
3234	2060	تغيير نظام الشركة	2017-03-23	2017-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.255262
3235	3010	تغيير نظام الشركة	2017-03-23	2017-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.255986
3236	2250	تغيير نظام الشركة	2017-03-23	2017-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.256577
3237	2260	تغيير نظام الشركة	2017-03-23	2017-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.25733
3238	4191	تغيير نظام الشركة	2017-03-22	2017-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.258214
3239	3010	توزيع أرباح نقدية	2017-02-20	2017-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.258959
3240	2250	توزيع أرباح نقدية	2017-01-17	2017-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.262857
3241	2260	توزيع أرباح نقدية	2016-12-15	2017-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.269819
3242	8030	تغيير نظام الشركة	2017-04-04	2017-04-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.279397
3243	2002	تغيير نظام الشركة	2017-03-23	2017-04-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.280536
3244	1030	تغيير نظام الشركة	2017-03-23	2017-04-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.281535
3245	6004	تغيير نظام الشركة	2017-03-21	2017-04-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.371523
3246	2002	توزيع أرباح نقدية	2017-03-13	2017-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.371738
3247	1030	زيادة رأس المال المصرح به	2016-12-06	2017-04-18	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  7500000000	2025-12-25 15:06:23.371886
3248	1030	توزيع أسهم خزينة كأسهم منحة	2016-12-06	2017-04-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:23.371997
3249	1030	توزيع أرباح نقدية	2016-12-06	2017-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.372093
3250	8230	تغيير نظام الشركة	2017-03-30	2017-04-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.372232
3251	4290	تغيير نظام الشركة	2017-03-23	2017-04-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.37235
3252	2190	زيادة رأس المال المصرح به	2017-03-15	2017-04-17	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  680000000 إلى  816000000	2025-12-25 15:06:23.37245
3253	2190	تغيير نظام الشركة	2017-03-15	2017-04-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.372553
3254	2070	توزيع أرباح نقدية	2017-03-12	2017-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.372646
3255	2190	توزيع أسهم خزينة كأسهم منحة	2017-02-27	2017-04-17	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:23.372736
3256	4290	توزيع أرباح نقدية	2017-02-21	2017-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.372826
3257	7030	تغيير نظام الشركة	2017-03-15	2017-04-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.372931
3258	4070	تغيير نظام الشركة	2017-02-20	2017-04-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.37302
3259	4070	تخفيض رأس المال المصرح به	2016-12-29	2017-04-16	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  150000000 الى  75000000	2025-12-25 15:06:23.373159
3260	4070	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-12-29	2017-04-16	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:23.373293
3261	1214	تغيير نظام الشركة	2016-03-23	2017-04-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.373404
3262	4280	توزيع أرباح نقدية	2017-04-12	2017-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.373523
3263	8011	تغيير نظام الشركة	2017-03-30	2017-04-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.373628
3264	8040	تغيير نظام الشركة	2017-03-28	2017-04-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.373735
3265	4030	تغيير نظام الشركة	2017-03-15	2017-04-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.373861
3266	4090	توزيع أرباح نقدية	2017-02-23	2017-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.37416
3267	4250	تغيير السنة المالية	2017-04-12	2017-04-12	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:23.374271
3268	2010	تغيير نظام الشركة	2017-03-16	2017-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.374701
3269	2340	توزيع أرباح نقدية	2017-02-08	2017-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.379747
3270	2010	توزيع أرباح نقدية	2016-12-18	2017-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.383987
3271	8160	تغيير نظام الشركة	2016-12-01	2017-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.3862
3272	1020	تغيير نظام الشركة	2017-03-28	2017-04-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.387311
3273	4011	توزيع أرباح نقدية	2017-03-23	2017-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.387716
3274	2140	تغيير نظام الشركة	2017-03-21	2017-04-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.387917
3275	7040	تغيير نظام الشركة	2017-03-15	2017-04-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.388119
3276	7010	تغيير نظام الشركة	2017-03-15	2017-04-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.388425
3277	1020	زيادة رأس المال المصرح به	2017-03-09	2017-04-11	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  5200000000	2025-12-25 15:06:23.388757
3278	1020	توزيع أسهم خزينة كأسهم منحة	2017-03-09	2017-04-11	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:23.388995
3279	1020	توزيع أرباح نقدية	2017-03-09	2017-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.389197
3280	3080	تغيير نظام الشركة	2017-03-07	2017-04-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.389391
3281	3080	توزيع أرباح نقدية	2017-02-14	2017-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.434434
3282	7040	تخفيض رأس مال - بتخفيض عدد الأسهم	2017-02-13	2017-04-11	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:23.434805
3283	7010	توزيع أرباح نقدية	2017-01-19	2017-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.435673
3284	3030	تغيير نظام الشركة	2017-04-02	2017-04-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.437403
3285	2150	تغيير نظام الشركة	2017-03-15	2017-04-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.449357
3286	6001	تغيير نظام الشركة	2017-03-14	2017-04-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.454732
3287	2360	تغيير نظام الشركة	2017-03-09	2017-04-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.457537
3288	3030	توزيع أرباح نقدية	2017-02-08	2017-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.458203
3289	6001	توزيع أرباح نقدية	2016-12-25	2017-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.458473
3290	4020	تغيير نظام الشركة	2017-03-16	2017-04-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.458682
3291	1150	تغيير نظام الشركة	2017-03-13	2017-04-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.458952
3292	4020	توزيع أرباح نقدية	2017-02-20	2017-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.459182
3293	1150	توزيع أرباح نقدية	2016-12-20	2017-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.459395
3294	8100	تغيير نظام الشركة	2017-03-26	2017-04-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.45975
3295	6010	تغيير نظام الشركة	2017-03-09	2017-04-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.459968
3296	4150	توزيع أرباح نقدية	2017-01-15	2017-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:23.46017
3297	4150	تغيير نظام الشركة	2016-11-16	2017-04-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.460389
3298	4110	تغيير نظام الشركة	2017-03-20	2017-04-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.460597
3299	4110	تغيير اسم الشركة	2017-03-20	2017-04-04	\N	\N	\N	SAR	تم تعديل اسم الشركة من Mubarrad إلى Batic	2025-12-25 15:06:23.460797
3300	1211	تغيير نظام الشركة	2017-03-06	2017-04-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:23.461415
3301	2330	توزيع أرباح نقدية	2017-03-08	2017-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.115344
3302	2350	تغيير نظام الشركة	2017-03-02	2017-04-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.115922
3303	8070	توزيع أرباح نقدية	2017-02-23	2017-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.116238
3304	1040	تغيير نظام الشركة	2017-03-15	2017-03-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.116701
3305	2020	تغيير نظام الشركة	2017-03-02	2017-03-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.117114
3306	3003	تغيير نظام الشركة	2017-03-02	2017-03-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.117459
3307	8020	تغيير نظام الشركة	2017-02-26	2017-03-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.117793
3308	8020	تغيير اسم الشركة	2017-02-26	2017-03-30	\N	\N	\N	SAR	تم تعديل اسم الشركة من Malath Insurance إلى Malath Insurance	2025-12-25 15:06:24.118219
3309	2020	توزيع أرباح نقدية	2017-02-15	2017-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.118481
3310	3003	توزيع أرباح نقدية	2017-01-18	2017-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.118765
3311	8020	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-10-20	2017-03-30	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:24.119022
3360	6020	تغيير اسم الشركة	2017-01-09	2017-02-16	\N	\N	\N	SAR	تم تعديل اسم الشركة من GACO إلى GACO	2025-12-25 15:06:24.133619
3312	8020	تخفيض رأس المال المصرح به	2016-10-20	2017-03-30	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  300000000 الى  120000000	2025-12-25 15:06:24.119276
3313	1010	تغيير نظام الشركة	2017-03-01	2017-03-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.119654
3314	4040	توزيع أرباح نقدية	2017-01-24	2017-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.119946
3315	1010	توزيع أرباح نقدية	2017-01-04	2017-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.120244
3316	1301	تغيير نظام الشركة	2017-03-02	2017-03-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.1206
3317	2280	تغيير نظام الشركة	2017-03-01	2017-03-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.120905
3318	1301	توزيع أرباح نقدية	2017-02-26	2017-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.121453
3319	2280	توزيع أرباح نقدية	2016-12-06	2017-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.12172
3320	1080	تغيير نظام الشركة	2017-02-27	2017-03-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.121966
3321	4250	تغيير نظام الشركة	2017-01-29	2017-03-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.12219
3322	1303	تغيير نظام الشركة	2017-02-23	2017-03-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.122398
3323	1080	توزيع أرباح نقدية	2016-12-20	2017-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.122606
3324	8010	تغيير نظام الشركة	2017-02-23	2017-03-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.122795
3325	8010	توزيع أسهم خزينة كأسهم منحة	2017-02-15	2017-03-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:24.122993
3326	8010	توزيع أرباح نقدية	2017-02-15	2017-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.123195
3327	8010	زيادة رأس المال المصرح به	2017-02-15	2017-03-22	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1000000000 إلى  1250000000	2025-12-25 15:06:24.123398
3328	1120	تغيير نظام الشركة	2017-02-21	2017-03-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.1236
3329	1120	توزيع أرباح نقدية	2017-01-19	2017-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.123794
3330	2320	توزيع أرباح نقدية	2017-03-07	2017-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.124043
3331	2290	توزيع أرباح نقدية	2016-12-22	2017-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.124412
3332	2290	تغيير نظام الشركة	2017-02-16	2017-03-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.12474
3333	4100	تغيير نظام الشركة	2017-02-16	2017-03-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.12507
3334	4200	تغيير نظام الشركة	2017-02-13	2017-03-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.125416
3335	4200	زيادة رأس المال المصرح به	2017-02-13	2017-03-13	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  400000000 إلى  500000000	2025-12-25 15:06:24.125675
3336	4200	توزيع أرباح نقدية	2017-01-17	2017-03-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.125962
3337	4200	توزيع أسهم خزينة كأسهم منحة	2017-01-17	2017-03-13	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:24.126668
3338	8290	تغيير نظام الشركة	2017-02-21	2017-03-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.127049
3339	8290	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-12-04	2017-03-09	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:24.127482
3340	8290	تخفيض رأس المال المصرح به	2016-12-04	2017-03-09	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  555000000 الى  250000000	2025-12-25 15:06:24.127764
3341	2330	توزيع أرباح نقدية	2016-11-22	2017-03-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.128028
3342	1302	توزيع أرباح نقدية	2017-02-27	2017-03-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.128313
3343	8150	تغيير نظام الشركة	2017-02-13	2017-03-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.128573
3344	4190	توزيع أرباح نقدية	2017-02-16	2017-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.128861
3345	3020	تغيير نظام الشركة	2017-01-30	2017-02-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.129121
3346	4003	تغيير نظام الشركة	2017-01-26	2017-02-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.129374
3347	3020	توزيع أرباح نقدية	2017-01-19	2017-02-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.129638
3348	4260	تغيير نظام الشركة	2017-01-22	2017-02-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.129903
3349	3040	توزيع أرباح نقدية	2017-01-26	2017-02-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.130165
3350	8140	تغيير نظام الشركة	2016-11-24	2017-02-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.130406
3351	8140	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-08-08	2017-02-23	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:24.130705
3352	8140	تخفيض رأس المال المصرح به	2016-08-08	2017-02-23	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  320000000 الى  160000000	2025-12-25 15:06:24.131685
3353	4040	تغيير نظام الشركة	2017-01-31	2017-02-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.131988
3354	6002	تغيير نظام الشركة	2016-03-08	2017-02-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.132232
3355	8310	تغيير نظام الشركة	2017-02-09	2017-02-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.132457
3356	8310	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-09-07	2017-02-20	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:24.13272
3357	8310	تخفيض رأس المال المصرح به	2016-09-07	2017-02-20	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  320000000 الى  140000000	2025-12-25 15:06:24.132937
3358	6004	توزيع أرباح نقدية	2017-01-26	2017-02-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.133161
3359	4230	تغيير اسم الشركة	2017-01-12	2017-02-19	\N	\N	\N	SAR	تم تعديل اسم الشركة من Red Sea إلى Red Sea	2025-12-25 15:06:24.133393
3361	7204	تغيير اسم الشركة	2017-02-15	2017-02-15	\N	\N	\N	SAR	تم تعديل اسم الشركة من EREF Dubai إلى ENBD REIT	2025-12-25 15:06:24.133844
3362	2080	تغيير نظام الشركة	2017-01-19	2017-02-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.134154
3363	2080	توزيع أرباح نقدية	2016-12-14	2017-02-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.134381
3364	4031	تغيير نظام الشركة	2017-01-12	2017-02-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.134594
3365	4031	توزيع أرباح نقدية	2016-12-29	2017-02-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.134827
3366	6020	تغيير نظام الشركة	2016-12-13	2017-02-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.13504
3367	6020	تخفيض رأس المال المصرح به	2016-11-03	2017-02-14	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  500000000 الى  300000000	2025-12-25 15:06:24.135263
3368	6020	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-11-03	2017-02-14	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:24.135482
3369	2240	تغيير نظام الشركة	2017-01-05	2017-02-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.135696
3370	4280	استحواذ على شركة	2017-02-10	2017-02-10	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Walt Disney Co	2025-12-25 15:06:24.13592
3371	2220	تغيير نظام الشركة	2016-12-01	2017-02-09	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.136138
3372	2270	تغيير نظام الشركة	2017-01-17	2017-02-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.136376
3373	4009	تغيير نظام الشركة	2017-01-12	2017-02-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.136638
3374	3004	تغيير نظام الشركة	2017-01-10	2017-02-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.136862
3375	1820	توزيع أرباح نقدية	2017-01-22	2017-02-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.137074
3376	2360	توزيع أرباح نقدية	2017-01-18	2017-02-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.137305
3377	1820	تغيير نظام الشركة	2017-01-05	2017-01-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.137532
3378	4190	تغيير نظام الشركة	2016-12-22	2017-01-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.137755
3379	1213	تغيير نظام الشركة	2016-12-21	2017-01-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.137976
3380	4030	توزيع أرباح نقدية	2016-12-18	2017-01-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.138235
3381	7010	استحواذ على شركة	2015-12-27	2017-01-17	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Saudi Telecom Channels Co	2025-12-25 15:06:24.13847
3382	2120	تغيير نظام الشركة	2016-11-03	2017-01-16	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.138769
3383	2070	تغيير نظام الشركة	2016-12-12	2017-01-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.138999
3384	4012	الإندماج مع شركة	2016-11-30	2017-01-01	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من Aljedaie Fabrics Co	2025-12-25 15:06:24.139217
3385	3040	تغيير نظام الشركة	2016-11-27	2017-01-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.139438
3386	2170	توزيع أرباح نقدية	2016-11-13	2017-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.139707
3387	4280	توزيع أرباح نقدية	2016-02-22	2017-01-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.139963
3388	4008	توزيع أرباح نقدية	2016-10-17	2016-12-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.14032
3389	1320	تغيير نظام الشركة	2016-11-28	2016-12-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.140521
3390	2230	توزيع أرباح نقدية	2016-11-28	2016-12-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.140648
3391	1201	تغيير نظام الشركة	2016-11-28	2016-12-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.140845
3392	7010	استحواذ على شركة	2016-12-18	2016-12-19	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Careem Inc	2025-12-25 15:06:24.140969
3393	8110	تغيير نظام الشركة	2016-10-20	2016-12-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.141112
3394	1304	توزيع أرباح نقدية	2016-12-05	2016-12-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.141302
3395	2320	توزيع أرباح نقدية	2016-11-21	2016-12-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.141526
3396	2330	استحواذ على شركة	2016-07-10	2016-12-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع National Industrialization Co	2025-12-25 15:06:24.141677
3397	1040	تغيير نظام الشركة	2016-10-12	2016-11-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.141816
3398	9402	تغيير اسم الشركة	2016-10-12	2016-11-27	\N	\N	\N	SAR	تم تعديل اسم الشركة من SHC إلى Alawwal Invest	2025-12-25 15:06:24.141947
3399	1040	تغيير اسم الشركة	2016-10-12	2016-11-27	\N	\N	\N	SAR	تم تعديل اسم الشركة من SHB إلى Alawwal	2025-12-25 15:06:24.142085
3400	4011	تغيير نظام الشركة	2016-10-24	2016-11-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.142261
3401	4004	تغيير اسم الشركة	2016-10-20	2016-11-23	\N	\N	\N	SAR	تم تعديل اسم الشركة من Dallah Health إلى Dallah Healthcare	2025-12-25 15:06:24.832731
3402	4008	استحواذ على شركة	2015-10-28	2016-11-23	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Medscan Terminal Co LLC	2025-12-25 15:06:24.833376
3403	4110	تغيير نظام الشركة	2016-10-26	2016-11-22	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.833642
3404	4110	توزيع أسهم خزينة كأسهم منحة	2016-08-02	2016-11-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:24.833845
3405	1304	تغيير نظام الشركة	2016-10-12	2016-11-21	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.834072
3406	4004	تغيير نظام الشركة	2016-10-20	2016-11-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.834257
3407	6004	توزيع أرباح نقدية	2016-10-18	2016-11-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.834448
3408	8120	تغيير نظام الشركة	2016-10-31	2016-11-14	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.83464
3409	1202	تغيير نظام الشركة	2016-11-07	2016-11-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.834849
3410	4061	تغيير نظام الشركة	2016-08-29	2016-11-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.835029
3411	1214	توزيع أرباح نقدية	2016-10-17	2016-11-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.835221
3412	4190	توزيع أرباح نقدية	2016-10-17	2016-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.835412
3413	7010	توزيع أرباح نقدية	2016-10-19	2016-10-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.835633
3414	1302	توزيع أرباح نقدية	2016-10-19	2016-10-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.835958
3415	2050	توزيع أرباح نقدية	2016-10-20	2016-10-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.836285
3416	8012	تغيير نظام الشركة	2016-10-09	2016-10-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.836618
3417	3040	توزيع أرباح نقدية	2016-10-06	2016-10-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.836945
3418	8240	تغيير نظام الشركة	2016-08-09	2016-10-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.837277
3419	8240	تغيير اسم الشركة	2016-06-26	2016-10-19	\N	\N	\N	SAR	تم تعديل اسم الشركة من ACE إلى CHUBB	2025-12-25 15:06:24.83771
3420	8311	تغيير نظام الشركة	2016-04-13	2016-10-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.838035
3421	8311	تخفيض رأس المال المصرح به	2016-04-13	2016-10-19	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  400000000 الى  200000000	2025-12-25 15:06:24.838367
3422	8311	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-04-13	2016-10-19	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:24.838752
3423	4070	تغيير نظام الشركة	2016-08-09	2016-10-17	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.839099
3424	2330	توزيع أرباح نقدية	2016-10-04	2016-10-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.839561
3425	8180	توزيع أرباح نقدية	2016-08-14	2016-10-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.839897
3426	4090	توزيع أرباح نقدية	2016-09-25	2016-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.840169
3427	2080	توزيع أرباح نقدية	2016-09-20	2016-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.840428
3428	4280	توزيع أرباح نقدية	2016-02-22	2016-10-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.840632
3429	1810	استحواذ على شركة	2016-06-27	2016-09-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Equinox Ventures Ltd	2025-12-25 15:06:24.840835
3430	1201	تغيير نظام الشركة	2016-08-10	2016-09-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.841029
3431	1020	تغيير نظام الشركة	2016-08-02	2016-09-25	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.841223
3432	1201	زيادة رأس مال - إصدار حقوق أولوية	2015-12-17	2016-09-25	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:24.841428
3433	1201	زيادة رأس المال المصرح به	2015-12-17	2016-09-25	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  350000000 إلى  950000000	2025-12-25 15:06:24.841631
3434	3001	توزيع أرباح نقدية	2016-08-30	2016-09-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.841821
3435	2160	استحواذ على شركة	2016-06-15	2016-08-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Ameron Saudi Arabia Ltd	2025-12-25 15:06:24.842008
3436	2010	توزيع أرباح نقدية	2016-07-27	2016-08-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.842191
3437	2150	توزيع أرباح نقدية	2016-07-20	2016-08-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.842383
3438	1060	توزيع أرباح نقدية	2016-08-07	2016-08-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.842575
3439	3020	توزيع أرباح نقدية	2016-07-21	2016-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.842751
3440	3004	توزيع أرباح نقدية	2016-08-10	2016-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.842932
3441	4031	توزيع أرباح نقدية	2016-08-04	2016-08-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.84311
3442	4010	توزيع أرباح نقدية	2016-08-09	2016-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.843367
3443	4150	توزيع أرباح نقدية	2016-07-31	2016-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.843569
3444	1820	توزيع أرباح نقدية	2016-07-28	2016-08-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.843796
3445	4020	توزيع أرباح نقدية	2016-07-31	2016-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.844029
3446	4190	توزيع أرباح نقدية	2016-07-24	2016-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.844247
3447	1180	توزيع أرباح نقدية	2016-07-27	2016-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.844462
3448	8160	تغيير نظام الشركة	2016-06-29	2016-08-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.844676
3449	8160	تخفيض رأس مال - بتخفيض عدد الأسهم	2015-11-08	2016-08-03	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:24.844896
3450	8160	تخفيض رأس المال المصرح به	2015-11-08	2016-08-03	\N	\N	\N	SAR	تخفيض رأس مال المصرح به من  400000000 الى  265000000	2025-12-25 15:06:24.845112
3451	1302	توزيع أرباح نقدية	2016-07-27	2016-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.845328
3452	3003	توزيع أرباح نقدية	2016-07-26	2016-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.845541
3453	6004	توزيع أرباح نقدية	2016-07-20	2016-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.845755
3454	3060	توزيع أرباح نقدية	2016-06-22	2016-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.846105
3455	2050	توزيع أرباح نقدية	2016-07-28	2016-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.846349
3456	2240	توزيع أرباح نقدية	2016-07-27	2016-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.846586
3457	7010	توزيع أرباح نقدية	2016-07-26	2016-08-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.846809
3458	8300	زيادة رأس مال - إصدار حقوق أولوية	2015-04-15	2016-08-01	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:24.847056
3459	8300	تغيير نظام الشركة	2015-04-15	2016-08-01	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.847316
3460	8300	زيادة رأس المال المصرح به	2015-04-15	2016-08-01	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  100000000 إلى  200000000	2025-12-25 15:06:24.847562
3461	1301	توزيع أرباح نقدية	2016-07-19	2016-07-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.850794
3462	2330	توزيع أسهم خزينة كأسهم منحة	2016-05-17	2016-07-31	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:24.851024
3463	2330	زيادة رأس المال المصرح به	2016-05-17	2016-07-31	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1639950000 إلى  1967940000	2025-12-25 15:06:24.851234
3464	2330	تغيير نظام الشركة	2016-05-17	2016-07-31	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.851449
3465	3050	توزيع أرباح نقدية	2016-07-25	2016-07-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.851649
3466	1120	توزيع أرباح نقدية	2016-07-20	2016-07-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.851852
3467	3010	توزيع أرباح نقدية	2016-07-18	2016-07-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.852053
3468	1050	توزيع أرباح نقدية	2016-07-13	2016-07-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.852264
3469	1010	توزيع أرباح نقدية	2016-07-18	2016-07-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.852471
3470	6002	توزيع أرباح نقدية	2016-07-14	2016-07-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.852696
3471	3002	تغيير نظام الشركة	2016-06-23	2016-07-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.852906
3472	3040	توزيع أرباح نقدية	2016-06-23	2016-07-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.853119
3473	1090	توزيع أرباح نقدية	2016-06-30	2016-07-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.853342
3474	4130	تغيير نظام الشركة	2016-05-18	2016-07-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.853592
3475	4090	توزيع أرباح نقدية	2016-06-27	2016-07-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.853832
3476	1080	توزيع أرباح نقدية	2016-06-26	2016-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.854043
3477	2360	توزيع أرباح نقدية	2016-06-15	2016-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.854245
3478	2330	توزيع أرباح نقدية	2016-05-17	2016-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.854455
3479	4280	توزيع أرباح نقدية	2016-02-22	2016-07-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.854655
3480	2190	استحواذ على شركة	2016-05-03	2016-06-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Kindasa Water Services Co	2025-12-25 15:06:24.854867
3481	4009	توزيع أرباح نقدية	2016-04-20	2016-06-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.855067
3482	1810	استحواذ على شركة	2016-03-21	2016-06-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Wadi Middle East SARL	2025-12-25 15:06:24.855277
3483	1330	تغيير نظام الشركة	2016-06-02	2016-06-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.855488
3484	1330	زيادة رأس المال المصرح به	2016-04-19	2016-06-29	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  531250000 إلى  557812500	2025-12-25 15:06:24.855689
3485	1330	توزيع أسهم خزينة كأسهم منحة	2016-04-19	2016-06-29	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:24.855875
3486	2020	توزيع أرباح نقدية	2016-06-19	2016-06-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.856085
3487	1202	توزيع أرباح نقدية	2016-05-08	2016-06-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.856284
3488	2080	توزيع أرباح نقدية	2016-06-16	2016-06-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.856477
3489	3030	توزيع أرباح نقدية	2016-05-25	2016-06-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.856665
3490	2290	توزيع أرباح نقدية	2016-05-30	2016-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.856872
3491	1304	توزيع أرباح نقدية	2016-05-30	2016-06-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.857104
3492	1090	تغيير نظام الشركة	2016-05-11	2016-06-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.857314
3493	1090	توزيع أرباح نقدية	2015-12-29	2016-06-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.857511
3494	2260	توزيع أرباح نقدية	2015-12-08	2016-06-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.857695
3495	2270	تغيير نظام الشركة	2016-05-15	2016-06-02	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:24.857887
3496	2270	توزيع أرباح نقدية	2016-05-02	2016-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.858089
3497	8210	توزيع أرباح نقدية	2016-04-25	2016-06-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.858282
3498	1302	توزيع أرباح نقدية	2016-05-24	2016-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.858508
3499	4320	توزيع أرباح نقدية	2016-04-27	2016-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.860447
3500	4100	توزيع أرباح نقدية	2016-03-31	2016-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:24.860686
3501	8012	توزيع أرباح نقدية	2016-05-02	2016-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.654061
3502	4007	توزيع أرباح نقدية	2016-02-24	2016-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.676275
3503	2070	استحواذ على شركة	2016-01-20	2016-05-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Qassim Medical Services Co	2025-12-25 15:06:25.676623
3504	2220	توزيع أرباح نقدية	2015-12-07	2016-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.676976
3505	3002	توزيع أرباح نقدية	2016-05-11	2016-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.677354
3506	6004	توزيع أرباح نقدية	2016-05-10	2016-05-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.677694
3507	6040	توزيع أرباح نقدية	2016-02-21	2016-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.678095
3508	1210	توزيع أرباح نقدية	2016-04-10	2016-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.678453
3509	4031	توزيع أرباح نقدية	2016-04-26	2016-05-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.678816
3510	4008	توزيع أرباح نقدية	2016-04-19	2016-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.679173
3511	4260	تغيير نظام الشركة	2016-03-20	2016-05-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.679502
3512	4260	زيادة رأس المال المصرح به	2016-01-19	2016-05-08	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  508333340 إلى  610000010	2025-12-25 15:06:25.679855
3513	4260	توزيع أسهم خزينة كأسهم منحة	2016-01-19	2016-05-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:25.680182
3514	4260	توزيع أرباح نقدية	2016-01-19	2016-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.680612
3515	2150	توزيع أرباح نقدية	2015-12-24	2016-05-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.680938
3516	4190	توزيع أرباح نقدية	2016-04-18	2016-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.681265
3517	1040	تغيير نظام الشركة	2016-04-03	2016-05-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.681588
3518	2190	توزيع أرباح نقدية	2016-02-29	2016-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.68193
3519	4004	توزيع أرباح نقدية	2016-01-21	2016-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.682255
3520	1040	توزيع أرباح نقدية	2015-12-15	2016-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.682586
3521	1040	توزيع أسهم خزينة كأسهم منحة	2015-12-15	2016-05-03	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:25.682964
3522	1040	زيادة رأس المال المصرح به	2015-12-15	2016-05-03	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  11430720000	2025-12-25 15:06:25.683287
3523	8130	توزيع أرباح نقدية	2016-02-29	2016-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.683604
3524	3020	توزيع أرباح نقدية	2016-04-21	2016-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.683925
3525	7010	توزيع أرباح نقدية	2016-04-19	2016-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.68428
3526	3010	توزيع أرباح نقدية	2016-02-15	2016-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.684625
3527	4150	توزيع أرباح نقدية	2016-01-17	2016-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.684917
3528	3090	توزيع أرباح نقدية	2016-01-10	2016-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.685176
3529	4005	توزيع أرباح نقدية	2016-03-30	2016-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.685521
3530	2030	توزيع أرباح نقدية	2016-02-23	2016-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.685711
3531	2040	توزيع أرباح نقدية	2015-12-28	2016-04-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.685904
3532	4006	تغيير نظام الشركة	2016-03-27	2016-04-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.686115
3533	4290	توزيع أرباح نقدية	2016-02-17	2016-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.686348
3534	4006	توزيع أسهم خزينة كأسهم منحة	2016-02-17	2016-04-27	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:25.686546
3535	4006	زيادة رأس المال المصرح به	2016-02-17	2016-04-27	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  350000000 إلى  450000000	2025-12-25 15:06:25.686735
3536	4090	توزيع أرباح نقدية	2016-04-21	2016-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.686941
3537	5110	توزيع أرباح نقدية	2016-02-23	2016-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.720649
3538	6002	توزيع أرباح نقدية	2016-02-23	2016-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.720919
3539	2050	توزيع أرباح نقدية	2016-04-20	2016-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.721127
3540	3040	توزيع أرباح نقدية	2016-04-12	2016-04-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.721309
3541	4230	توزيع أرباح نقدية	2016-01-27	2016-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.721488
3542	4050	توزيع أرباح نقدية	2015-12-29	2016-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.721661
3543	1050	توزيع أرباح نقدية	2015-12-24	2016-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.721838
3544	7020	تغيير نظام الشركة	2016-03-23	2016-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.722011
3545	2050	تغيير نظام الشركة	2016-03-06	2016-04-20	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.722191
3546	2050	توزيع أرباح نقدية	2016-01-20	2016-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.722407
3547	2240	تغيير نظام الشركة	2016-03-20	2016-04-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.722586
3548	2240	توزيع أرباح نقدية	2015-12-21	2016-04-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.722773
3549	3003	تغيير نظام الشركة	2016-03-10	2016-04-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.722952
3550	2140	تغيير نظام الشركة	2016-02-29	2016-04-18	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.72318
3551	3003	توزيع أرباح نقدية	2016-02-04	2016-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.723363
3552	2340	توزيع أرباح نقدية	2016-02-25	2016-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.723541
3553	1140	تغيير نظام الشركة	2016-03-15	2016-04-12	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.723732
3554	1140	توزيع أسهم خزينة كأسهم منحة	2016-02-01	2016-04-12	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:25.723974
3555	1140	زيادة رأس المال المصرح به	2016-02-01	2016-04-12	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  6000000000	2025-12-25 15:06:25.72429
3556	4040	توزيع أرباح نقدية	2016-01-05	2016-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.724659
3557	4080	توزيع أرباح نقدية	2015-12-22	2016-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.724867
3558	2010	توزيع أرباح نقدية	2015-12-16	2016-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.725094
3559	2090	توزيع أرباح نقدية	2016-02-23	2016-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.72529
3560	4020	توزيع أرباح نقدية	2016-02-22	2016-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.725485
3561	6010	تغيير نظام الشركة	2016-03-07	2016-04-10	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.72569
3562	6010	توزيع أسهم خزينة كأسهم منحة	2016-01-17	2016-04-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:25.72589
3563	6010	توزيع أرباح نقدية	2016-01-17	2016-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.726108
3564	2360	تغيير نظام الشركة	2016-02-28	2016-04-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.726295
3565	4030	توزيع أرباح نقدية	2015-12-24	2016-04-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.726511
3566	1010	توزيع أرباح نقدية	2015-12-31	2016-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.726699
3567	1180	توزيع أرباح نقدية	2015-12-24	2016-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.727597
3568	1030	تغيير نظام الشركة	2016-03-10	2016-04-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.727798
3569	2160	توزيع أرباح نقدية	2016-02-14	2016-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.728086
3570	4002	توزيع أرباح نقدية	2016-01-25	2016-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.728439
3571	7010	توزيع أرباح نقدية	2016-01-20	2016-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.728787
3572	1030	توزيع أرباح نقدية	2015-12-13	2016-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.729101
3573	1030	توزيع أسهم خزينة كأسهم منحة	2015-12-13	2016-04-05	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:25.729415
3574	1030	زيادة رأس المال المصرح به	2015-12-13	2016-04-05	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  7000000000	2025-12-25 15:06:25.729727
3575	2280	تغيير نظام الشركة	2016-02-25	2016-04-04	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.730851
3576	2280	زيادة رأس المال المصرح به	2016-02-25	2016-04-04	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  8000000000	2025-12-25 15:06:25.731184
3577	2070	توزيع أرباح نقدية	2016-02-16	2016-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.731544
3578	3060	توزيع أرباح نقدية	2016-01-28	2016-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.731873
3579	6070	توزيع أرباح نقدية	2015-12-17	2016-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.732282
3580	2280	توزيع أرباح نقدية	2015-12-14	2016-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.732606
3581	2280	توزيع أسهم خزينة كأسهم منحة	2015-12-14	2016-04-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:25.732935
3582	2080	توزيع أرباح نقدية	2016-03-22	2016-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.733249
3583	2330	توزيع أرباح نقدية	2016-03-02	2016-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.73357
3584	2360	توزيع أرباح نقدية	2016-02-21	2016-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.734138
3585	2290	توزيع أرباح نقدية	2015-12-24	2016-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.734449
3586	1301	توزيع أرباح نقدية	2016-02-24	2016-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.734748
3587	4280	توزيع أرباح نقدية	2016-02-22	2016-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.73512
3588	2020	توزيع أرباح نقدية	2015-12-06	2016-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.735458
3589	3002	تغيير نظام الشركة	2016-03-03	2016-03-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.735644
3590	1060	تغيير نظام الشركة	2016-02-29	2016-03-30	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.735866
3591	3080	توزيع أرباح نقدية	2016-02-23	2016-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.736213
3592	4010	توزيع أرباح نقدية	2016-02-15	2016-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.736555
3593	3001	توزيع أرباح نقدية	2016-02-10	2016-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.736893
3594	3002	توزيع أرباح نقدية	2015-12-29	2016-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.737205
3595	1060	توزيع أرباح نقدية	2015-12-27	2016-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.737506
3596	6001	توزيع أرباح نقدية	2015-12-21	2016-03-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.73783
3597	4090	توزيع أرباح نقدية	2016-02-17	2016-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.738142
3598	1120	توزيع أرباح نقدية	2016-01-21	2016-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.738443
3599	1150	توزيع أرباح نقدية	2015-12-21	2016-03-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:25.738767
3600	2310	تغيير نظام الشركة	2016-03-01	2016-03-28	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:25.739075
3601	4001	توزيع أرباح نقدية	2016-02-23	2016-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.673747
3602	1080	تغيير نظام الشركة	2016-02-25	2016-03-27	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.674407
3603	3030	توزيع أرباح نقدية	2016-02-07	2016-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.674766
3604	1080	توزيع أرباح نقدية	2015-12-08	2016-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.675109
3605	8010	توزيع أرباح نقدية	2016-02-21	2016-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.67544
3606	3050	توزيع أرباح نقدية	2016-01-18	2016-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.675801
3607	3004	توزيع أرباح نقدية	2016-01-26	2016-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.67613
3608	6004	توزيع أرباح نقدية	2016-03-06	2016-03-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.67649
3609	1810	تغيير نظام الشركة	2016-02-14	2016-03-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.676906
3610	1810	زيادة رأس المال المصرح به	2015-08-16	2016-03-13	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  2000000000 إلى  2096500000	2025-12-25 15:06:26.677265
3611	1810	زيادة رأس مال - اكتتاب خاص	2015-08-16	2016-03-13	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:26.677666
3612	1820	توزيع أرباح نقدية	2016-02-24	2016-03-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.678006
3613	1302	توزيع أرباح نقدية	2016-03-02	2016-03-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.679024
3614	4200	تغيير نظام الشركة	2016-01-21	2016-03-03	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.679326
3615	4200	توزيع أرباح نقدية	2016-01-18	2016-03-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.679626
3616	2330	توزيع أرباح نقدية	2015-11-22	2016-03-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.679854
3617	3020	توزيع أرباح نقدية	2016-01-26	2016-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.680078
3618	3040	توزيع أرباح نقدية	2016-01-26	2016-02-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.680313
3669	2330	توزيع أرباح نقدية	2015-09-13	2015-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.695635
3619	8011	تغيير نظام الشركة	2016-01-20	2016-02-23	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.680618
3620	8011	زيادة رأس مال - إصدار حقوق أولوية	2015-04-27	2016-02-23	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:26.681065
3621	7010	استحواذ على شركة	2015-11-19	2016-02-18	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Kuwait Telecommunications Co	2025-12-25 15:06:26.681341
3622	4190	توزيع أرباح نقدية	2016-02-04	2016-02-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.681619
3623	4031	توزيع أرباح نقدية	2016-02-07	2016-02-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.682208
3624	1810	استحواذ على شركة	2016-02-14	2016-02-12	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Jumia Middle East	2025-12-25 15:06:26.682511
3625	2230	توزيع أرباح نقدية	2016-01-24	2016-02-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.682777
3626	2310	استحواذ على شركة	2015-06-24	2016-02-08	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع International Vinyl Acetate Co Ltd	2025-12-25 15:06:26.683042
3627	2310	استحواذ على شركة	2015-06-24	2016-02-08	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع International Acetyl Co Ltd	2025-12-25 15:06:26.683317
3628	2360	توزيع أرباح نقدية	2015-12-14	2016-01-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.683583
3629	4280	توزيع أرباح نقدية	2015-02-23	2016-01-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.68388
3630	8011	تغيير اسم الشركة	2015-12-02	2016-01-01	\N	\N	\N	SAR	تم تعديل اسم الشركة من ANB Insurance إلى Metlife AIG ANB	2025-12-25 15:06:26.684164
3631	1020	تغيير نظام الشركة	2015-11-29	2015-12-29	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.684441
3632	2080	توزيع أرباح نقدية	2015-12-15	2015-12-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.68471
3633	8210	توزيع أسهم خزينة كأسهم منحة	2015-08-25	2015-12-08	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:26.684967
3634	8210	تغيير نظام الشركة	2015-08-25	2015-12-08	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.685228
3635	1810	استحواذ على شركة	2015-12-07	2015-12-06	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع AlMosafer Co	2025-12-25 15:06:26.6855
3636	4230	تغيير نظام الشركة	2015-12-06	2015-12-06	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.685747
3637	1303	توزيع أرباح نقدية	2015-11-19	2015-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.686018
3638	2340	توزيع أرباح نقدية	2015-11-17	2015-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.686285
3639	3020	توزيع أرباح نقدية	2015-10-20	2015-12-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.686557
3640	4008	توزيع أرباح نقدية	2015-10-15	2015-11-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.686823
3641	2070	استحواذ على شركة	2015-05-04	2015-11-29	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع .	2025-12-25 15:06:26.687081
3642	3030	تغيير نظام الشركة	2015-10-15	2015-11-19	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.687337
3643	2320	توزيع أرباح نقدية	2015-10-29	2015-11-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.687593
3644	1302	تغيير نظام الشركة	2015-07-30	2015-11-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.687846
3645	1302	توزيع أسهم خزينة كأسهم منحة	2015-07-30	2015-11-11	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:26.688118
3646	1810	استحواذ على شركة	2015-11-10	2015-11-09	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Careem Inc	2025-12-25 15:06:26.6884
3647	3003	توزيع أرباح نقدية	2015-10-29	2015-11-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.688659
3648	4031	توزيع أرباح نقدية	2015-10-26	2015-11-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.688914
3649	6004	توزيع أرباح نقدية	2015-10-21	2015-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.689166
3650	7010	توزيع أرباح نقدية	2015-10-19	2015-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.690227
3651	2360	توزيع أرباح نقدية	2015-10-06	2015-11-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.690536
3652	4190	توزيع أرباح نقدية	2015-10-19	2015-10-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.690827
3653	1323	استحواذ على شركة	2015-10-28	2015-10-28	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع National Packing Products Co Ltd	2025-12-25 15:06:26.691094
3654	4050	تغيير نظام الشركة	2015-09-14	2015-10-26	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.691378
3655	1302	توزيع أرباح نقدية	2015-10-20	2015-10-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.691731
3656	2050	توزيع أرباح نقدية	2015-10-19	2015-10-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.692053
3657	3040	توزيع أرباح نقدية	2015-10-12	2015-10-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.69234
3658	3090	تغيير نظام الشركة	2015-10-08	2015-10-15	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.692621
3659	4004	توزيع أسهم خزينة كأسهم منحة	2015-02-19	2015-10-13	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:26.692871
3660	4004	تغيير نظام الشركة	2015-02-19	2015-10-13	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.693131
3661	4004	زيادة رأس المال المصرح به	2015-02-19	2015-10-13	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  472000000 إلى  590000000	2025-12-25 15:06:26.693412
3662	1202	تغيير نظام الشركة	2015-08-30	2015-10-11	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.693662
3663	4280	استحواذ على شركة	2015-10-07	2015-10-07	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Twitter Inc	2025-12-25 15:06:26.694027
3664	7040	تغيير نظام الشركة	2015-07-28	2015-10-07	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.694313
3665	4031	توزيع أرباح نقدية	2015-08-25	2015-10-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.694566
3666	2080	توزيع أرباح نقدية	2015-09-15	2015-10-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.694821
3667	4031	تغيير نظام الشركة	2015-08-25	2015-10-05	\N	\N	\N	SAR	تمت الموافقة على تغيير النظام الأساسي للشركة	2025-12-25 15:06:26.695081
3668	4090	توزيع أرباح نقدية	2015-09-29	2015-10-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.695358
3670	4020	توزيع أرباح نقدية	2015-09-02	2015-09-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.695972
3671	2150	توزيع أرباح نقدية	2015-08-12	2015-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.696294
3672	3060	توزيع أرباح نقدية	2015-08-09	2015-08-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.696517
3673	3002	توزيع أرباح نقدية	2015-08-10	2015-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.696756
3674	2010	توزيع أرباح نقدية	2015-07-26	2015-08-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.696978
3675	3001	توزيع أرباح نقدية	2015-08-09	2015-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.697196
3676	6004	توزيع أرباح نقدية	2015-08-04	2015-08-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.697406
3677	1810	استحواذ على شركة	2015-08-13	2015-08-13	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Equinox Group Ltd	2025-12-25 15:06:26.697709
3678	4010	توزيع أرباح نقدية	2015-08-05	2015-08-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.697921
3679	1302	توزيع أرباح نقدية	2015-07-30	2015-08-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.698127
3680	8090	تغيير اسم الشركة	2015-08-05	2015-08-05	\N	\N	\N	SAR	تم تعديل اسم الشركة من Sanad إلى Sanad	2025-12-25 15:06:26.69835
3681	4003	توزيع أرباح نقدية	2015-07-29	2015-08-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.698574
3682	8312	زيادة رأس المال المصرح به	2014-10-26	2015-08-05	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  450000000	2025-12-25 15:06:26.698796
3683	8312	زيادة رأس مال - إصدار حقوق أولوية	2014-10-26	2015-08-05	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:26.699036
3684	7010	توزيع أرباح نقدية	2015-07-05	2015-08-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.699364
3685	2050	توزيع أرباح نقدية	2015-07-28	2015-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.70753
3686	1820	توزيع أرباح نقدية	2015-07-15	2015-08-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.707827
3687	1301	توزيع أرباح نقدية	2015-07-22	2015-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.708022
3688	2240	توزيع أرباح نقدية	2015-07-22	2015-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.70821
3689	3004	توزيع أرباح نقدية	2015-07-22	2015-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.708648
3690	3020	توزيع أرباح نقدية	2015-07-09	2015-08-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.708971
3691	4190	توزيع أرباح نقدية	2015-07-15	2015-07-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.709225
3692	2380	توزيع أرباح نقدية	2015-07-01	2015-07-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.709437
3693	6002	توزيع أرباح نقدية	2015-07-09	2015-07-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.709634
3694	1050	توزيع أرباح نقدية	2015-07-09	2015-07-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.709891
3695	3010	توزيع أرباح نقدية	2015-07-09	2015-07-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.710088
3696	1060	توزيع أرباح نقدية	2015-07-09	2015-07-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.710277
3697	3040	توزيع أرباح نقدية	2015-07-12	2015-07-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.710459
3698	1120	توزيع أرباح نقدية	2015-07-08	2015-07-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.710647
3699	3050	توزيع أرباح نقدية	2015-07-12	2015-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.710882
3700	1180	توزيع أرباح نقدية	2015-07-09	2015-07-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:26.71113
3701	2020	توزيع أرباح نقدية	2015-07-05	2015-07-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.502212
3702	1320	توزيع أرباح نقدية	2015-07-07	2015-07-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.502901
3703	1090	توزيع أرباح نقدية	2015-07-07	2015-07-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.50362
3704	1010	توزيع أرباح نقدية	2015-07-05	2015-07-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.503945
3705	2310	توزيع أرباح نقدية	2015-06-29	2015-07-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.504201
3706	4090	توزيع أرباح نقدية	2015-06-28	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.520162
3707	1080	توزيع أرباح نقدية	2015-06-23	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.520655
3708	2080	توزيع أرباح نقدية	2015-06-16	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.520845
3709	2330	توزيع أرباح نقدية	2015-05-26	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.52103
3710	3030	توزيع أرباح نقدية	2015-05-25	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.521237
3711	2270	توزيع أرباح نقدية	2015-05-17	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.521498
3712	4240	توزيع أرباح نقدية	2015-04-27	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.521734
3713	2360	توزيع أرباح نقدية	2015-04-06	2015-07-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.52198
3714	8050	زيادة رأس مال - إصدار حقوق أولوية	2014-06-15	2015-07-01	\N	\N	\N	SAR	زياده راس المال من 100,000,000  الى 250,000,000  من خلال اصدار 15,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:27.522203
3715	2230	توزيع أرباح نقدية	2015-05-14	2015-06-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.52363
3716	2290	توزيع أرباح نقدية	2015-06-09	2015-06-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.523978
3717	4006	توزيع أرباح نقدية	2015-04-30	2015-06-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.524229
3718	1330	توزيع أرباح نقدية	2015-04-13	2015-06-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.524517
3719	4100	توزيع أرباح نقدية	2015-04-06	2015-06-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.524761
3720	2140	استحواذ على شركة	2015-06-03	2015-06-02	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Ahsa Medical Services Co	2025-12-25 15:06:27.524971
3721	3020	توزيع أرباح نقدية	2015-04-15	2015-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.5252
3722	8100	زيادة رأس مال - إصدار حقوق أولوية	2014-02-19	2015-06-01	\N	\N	\N	SAR	زياده راس المال من 100,000,000  الى 250,000,000  من خلال اصدار 15,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:27.525435
3723	1302	توزيع أرباح نقدية	2015-04-19	2015-05-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.525659
3724	1214	توزيع أسهم خزينة كأسهم منحة	2015-03-29	2015-05-24	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:27.525846
3725	6004	توزيع أرباح نقدية	2015-05-07	2015-05-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.526671
3726	1303	توزيع أرباح نقدية	2015-04-21	2015-05-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.526942
3727	4110	توزيع أرباح نقدية	2014-12-31	2015-05-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-06-07 توزيع 0.5 SAR	2025-12-25 15:06:27.527299
3728	4110	استحواذ على شركة	2015-01-25	2015-05-07	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Arabian Security and Safety Services Co	2025-12-25 15:06:27.527662
3729	4050	توزيع أسهم خزينة كأسهم منحة	2014-04-27	2015-05-07	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 540,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:27.527914
3730	4050	زيادة رأس المال المصرح به	2014-04-27	2015-05-07	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  450000000 إلى  540000000	2025-12-25 15:06:27.528149
3731	2190	توزيع أرباح نقدية	2015-01-19	2015-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.528416
3732	2220	توزيع أرباح نقدية	2014-12-17	2015-05-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.528636
3733	4190	توزيع أرباح نقدية	2015-04-16	2015-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.528913
3734	2030	توزيع أرباح نقدية	2015-02-23	2015-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.529251
3735	6002	توزيع أرباح نقدية	2015-02-18	2015-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.529516
3736	1210	توزيع أرباح نقدية	2015-01-19	2015-04-29	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.530089
3737	2040	توزيع أرباح نقدية	2014-12-30	2015-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-05-11 توزيع 2.0 SAR	2025-12-25 15:06:27.533923
3738	2040	توزيع أسهم خزينة كأسهم منحة	2014-12-30	2015-04-28	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:27.538333
3739	8060	زيادة رأس مال - إصدار حقوق أولوية	2014-04-24	2015-04-28	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:27.538801
3740	7010	توزيع أرباح نقدية	2015-04-20	2015-04-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.539159
3741	3040	توزيع أرباح نقدية	2015-04-21	2015-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.53951
3742	4003	توزيع أرباح نقدية	2015-04-20	2015-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.54005
3743	4260	توزيع أسهم خزينة كأسهم منحة	2015-01-19	2015-04-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:27.540488
3744	4260	توزيع أرباح نقدية	2015-01-19	2015-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.540865
3745	4150	توزيع أرباح نقدية	2015-01-15	2015-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.541143
3746	2050	توزيع أرباح نقدية	2015-04-19	2015-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.54144
3747	4290	توزيع أسهم خزينة كأسهم منحة	2015-02-17	2015-04-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:27.541832
3748	4290	توزيع أرباح نقدية	2015-02-17	2015-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.542389
3749	4290	زيادة رأس المال المصرح به	2015-02-17	2015-04-22	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  350000000 إلى  400000000	2025-12-25 15:06:27.542971
3750	4040	توزيع أرباح نقدية	2015-02-23	2015-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.544882
3751	8180	توزيع أرباح نقدية	2015-02-22	2015-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.546617
3752	2150	توزيع أرباح نقدية	2014-12-25	2015-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.547114
3753	2120	توزيع أرباح نقدية	2014-12-23	2015-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.547391
3754	2120	توزيع أسهم خزينة كأسهم منحة	2014-10-28	2015-04-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:27.547648
3755	1050	توزيع أرباح نقدية	2015-01-07	2015-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.547888
3756	1140	زيادة رأس المال المصرح به	2015-01-08	2015-04-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  500000000	2025-12-25 15:06:27.548197
3757	4090	توزيع أرباح نقدية	2015-04-09	2015-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.54844
3758	3060	توزيع أرباح نقدية	2015-02-04	2015-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.548718
3759	4090	توزيع أرباح نقدية	2015-02-19	2015-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.549063
3760	2060	توزيع أرباح نقدية	2015-02-18	2015-04-09	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.549329
3761	4010	توزيع أرباح نقدية	2015-02-22	2015-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.549859
3762	8160	زيادة رأس مال - إصدار حقوق أولوية	2013-11-05	2015-04-08	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:27.550267
3763	2020	زيادة رأس المال المصرح به	2015-01-05	2015-04-07	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  4166666660	2025-12-25 15:06:27.550506
3764	3010	توزيع أرباح نقدية	2015-01-01	2015-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.550754
3765	6001	توزيع أرباح نقدية	2014-12-23	2015-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.550976
3766	2340	توزيع أرباح نقدية	2015-02-09	2015-04-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.551365
3767	1320	توزيع أرباح نقدية	2015-02-24	2015-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.551784
3768	7010	توزيع أرباح نقدية	2015-01-19	2015-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.552094
3769	4080	توزيع أرباح نقدية	2014-12-21	2015-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-04-20 توزيع 1.0 SAR	2025-12-25 15:06:27.552456
3770	4030	توزيع أرباح نقدية	2014-12-11	2015-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-04-15 توزيع 1.0 SAR	2025-12-25 15:06:27.552881
3771	2330	توزيع أرباح نقدية	2015-03-11	2015-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.555677
3772	2360	توزيع أرباح نقدية	2015-02-18	2015-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.555996
3773	3080	توزيع أرباح نقدية	2015-02-15	2015-04-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.556215
3774	4280	توزيع أرباح نقدية	2015-02-23	2015-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.556481
3775	4020	توزيع أرباح نقدية	2015-02-22	2015-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.556743
3776	2060	استحواذ على شركة	2014-09-28	2015-03-31	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع National Titanium Dioxide Co Ltd	2025-12-25 15:06:27.556954
3777	2260	توزيع أرباح نقدية	2014-12-24	2015-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-04-02 توزيع 0.85 SAR	2025-12-25 15:06:27.558414
3778	3050	توزيع أرباح نقدية	2015-01-28	2015-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.558651
3779	1090	زيادة رأس المال المصرح به	2015-01-27	2015-03-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  20000000000	2025-12-25 15:06:27.558914
3780	1090	توزيع أرباح نقدية	2014-12-28	2015-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-03-31 توزيع 0.7 SAR	2025-12-25 15:06:27.559117
3781	2140	استحواذ على شركة	2015-03-18	2015-03-18	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Ahsa Medical Services Co	2025-12-25 15:06:27.559338
3782	1040	زيادة رأس المال المصرح به	2014-12-17	2015-03-18	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  5715360000	2025-12-25 15:06:27.55957
3783	1040	توزيع أرباح نقدية	2014-12-17	2015-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-03-29 توزيع 1.0 SAR	2025-12-25 15:06:27.559777
3784	1040	توزيع أسهم خزينة كأسهم منحة	2014-12-17	2015-03-18	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 5,715,360,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:27.559986
3785	1080	توزيع أرباح نقدية	2014-12-25	2015-03-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-03-25 توزيع 0.55 SAR	2025-12-25 15:06:27.560187
3786	1201	استحواذ على شركة	2014-07-22	2015-03-17	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Saudi Plastic Packaging Systems Co. Ltd	2025-12-25 15:06:27.560378
3787	7050	إلغاء الإدراج	2015-03-12	2015-03-12	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2015-03-12	2025-12-25 15:06:27.560571
3788	1060	زيادة رأس المال المصرح به	2014-12-24	2015-03-12	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  15000000000	2025-12-25 15:06:27.560797
3789	1060	توزيع أرباح نقدية	2014-12-24	2015-03-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-03-18 توزيع 1.05 SAR	2025-12-25 15:06:27.56107
3790	1060	توزيع أسهم خزينة كأسهم منحة	2014-12-24	2015-03-12	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 15,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:27.561339
3791	1214	استحواذ على شركة	2014-12-29	2015-03-10	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Energy Management Services Emirates LLC	2025-12-25 15:06:27.561505
3792	1030	توزيع أرباح نقدية	2014-12-04	2015-03-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-03-10 توزيع 0.8 SAR	2025-12-25 15:06:27.561754
3793	1030	توزيع أسهم خزينة كأسهم منحة	2014-12-04	2015-03-09	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:27.561904
3794	1030	زيادة رأس المال المصرح به	2014-12-04	2015-03-09	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  6500000000	2025-12-25 15:06:27.562058
3795	3040	توزيع أرباح نقدية	2015-02-04	2015-03-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.562204
3796	1810	زيادة رأس المال المصرح به	2015-01-14	2015-03-05	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1500000000 إلى  2000000000	2025-12-25 15:06:27.562334
3797	1120	توزيع أرباح نقدية	2015-01-15	2015-03-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.56246
3798	7030	تخفيض رأس مال - بتخفيض عدد الأسهم	2014-11-27	2015-02-26	\N	\N	\N	SAR	تخفيض رأس المال من   10,801,000,000  الى 5,837,291,750  وعدد الاسهم الى 583,729,175 بقيمة اسمية للسهم 10 	2025-12-25 15:06:27.562589
3799	4190	توزيع أرباح نقدية	2015-02-05	2015-02-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:27.562717
3800	8250	زيادة رأس مال - إصدار حقوق أولوية	2012-06-27	2015-02-11	\N	\N	\N	SAR	زياده راس المال من 200,000,000  الى 450,000,000  من خلال اصدار 25,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:27.562842
3801	1302	توزيع أرباح نقدية	2015-02-02	2015-02-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:28.319841
3802	8280	زيادة رأس مال - إصدار حقوق أولوية	2014-04-24	2015-01-07	\N	\N	\N	SAR	زياده راس المال من 200,000,000  الى 400,000,000  من خلال اصدار 20,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:28.325652
3803	4280	توزيع أرباح نقدية	2014-02-24	2015-01-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-01-14 توزيع 0.12 SAR	2025-12-25 15:06:28.32669
3804	1182	تغيير اسم الشركة	2014-12-31	2014-12-31	\N	\N	\N	SAR	تم تعديل اسم الشركة من Amlak إلى Amlak	2025-12-25 15:06:28.327651
3805	2340	توزيع أرباح نقدية	2014-12-10	2014-12-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-12-18 توزيع 1.5 SAR	2025-12-25 15:06:28.328886
3806	4030	الإندماج مع شركة	2012-11-05	2014-12-15	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من Vela International Marine Ltd	2025-12-25 15:06:28.329468
3807	4050	توزيع أرباح نقدية	2014-11-27	2014-12-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-12-17 توزيع 0.75 SAR	2025-12-25 15:06:28.329834
3808	4010	تغيير اسم الشركة	2014-11-12	2014-11-12	\N	\N	\N	SAR	تم تعديل اسم الشركة من SHARCO إلى Dur	2025-12-25 15:06:28.330152
3809	1214	استحواذ على شركة	2014-09-11	2014-11-10	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Asda Gulf Trading Co	2025-12-25 15:06:28.330475
3810	4090	توزيع أرباح نقدية	2014-11-02	2014-11-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-11-18 توزيع 0.3 SAR	2025-12-25 15:06:28.330768
3811	2200	استحواذ على شركة	2010-06-15	2014-11-04	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Arabian-Yadong Coating Co Ltd	2025-12-25 15:06:28.331062
3812	3003	توزيع أرباح نقدية	2014-10-30	2014-11-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-11-20 توزيع 1.0 SAR	2025-12-25 15:06:28.331365
3813	2120	استحواذ على شركة	2014-06-12	2014-11-02	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Masar Alnumou Finance Co	2025-12-25 15:06:28.332188
3814	4003	توزيع أرباح نقدية	2014-10-27	2014-10-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-11-06 توزيع 1.0 SAR	2025-12-25 15:06:28.332612
3815	6004	توزيع أرباح نقدية	2014-10-22	2014-10-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-11-09 توزيع 1.75 SAR	2025-12-25 15:06:28.332921
3816	2260	تغيير اسم الشركة	2014-10-29	2014-10-29	\N	\N	\N	SAR	تم تعديل اسم الشركة من Petrochemical إلى Sahara	2025-12-25 15:06:28.333484
3817	4260	استحواذ على شركة	2014-08-03	2014-10-23	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Jozoor Al Raskha Trucking Co Ltd	2025-12-25 15:06:28.333803
3818	4280	توزيع أرباح نقدية	2014-02-24	2014-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-10-14 توزيع 0.12 SAR	2025-12-25 15:06:28.334149
3819	2080	توزيع أرباح نقدية	2014-09-16	2014-09-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-10-01 توزيع 0.45 SAR	2025-12-25 15:06:28.334455
3820	4240	استحواذ على شركة	2014-09-15	2014-09-15	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Danah Trading Group	2025-12-25 15:06:28.334747
3821	4020	توزيع أرباح نقدية	2014-09-08	2014-09-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-09-30 توزيع 0.5 SAR	2025-12-25 15:06:28.335121
3822	1810	توزيع أرباح نقدية	2014-08-06	2014-08-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-09-08 توزيع 2.0 SAR	2025-12-25 15:06:28.335378
3823	9586	تغيير اسم الشركة	2013-11-18	2014-08-17	\N	\N	\N	SAR	تم تعديل اسم الشركة من Osool Capital إلى OBIC	2025-12-25 15:06:28.335693
3824	9586	الإندماج مع شركة	2013-11-18	2014-08-17	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من Bakheet Investment Group	2025-12-25 15:06:28.336068
3825	1820	توزيع أرباح نقدية	2014-07-17	2014-08-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-31 توزيع 1.25 SAR	2025-12-25 15:06:28.336376
3826	4110	توزيع أرباح نقدية	2014-07-13	2014-08-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-20 توزيع 0.5 SAR	2025-12-25 15:06:28.337348
3827	6004	توزيع أرباح نقدية	2014-07-22	2014-08-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-19 توزيع 1.75 SAR	2025-12-25 15:06:28.338325
3828	1301	توزيع أرباح نقدية	2014-07-21	2014-08-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-26 توزيع 1.25 SAR	2025-12-25 15:06:28.338669
3829	3060	توزيع أرباح نقدية	2014-07-10	2014-08-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-17 توزيع 1.5 SAR	2025-12-25 15:06:28.339301
3830	4003	توزيع أرباح نقدية	2014-07-22	2014-08-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-14 توزيع 1.0 SAR	2025-12-25 15:06:28.339728
3831	4190	توزيع أرباح نقدية	2014-07-16	2014-08-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-14 توزيع 1.2 SAR	2025-12-25 15:06:28.340075
3832	1201	استحواذ على شركة	2014-04-16	2014-08-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع AYYAN Investment Co.	2025-12-25 15:06:28.340392
3833	4090	توزيع أرباح نقدية	2014-07-23	2014-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-18 توزيع 1.0 SAR	2025-12-25 15:06:28.34073
3834	7020	توزيع أرباح نقدية	2014-07-21	2014-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-11 توزيع 1.25 SAR	2025-12-25 15:06:28.34102
3835	7010	توزيع أرباح نقدية	2014-07-21	2014-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-21 توزيع 0.75 SAR	2025-12-25 15:06:28.34131
3836	2240	توزيع أرباح نقدية	2014-07-21	2014-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-21 توزيع 1.0 SAR	2025-12-25 15:06:28.341625
3837	3050	توزيع أرباح نقدية	2014-07-17	2014-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-10-19 توزيع 2.0 SAR	2025-12-25 15:06:28.341924
3838	6002	توزيع أرباح نقدية	2014-07-15	2014-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-24 توزيع 1.5 SAR	2025-12-25 15:06:28.342211
3839	4050	توزيع أرباح نقدية	2014-07-16	2014-07-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-14 توزيع 0.75 SAR	2025-12-25 15:06:28.34348
3840	2050	توزيع أرباح نقدية	2014-07-16	2014-07-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-11 توزيع 0.5 SAR	2025-12-25 15:06:28.343866
3841	3001	توزيع أرباح نقدية	2014-07-17	2014-07-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-17 توزيع 0.5 SAR	2025-12-25 15:06:28.344222
3842	3010	توزيع أرباح نقدية	2014-07-16	2014-07-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-07 توزيع 1.75 SAR	2025-12-25 15:06:28.344607
3843	1120	توزيع أرباح نقدية	2014-07-15	2014-07-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-24 توزيع 1.0 SAR	2025-12-25 15:06:28.345001
3844	4010	توزيع أرباح نقدية	2014-07-14	2014-07-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-03 توزيع 0.5 SAR	2025-12-25 15:06:28.345423
3845	1080	توزيع أرباح نقدية	2014-07-13	2014-07-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-12 توزيع 0.45 SAR	2025-12-25 15:06:28.34571
3846	1050	توزيع أرباح نقدية	2014-07-09	2014-07-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-12 توزيع 0.45 SAR	2025-12-25 15:06:28.345976
3847	3040	توزيع أرباح نقدية	2014-07-13	2014-07-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-24 توزيع 3.0 SAR	2025-12-25 15:06:28.346229
3848	3090	توزيع أرباح نقدية	2014-06-30	2014-07-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-08-17 توزيع 1.0 SAR	2025-12-25 15:06:28.346503
3849	3020	توزيع أرباح نقدية	2014-07-08	2014-07-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-23 توزيع 1.5 SAR	2025-12-25 15:06:28.346771
3850	4240	توزيع أسهم خزينة كأسهم منحة	2014-04-21	2014-07-15	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,100,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:28.34707
3851	4240	زيادة رأس المال المصرح به	2014-04-21	2014-07-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1050000000 إلى  2100000000	2025-12-25 15:06:28.347349
3852	2080	توزيع أرباح نقدية	2014-07-01	2014-07-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-15 توزيع 0.4 SAR	2025-12-25 15:06:28.347628
4179	4003	إدراج الشركة	2011-12-24	2011-12-24	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2011-12-24	2025-12-25 15:06:30.621168
3853	1090	توزيع أرباح نقدية	2014-07-03	2014-07-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-13 توزيع 0.65 SAR	2025-12-25 15:06:28.347922
3854	2310	توزيع أرباح نقدية	2014-06-29	2014-07-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-17 توزيع 0.6 SAR	2025-12-25 15:06:28.348685
3855	6002	توزيع أسهم خزينة كأسهم منحة	2014-05-20	2014-07-07	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 462,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:28.34898
3856	1302	توزيع أرباح نقدية	2014-07-01	2014-07-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-23 توزيع 0.5 SAR	2025-12-25 15:06:28.349266
3857	3030	توزيع أرباح نقدية	2014-06-01	2014-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-09 توزيع 3.5 SAR	2025-12-25 15:06:28.349548
3858	8140	زيادة رأس مال - إصدار حقوق أولوية	2014-03-30	2014-07-02	\N	\N	\N	SAR	زياده راس المال من 100,000,000  الى 320,000,000  من خلال اصدار 22,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:28.349842
3859	1010	توزيع أرباح نقدية	2014-06-29	2014-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-15 توزيع 0.38 SAR	2025-12-25 15:06:28.350116
3860	2020	توزيع أرباح نقدية	2014-06-23	2014-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-14 توزيع 4.0 SAR	2025-12-25 15:06:28.350406
3861	4090	توزيع أرباح نقدية	2014-06-23	2014-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-13 توزيع 0.4 SAR	2025-12-25 15:06:28.35077
3862	2330	توزيع أرباح نقدية	2014-06-02	2014-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-21 توزيع 1.25 SAR	2025-12-25 15:06:28.351092
3863	4280	توزيع أرباح نقدية	2014-02-24	2014-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-14 توزيع 0.12 SAR	2025-12-25 15:06:28.351419
3864	4100	توزيع أرباح نقدية	2014-04-24	2014-06-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-07 توزيع 2.5 SAR	2025-12-25 15:06:28.352016
3865	4030	زيادة رأس مال - اكتتاب خاص	2014-06-01	2014-06-22	\N	\N	\N	SAR	زيادة رأس المال من   3,150,000,000  الى 3,937,500,000  عن طريق الاكتتاب الخاص في 78,750,000 سهم لأحد الشركاء 	2025-12-25 15:06:28.352367
3866	8180	توزيع أرباح نقدية	2014-05-12	2014-06-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-10 توزيع 0.5 SAR	2025-12-25 15:06:28.352652
3867	4081	تغيير اسم الشركة	2014-06-01	2014-06-01	\N	\N	\N	SAR	تم تعديل اسم الشركة من Nayifat إلى Nayifat	2025-12-25 15:06:28.352932
3868	1010	زيادة رأس المال المصرح به	2014-04-02	2014-05-27	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  30000000000	2025-12-25 15:06:28.353256
3869	1020	توزيع أسهم خزينة كأسهم منحة	2014-04-03	2014-05-21	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 4,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:28.353663
3870	1020	زيادة رأس المال المصرح به	2014-04-03	2014-05-21	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  4000000000	2025-12-25 15:06:28.353974
3871	2001	توزيع أرباح نقدية	2014-02-17	2014-05-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-21 توزيع 0.6 SAR	2025-12-25 15:06:28.354452
3872	7020	توزيع أرباح نقدية	2014-05-01	2014-05-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-13 توزيع 1.25 SAR	2025-12-25 15:06:28.354776
3873	2300	توزيع أسهم خزينة كأسهم منحة	2014-02-18	2014-05-05	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 450,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:28.355058
3874	6004	توزيع أرباح نقدية	2014-04-22	2014-05-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-18 توزيع 1.5 SAR	2025-12-25 15:06:28.355333
3875	1330	توزيع أرباح نقدية	2014-03-24	2014-05-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-07-24 توزيع 0.5 SAR	2025-12-25 15:06:28.355675
3876	4004	توزيع أرباح نقدية	2014-02-19	2014-05-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-06-01 توزيع 1.5 SAR	2025-12-25 15:06:28.355981
3877	2250	توزيع أرباح نقدية	2013-12-17	2014-05-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-14 توزيع 1.0 SAR	2025-12-25 15:06:28.356294
3878	4050	توزيع أرباح نقدية	2014-02-24	2014-04-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-25 توزيع 0.75 SAR	2025-12-25 15:06:28.356592
3879	2030	توزيع أرباح نقدية	2014-02-19	2014-04-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-19 توزيع 0.6 SAR	2025-12-25 15:06:28.356883
3880	4080	توزيع أرباح نقدية	2013-12-25	2014-04-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-18 توزيع 1.0 SAR	2025-12-25 15:06:28.357167
3881	3003	توزيع أرباح نقدية	2014-02-20	2014-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-12 توزيع 0.25 SAR	2025-12-25 15:06:28.357526
3882	6040	توزيع أرباح نقدية	2014-02-19	2014-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2015-03-01 توزيع 0.5 SAR	2025-12-25 15:06:28.357838
3883	4230	توزيع أرباح نقدية	2014-01-21	2014-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-07 توزيع 1.25 SAR	2025-12-25 15:06:28.358225
3884	4230	توزيع أسهم خزينة كأسهم منحة	2014-01-21	2014-04-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 600,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:28.358741
3885	2340	توزيع أرباح نقدية	2014-03-17	2014-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-15 توزيع 1.0 SAR	2025-12-25 15:06:28.359042
3886	2050	توزيع أرباح نقدية	2014-04-20	2014-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-04 توزيع 0.5 SAR	2025-12-25 15:06:28.359623
3887	1210	توزيع أرباح نقدية	2014-03-19	2014-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-11 توزيع 1.0 SAR	2025-12-25 15:06:28.359969
3888	6002	توزيع أرباح نقدية	2014-02-18	2014-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-04 توزيع 1.75 SAR	2025-12-25 15:06:28.360306
3889	2070	توزيع أرباح نقدية	2014-02-23	2014-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-11 توزيع 1.0 SAR	2025-12-25 15:06:28.360708
3890	2070	توزيع أسهم خزينة كأسهم منحة	2014-02-23	2014-04-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,200,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:28.362124
3891	4260	توزيع أسهم خزينة كأسهم منحة	2014-01-19	2014-04-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 406,666,670  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:28.362439
3892	2240	توزيع أرباح نقدية	2014-03-16	2014-04-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-30 توزيع 1.0 SAR	2025-12-25 15:06:28.362718
3893	1050	زيادة رأس المال المصرح به	2013-01-13	2014-04-17	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  12053571670	2025-12-25 15:06:28.362992
3894	5110	توزيع أرباح نقدية	2014-02-25	2014-04-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-27 توزيع 0.7 SAR	2025-12-25 15:06:28.363273
3895	4290	توزيع أرباح نقدية	2014-02-19	2014-04-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:28.363543
3896	4290	زيادة رأس المال المصرح به	2014-02-19	2014-04-16	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  300000000 إلى  350000000	2025-12-25 15:06:28.363829
3897	4290	توزيع أسهم خزينة كأسهم منحة	2014-02-19	2014-04-16	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:28.364109
3898	1120	توزيع أرباح نقدية	2014-01-19	2014-04-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-21 توزيع 1.0 SAR	2025-12-25 15:06:28.364377
3899	1120	زيادة رأس المال المصرح به	2014-01-19	2014-04-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  16250000000	2025-12-25 15:06:28.364672
3900	2010	توزيع أرباح نقدية	2013-12-18	2014-04-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-23 توزيع 3.0 SAR	2025-12-25 15:06:28.364982
3901	2090	توزيع أرباح نقدية	2014-02-23	2014-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-30 توزيع 0.8 SAR	2025-12-25 15:06:29.005781
3902	2150	توزيع أرباح نقدية	2013-12-18	2014-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-01 توزيع 1.25 SAR	2025-12-25 15:06:29.006484
3903	2040	توزيع أرباح نقدية	2013-12-31	2014-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-23 توزيع 3.0 SAR	2025-12-25 15:06:29.007165
3904	1213	توزيع أرباح نقدية	2014-02-20	2014-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-29 توزيع 0.5 SAR	2025-12-25 15:06:29.007944
3905	4110	توزيع أرباح نقدية	2014-01-01	2014-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-07 توزيع 1.0 SAR	2025-12-25 15:06:29.008437
3906	4090	توزيع أرباح نقدية	2014-03-02	2014-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-17 توزيع 0.4 SAR	2025-12-25 15:06:29.009006
3907	4001	زيادة رأس المال المصرح به	2014-02-24	2014-04-07	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  225000000 إلى  450000000	2025-12-25 15:06:29.009829
3908	4001	توزيع أرباح نقدية	2014-02-24	2014-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-24 توزيع 3.0 SAR	2025-12-25 15:06:29.010515
3909	4090	توزيع أرباح نقدية	2014-02-23	2014-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-17 توزيع 0.4 SAR	2025-12-25 15:06:29.011055
3910	2180	توزيع أرباح نقدية	2014-01-15	2014-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-29 توزيع 1.0 SAR	2025-12-25 15:06:29.011564
3911	6001	توزيع أرباح نقدية	2013-12-23	2014-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-05-13 توزيع 2.0 SAR	2025-12-25 15:06:29.012073
3912	1214	توزيع أرباح نقدية	2014-03-06	2014-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-27 توزيع 2.5 SAR	2025-12-25 15:06:29.012834
3913	4002	توزيع أرباح نقدية	2013-12-17	2014-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-20 توزيع 2.0 SAR	2025-12-25 15:06:29.013653
3914	2060	توزيع أرباح نقدية	2014-02-19	2014-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-15 توزيع 1.5 SAR	2025-12-25 15:06:29.014525
3915	3010	توزيع أسهم خزينة كأسهم منحة	2014-01-13	2014-04-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.015068
3916	1030	توزيع أسهم خزينة كأسهم منحة	2013-12-19	2014-04-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.015552
3917	1030	توزيع أرباح نقدية	2013-12-19	2014-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-06 توزيع 0.8 SAR	2025-12-25 15:06:29.015965
3918	1030	زيادة رأس المال المصرح به	2013-12-19	2014-04-02	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  6000000000	2025-12-25 15:06:29.016325
3919	2080	توزيع أرباح نقدية	2014-03-18	2014-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-15 توزيع 0.4 SAR	2025-12-25 15:06:29.016699
3920	4280	توزيع أرباح نقدية	2014-02-24	2014-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-14 توزيع 0.12 SAR	2025-12-25 15:06:29.017126
3921	4040	توزيع أرباح نقدية	2014-02-24	2014-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-13 توزيع 0.5 SAR	2025-12-25 15:06:29.017532
3922	6004	توزيع أرباح نقدية	2013-12-22	2014-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-13 توزيع 1.75 SAR	2025-12-25 15:06:29.017915
3923	4030	توزيع أرباح نقدية	2013-12-19	2014-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-15 توزيع 1.0 SAR	2025-12-25 15:06:29.018233
3924	4010	توزيع أرباح نقدية	2014-02-19	2014-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-08 توزيع 0.7 SAR	2025-12-25 15:06:29.018577
3925	4020	توزيع أرباح نقدية	2014-02-26	2014-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-13 توزيع 0.5 SAR	2025-12-25 15:06:29.018917
3926	6070	توزيع أسهم خزينة كأسهم منحة	2014-03-20	2014-03-25	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.019306
3927	6070	توزيع أرباح نقدية	2013-12-30	2014-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-23 توزيع 1.0 SAR	2025-12-25 15:06:29.020252
3928	2020	توزيع أرباح نقدية	2013-12-17	2014-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-03 توزيع 6.0 SAR	2025-12-25 15:06:29.020677
3929	3060	توزيع أرباح نقدية	2014-01-29	2014-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-13 توزيع 2.0 SAR	2025-12-25 15:06:29.021206
3930	4180	توزيع أرباح نقدية	2014-01-20	2014-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-03 توزيع 0.5 SAR	2025-12-25 15:06:29.0216
3931	1090	توزيع أسهم خزينة كأسهم منحة	2014-02-13	2014-03-23	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 12,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.022007
3932	1090	زيادة رأس المال المصرح به	2014-02-13	2014-03-23	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  12000000000	2025-12-25 15:06:29.022327
3933	2160	توزيع أرباح نقدية	2014-02-06	2014-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-03 توزيع 1.0 SAR	2025-12-25 15:06:29.02278
3934	1810	زيادة رأس المال المصرح به	2014-02-03	2014-03-23	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  1200000000 إلى  1500000000	2025-12-25 15:06:29.023409
3935	1810	توزيع أسهم خزينة كأسهم منحة	2014-02-03	2014-03-23	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.023923
3936	1090	توزيع أرباح نقدية	2013-12-26	2014-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-01 توزيع 0.85 SAR	2025-12-25 15:06:29.02458
3937	2260	توزيع أرباح نقدية	2014-03-02	2014-03-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-07 توزيع 0.85 SAR	2025-12-25 15:06:29.025041
3938	6010	توزيع أسهم خزينة كأسهم منحة	2014-02-13	2014-03-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 700,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.025459
3939	3080	توزيع أرباح نقدية	2014-02-13	2014-03-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-02 توزيع 3.5 SAR	2025-12-25 15:06:29.025885
3940	1040	توزيع أسهم خزينة كأسهم منحة	2014-02-19	2014-03-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 4,762,800,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.026678
3941	1040	زيادة رأس المال المصرح به	2014-02-19	2014-03-19	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  4762800000	2025-12-25 15:06:29.027511
3942	1060	توزيع أرباح نقدية	2013-12-19	2014-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-25 توزيع 1.0 SAR	2025-12-25 15:06:29.03012
3943	1040	توزيع أرباح نقدية	2013-12-16	2014-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-26 توزيع 1.0 SAR	2025-12-25 15:06:29.030573
3944	3030	توزيع أرباح نقدية	2014-02-09	2014-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-26 توزيع 3.5 SAR	2025-12-25 15:06:29.030907
3945	4005	توزيع أرباح نقدية	2014-02-06	2014-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-26 توزيع 1.55 SAR	2025-12-25 15:06:29.03146
3946	1080	توزيع أرباح نقدية	2013-12-19	2014-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-31 توزيع 0.5 SAR	2025-12-25 15:06:29.031867
3947	1080	توزيع أسهم خزينة كأسهم منحة	2013-12-19	2014-03-18	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 10,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.032257
3948	1080	زيادة رأس المال المصرح به	2013-12-19	2014-03-18	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  10000000000	2025-12-25 15:06:29.032612
3949	2290	توزيع أرباح نقدية	2013-12-09	2014-03-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-26 توزيع 2.0 SAR	2025-12-25 15:06:29.033097
3950	2310	توزيع أرباح نقدية	2013-12-04	2014-03-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-26 توزيع 0.65 SAR	2025-12-25 15:06:29.033523
3951	3004	توزيع أرباح نقدية	2014-02-10	2014-03-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-30 توزيع 1.0 SAR	2025-12-25 15:06:29.034146
3952	1010	توزيع أرباح نقدية	2014-01-07	2014-03-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-24 توزيع 0.8 SAR	2025-12-25 15:06:29.034736
3953	3040	توزيع أرباح نقدية	2014-02-05	2014-03-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-03-26 توزيع 3.5 SAR	2025-12-25 15:06:29.035454
3954	4200	توزيع أسهم خزينة كأسهم منحة	2014-03-05	2014-03-06	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 400,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.035841
3955	4200	توزيع أرباح نقدية	2014-01-16	2014-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-04-03 توزيع 2.0 SAR	2025-12-25 15:06:29.03611
3956	6012	استحواذ على شركة	2013-10-01	2014-03-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Rawsha Sweets	2025-12-25 15:06:29.036385
3957	4190	توزيع أرباح نقدية	2014-02-05	2014-02-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-02-27 توزيع 1.4 SAR	2025-12-25 15:06:29.036669
3958	2360	توزيع أرباح نقدية	2013-12-28	2014-02-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-02-16 توزيع 2.0 SAR	2025-12-25 15:06:29.036998
3959	7010	استحواذ على شركة	2013-10-31	2014-01-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Public Telecommunications Co	2025-12-25 15:06:29.037317
3960	2230	توزيع أرباح نقدية	2013-12-08	2014-01-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-01-30 توزيع 2.0 SAR	2025-12-25 15:06:29.037641
4985	2050	توزيع أرباح نقدية	2004-10-26	2004-10-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.243819
3961	4003	توزيع أرباح نقدية	2013-12-12	2014-01-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-02-27 توزيع 1.75 SAR	2025-12-25 15:06:29.037935
3962	4280	توزيع أرباح نقدية	2013-02-23	2014-01-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2014-01-14 توزيع 0.12 SAR عن الربع الرابع	2025-12-25 15:06:29.03827
3963	2080	توزيع أرباح نقدية	2013-12-17	2013-12-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-12-30 توزيع 1.0 SAR	2025-12-25 15:06:29.038638
3964	4191	استحواذ على شركة	2013-06-06	2013-12-22	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Maujah Trading Ltd	2025-12-25 15:06:29.03905
3965	4190	توزيع أسهم خزينة كأسهم منحة	2013-11-27	2013-11-28	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 900,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:29.039485
3966	2050	استحواذ على شركة	2013-05-01	2013-11-13	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Savola Foods Co	2025-12-25 15:06:29.039983
3967	2050	استحواذ على شركة	2013-05-01	2013-11-13	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Panda Retail Co	2025-12-25 15:06:29.040369
3968	6013	تغيير اسم الشركة	2013-11-11	2013-11-11	\N	\N	\N	SAR	تم تعديل اسم الشركة من Qoot for Food Development & Restaurant إلى Development Works for Food	2025-12-25 15:06:29.040989
3969	7020	توزيع أرباح نقدية	2013-10-30	2013-11-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-11-12 توزيع 1.2 SAR	2025-12-25 15:06:29.041401
3970	2050	زيادة رأس مال - اكتتاب خاص	2010-08-23	2013-11-05	\N	\N	\N	SAR	زيادة رأس المال من   5,000,000,000  الى 5,339,806,840  عن طريق الاكتتاب الخاص في 33,980,684 سهم لأحد الشركاء 	2025-12-25 15:06:29.041805
3971	2360	توزيع أرباح نقدية	2013-10-29	2013-11-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-11-17 توزيع 1.5 SAR	2025-12-25 15:06:29.04219
3972	6004	توزيع أرباح نقدية	2013-09-25	2013-11-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-11-10 توزيع 1.25 SAR	2025-12-25 15:06:29.042621
3973	2050	توزيع أرباح نقدية	2013-10-24	2013-10-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-11-11 توزيع 0.5 SAR	2025-12-25 15:06:29.043031
3974	4080	استحواذ على شركة	2013-08-04	2013-10-08	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Essa Industries Co	2025-12-25 15:06:29.043413
3975	4280	توزيع أرباح نقدية	2013-02-23	2013-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-10-14 توزيع 0.12 SAR عن الربع الثالث	2025-12-25 15:06:29.043806
3976	2280	توزيع أسهم خزينة كأسهم منحة	2013-09-04	2013-09-10	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:29.044196
3977	2080	توزيع أرباح نقدية	2013-08-27	2013-09-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-10-01 توزيع 0.75 SAR	2025-12-25 15:06:29.044588
3978	2370	زيادة رأس مال - إصدار حقوق أولوية	2013-07-25	2013-08-28	\N	\N	\N	SAR	زياده راس المال من 400,000,000  الى 600,000,000  من خلال اصدار 20,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:29.04503
3979	1810	توزيع أرباح نقدية	2013-07-24	2013-08-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-09-08 توزيع 2.0 SAR	2025-12-25 15:06:29.045399
3980	6002	توزيع أرباح نقدية	2013-07-18	2013-08-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-22 توزيع 1.75 SAR	2025-12-25 15:06:29.045761
3981	6004	توزيع أرباح نقدية	2013-07-18	2013-08-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-18 توزيع 1.25 SAR	2025-12-25 15:06:29.046115
3982	4010	توزيع أرباح نقدية	2013-07-23	2013-07-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-05 توزيع 0.5 SAR	2025-12-25 15:06:29.046554
3983	7020	توزيع أرباح نقدية	2013-07-24	2013-07-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-05 توزيع 1.2 SAR	2025-12-25 15:06:29.04695
3984	7010	توزيع أرباح نقدية	2013-07-21	2013-07-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-15 توزيع 0.5 SAR	2025-12-25 15:06:29.04739
3985	3040	توزيع أرباح نقدية	2013-07-16	2013-07-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-04 توزيع 2.75 SAR	2025-12-25 15:06:29.047832
3986	3002	توزيع أرباح نقدية	2013-07-21	2013-07-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-01 توزيع 0.6 SAR	2025-12-25 15:06:29.048264
3987	3010	توزيع أرباح نقدية	2013-07-17	2013-07-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-01 توزيع 1.25 SAR	2025-12-25 15:06:29.048693
3988	4190	توزيع أرباح نقدية	2013-07-16	2013-07-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-07-30 توزيع 1.7 SAR	2025-12-25 15:06:29.049238
3989	1320	توزيع أرباح نقدية	2013-07-16	2013-07-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-08-01 توزيع 0.75 SAR	2025-12-25 15:06:29.049625
3990	3060	توزيع أرباح نقدية	2013-07-15	2013-07-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-07-29 توزيع 2.0 SAR	2025-12-25 15:06:29.050137
3991	4100	توزيع أرباح نقدية	2013-05-05	2013-07-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-07-18 توزيع 2.5 SAR	2025-12-25 15:06:29.050543
3992	2100	تغيير اسم الشركة	2013-07-04	2013-07-03	\N	\N	\N	SAR	تم تعديل اسم الشركة من Food Products إلى Wafra	2025-12-25 15:06:29.050889
3993	3030	توزيع أرباح نقدية	2013-05-29	2013-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-07-09 توزيع 3.5 SAR	2025-12-25 15:06:29.051226
3994	4090	توزيع أرباح نقدية	2013-06-19	2013-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-07-14 توزيع 0.3 SAR	2025-12-25 15:06:29.05159
3995	3090	توزيع أرباح نقدية	2013-06-19	2013-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-09-15 توزيع 1.0 SAR	2025-12-25 15:06:29.052176
3996	2330	توزيع أرباح نقدية	2013-05-29	2013-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-07-28 توزيع 1.0 SAR	2025-12-25 15:06:29.052676
3997	4280	توزيع أرباح نقدية	2013-02-23	2013-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-07-14 توزيع 0.12 SAR عن الربع الثانى	2025-12-25 15:06:29.053213
3998	8190	توزيع أسهم خزينة كأسهم منحة	2013-05-25	2013-06-30	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 280,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.053556
3999	8170	توزيع أسهم خزينة كأسهم منحة	2013-04-29	2013-06-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 275,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.054102
4000	4050	توزيع أرباح نقدية	2013-02-16	2013-05-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-25 توزيع 0.5 SAR	2025-12-25 15:06:29.054747
4001	8180	توزيع أسهم خزينة كأسهم منحة	2013-03-27	2013-05-07	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.739199
4002	3091	توزيع أرباح نقدية	2013-03-05	2013-05-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-16 توزيع 0.5 SAR	2025-12-25 15:06:29.739987
4003	2030	توزيع أرباح نقدية	2013-04-07	2013-05-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-22 توزيع 0.5 SAR	2025-12-25 15:06:29.740778
4004	2340	توزيع أرباح نقدية	2013-02-19	2013-04-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-27 توزيع 1.25 SAR	2025-12-25 15:06:29.741497
4005	2001	توزيع أرباح نقدية	2013-02-23	2013-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-21 توزيع 0.5 SAR	2025-12-25 15:06:29.742017
4006	7010	توزيع أرباح نقدية	2013-04-21	2013-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-08 توزيع 0.5 SAR	2025-12-25 15:06:29.742409
4007	4240	توزيع أرباح نقدية	2013-04-20	2013-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-29 توزيع 3.0 SAR	2025-12-25 15:06:29.742799
4008	4230	توزيع أرباح نقدية	2013-03-04	2013-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-08 توزيع 1.5 SAR	2025-12-25 15:06:29.74317
4009	6040	توزيع أرباح نقدية	2013-02-18	2013-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-21 توزيع 0.5 SAR	2025-12-25 15:06:29.743675
4010	8010	توزيع أسهم خزينة كأسهم منحة	2013-03-20	2013-04-23	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.744122
4011	1212	توزيع أرباح نقدية	2013-03-17	2013-04-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-14 توزيع 1.75 SAR	2025-12-25 15:06:29.744548
4012	4080	توزيع أرباح نقدية	2012-12-31	2013-04-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-21 توزيع 1.0 SAR	2025-12-25 15:06:29.745539
4013	1210	توزيع أرباح نقدية	2013-03-25	2013-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-13 توزيع 1.5 SAR	2025-12-25 15:06:29.745999
4014	4004	توزيع أرباح نقدية	2013-01-21	2013-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-18 توزيع 1.5 SAR	2025-12-25 15:06:29.746565
4015	2180	توزيع أرباح نقدية	2013-01-19	2013-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-18 توزيع 1.0 SAR	2025-12-25 15:06:29.747075
4016	6002	توزيع أسهم خزينة كأسهم منحة	2013-03-11	2013-04-21	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 330,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.747539
4017	2050	توزيع أرباح نقدية	2013-04-13	2013-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-04-30 توزيع 0.5 SAR	2025-12-25 15:06:29.747941
4018	4260	توزيع أرباح نقدية	2013-02-26	2013-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-12 توزيع 2.1 SAR	2025-12-25 15:06:29.748637
4019	4260	توزيع أسهم خزينة كأسهم منحة	2013-02-26	2013-04-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 305,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.749104
4020	4020	توزيع أرباح نقدية	2013-02-19	2013-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-04 توزيع 0.5 SAR	2025-12-25 15:06:29.7495
4021	1301	توزيع أسهم خزينة كأسهم منحة	2013-04-03	2013-04-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 390,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.749951
4022	8210	توزيع أرباح نقدية	2013-03-02	2013-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-05-07 توزيع 1.0 SAR	2025-12-25 15:06:29.750357
4023	4290	زيادة رأس المال المصرح به	2013-02-19	2013-04-13	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  250000000 إلى  300000000	2025-12-25 15:06:29.750722
4024	4290	توزيع أسهم خزينة كأسهم منحة	2013-02-19	2013-04-13	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:29.751117
4025	4290	توزيع أرباح نقدية	2013-02-19	2013-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:29.751535
4026	8170	تغيير اسم الشركة	2013-04-08	2013-04-10	\N	\N	\N	SAR	تم تعديل اسم الشركة من Trade Union إلى Union	2025-12-25 15:06:29.752264
4027	1140	زيادة رأس المال المصرح به	2013-01-27	2013-04-10	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  4000000000	2025-12-25 15:06:29.752694
4028	4040	توزيع أرباح نقدية	2013-01-06	2013-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-04-29 توزيع 0.5 SAR	2025-12-25 15:06:29.75311
4029	1810	تغيير اسم الشركة	2013-04-03	2013-04-03	\N	\N	\N	SAR	تم تعديل اسم الشركة من Al Tayyar إلى Al Tayyar	2025-12-25 15:06:29.753631
4030	1810	زيادة رأس المال المصرح به	2013-02-16	2013-04-03	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  null إلى  1200000000	2025-12-25 15:06:29.754185
4031	4090	توزيع أرباح نقدية	2013-02-24	2013-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-04-14 توزيع 0.3 SAR عن الربع الاول	2025-12-25 15:06:29.754826
4032	4280	توزيع أرباح نقدية	2013-02-23	2013-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-04-09 توزيع 0.12 SAR	2025-12-25 15:06:29.755278
4033	3060	توزيع أرباح نقدية	2013-01-23	2013-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-04-06 توزيع 5.0 SAR عن السنه السابقة	2025-12-25 15:06:29.755652
4034	3080	توزيع أرباح نقدية	2013-02-17	2013-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-03-27 توزيع 4.0 SAR عن السنه السابقة	2025-12-25 15:06:29.756025
4035	1060	توزيع أرباح نقدية	2012-12-23	2013-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-03-24 توزيع 0.92 SAR عن السنه السابقة	2025-12-25 15:06:29.756662
4036	4005	إدراج الشركة	2013-03-11	2013-03-13	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2013-03-13	2025-12-25 15:06:29.757217
4037	1030	توزيع أرباح نقدية	2012-12-17	2013-03-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-03-16 توزيع 0.7 SAR عن السنه السابقة	2025-12-25 15:06:29.757761
4038	4200	توزيع أرباح نقدية	2013-01-16	2013-03-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-04-03 توزيع 2.0 SAR عن السنه السابقة	2025-12-25 15:06:29.758255
4039	1810	توزيع أرباح نقدية	2013-02-16	2013-03-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-03-17 توزيع 2.5 SAR	2025-12-25 15:06:29.758697
4040	2330	توزيع أرباح نقدية	2013-01-30	2013-02-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-03-23 توزيع 1.0 SAR عن الربع الثانى	2025-12-25 15:06:29.759185
4041	7020	توزيع أرباح نقدية	2013-01-19	2013-02-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-02-27 توزيع 1.15 SAR عن الربع الرابع	2025-12-25 15:06:29.759711
4042	3020	توزيع أرباح نقدية	2013-01-16	2013-02-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-03-09 توزيع 1.5 SAR	2025-12-25 15:06:29.76036
4043	4190	توزيع أرباح نقدية	2013-02-06	2013-02-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-02-27 توزيع 1.85 SAR عن الربع الرابع	2025-12-25 15:06:29.761022
4044	3004	إدراج الشركة	2013-02-02	2013-02-05	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2013-02-05	2025-12-25 15:06:29.761556
4045	2230	توزيع أرباح نقدية	2012-12-29	2013-01-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-01-30 توزيع 2.0 SAR عن الربع الثالث	2025-12-25 15:06:29.762298
4046	2270	استحواذ على شركة	2013-01-23	2013-01-23	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Sadafco Kuwait Foodstuff Co WLL	2025-12-25 15:06:29.762872
4047	7020	توزيع أسهم خزينة كأسهم منحة	2012-11-18	2013-01-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 7,700,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.763513
4048	4280	توزيع أرباح نقدية	2012-02-25	2013-01-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2013-01-14 توزيع 0.12 SAR	2025-12-25 15:06:29.764397
4049	8050	تغيير اسم الشركة	2012-12-19	2012-12-19	\N	\N	\N	SAR	تم تعديل اسم الشركة من SALAMA إلى SALAMA	2025-12-25 15:06:29.765075
4050	4004	إدراج الشركة	2012-12-15	2012-12-17	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-12-17	2025-12-25 15:06:29.766639
4051	2020	توزيع أسهم خزينة كأسهم منحة	2012-09-10	2012-12-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,333,333,330  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.767158
4052	2320	توزيع أرباح نقدية	2012-11-20	2012-12-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-12-17 توزيع 1.0 SAR عن الربع الثالث	2025-12-25 15:06:29.767808
4053	1214	توزيع أرباح نقدية	2012-10-17	2012-12-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-12-10 توزيع 4.0 SAR عن الربع الثالث	2025-12-25 15:06:29.76843
4054	2140	استحواذ على شركة	2012-10-01	2012-11-12	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Ahsa Medical Services Co	2025-12-25 15:06:29.769023
4055	4061	زيادة رأس مال - إصدار حقوق أولوية	2012-10-14	2012-11-10	\N	\N	\N	SAR	زياده راس المال من 109,000,000  الى 196,000,000  من خلال اصدار 8,700,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:29.769593
4056	2050	توزيع أرباح نقدية	2012-10-16	2012-10-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-11-17 توزيع 0.3 SAR	2025-12-25 15:06:29.770042
4057	2050	استحواذ على شركة	2012-10-17	2012-10-16	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Almarai Co	2025-12-25 15:06:29.770512
4058	3003	إدراج الشركة	2012-10-08	2012-10-13	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-10-13	2025-12-25 15:06:29.771873
4059	4020	توزيع أرباح نقدية	2012-10-03	2012-10-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-10-20 توزيع 0.5 SAR	2025-12-25 15:06:29.772302
4060	4090	توزيع أرباح نقدية	2012-04-02	2012-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-10-14 توزيع 0.3 SAR	2025-12-25 15:06:29.772784
4061	4280	توزيع أرباح نقدية	2012-02-25	2012-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-10-14 توزيع 0.12 SAR	2025-12-25 15:06:29.773253
4062	8150	زيادة رأس مال - إصدار حقوق أولوية	2012-08-01	2012-09-05	\N	\N	\N	SAR	زياده راس المال من 100,000,000  الى 200,000,000  من خلال اصدار 10,000,000 سهم بسعر اصدار  10.0  لكل سهم	2025-12-25 15:06:29.773789
4063	6004	توزيع أرباح نقدية	2012-08-04	2012-08-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-09-01 توزيع 2.0 SAR	2025-12-25 15:06:29.774253
4064	3090	توزيع أرباح نقدية	2012-07-26	2012-08-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-09-09 توزيع 0.9 SAR	2025-12-25 15:06:29.77477
4065	1810	توزيع أرباح نقدية	2012-07-23	2012-08-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-09-05 توزيع 2.5 SAR	2025-12-25 15:06:29.775416
4066	3040	توزيع أرباح نقدية	2012-08-01	2012-08-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-08-15 توزيع 2.5 SAR	2025-12-25 15:06:29.776028
4067	4010	توزيع أرباح نقدية	2012-07-28	2012-08-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-08-11 توزيع 0.6 SAR	2025-12-25 15:06:29.776497
4068	2240	توزيع أرباح نقدية	2012-07-28	2012-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-08-14 توزيع 0.75 SAR	2025-12-25 15:06:29.777979
4069	4150	توزيع أرباح نقدية	2012-07-21	2012-07-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-08-08 توزيع 0.65 SAR	2025-12-25 15:06:29.779478
4070	2010	توزيع أرباح نقدية	2012-07-18	2012-07-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-08-13 توزيع 2.0 SAR	2025-12-25 15:06:29.780008
4071	2050	توزيع أرباح نقدية	2012-07-21	2012-07-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-08-11 توزيع 0.3 SAR	2025-12-25 15:06:29.780534
4072	4240	استحواذ على شركة	2012-04-22	2012-07-24	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Nesk Trading Projects Co	2025-12-25 15:06:29.780984
4073	4100	توزيع أرباح نقدية	2012-05-16	2012-07-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-07-24 توزيع 2.0 SAR	2025-12-25 15:06:29.781432
4074	6004	إدراج الشركة	2012-07-04	2012-07-09	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-07-09	2025-12-25 15:06:29.781926
4075	7030	زيادة رأس مال - اكتتاب خاص	2011-02-22	2012-07-07	\N	\N	\N	SAR	زيادة رأس المال من   8,254,809,360  الى 10,801,000,000  عن طريق الاكتتاب الخاص في 254,619,064 سهم لأحد الشركاء 	2025-12-25 15:06:29.78238
4076	3020	توزيع أرباح نقدية	2012-06-23	2012-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-07-21 توزيع 1.5 SAR	2025-12-25 15:06:29.782807
4077	4090	توزيع أرباح نقدية	2012-04-01	2012-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-07-14 توزيع 0.25 SAR	2025-12-25 15:06:29.783254
4078	8312	إدراج الشركة	2012-06-20	2012-06-24	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-06-24	2025-12-25 15:06:29.783651
4079	2200	توزيع أسهم خزينة كأسهم منحة	2012-04-22	2012-06-12	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 400,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.784098
4080	3091	توزيع أرباح نقدية	2012-05-30	2012-06-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-06-16 توزيع 0.5 SAR	2025-12-25 15:06:29.784514
4081	1810	إدراج الشركة	2012-06-04	2012-06-04	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-06-04	2025-12-25 15:06:29.784895
4082	4260	استحواذ على شركة	2012-05-30	2012-05-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Indian Tranzles Holding Ltd.	2025-12-25 15:06:29.785274
4083	1212	توزيع أرباح نقدية	2012-03-27	2012-05-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-06-13 توزيع 1.75 SAR	2025-12-25 15:06:29.785708
4084	8190	توزيع أرباح نقدية	2012-03-17	2012-05-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-06-09 توزيع 1.0 SAR	2025-12-25 15:06:29.786116
4085	3002	إدراج الشركة	2012-05-12	2012-05-12	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-05-12	2025-12-25 15:06:29.786534
4086	4190	توزيع أرباح نقدية	2012-04-18	2012-05-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-09 توزيع 2.2 SAR	2025-12-25 15:06:29.786931
4087	2360	توزيع أرباح نقدية	2012-04-18	2012-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-09 توزيع 1.25 SAR	2025-12-25 15:06:29.787334
4088	2050	توزيع أرباح نقدية	2012-04-17	2012-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-05 توزيع 0.3 SAR	2025-12-25 15:06:29.787798
4089	7010	توزيع أرباح نقدية	2012-03-18	2012-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-09 توزيع 0.5 SAR	2025-12-25 15:06:29.788219
4090	2150	توزيع أرباح نقدية	2011-12-25	2012-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-12 توزيع 2.25 SAR	2025-12-25 15:06:29.788639
4091	4260	توزيع أسهم خزينة كأسهم منحة	2012-04-18	2012-04-21	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 244,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:29.789179
4092	4260	توزيع أرباح نقدية	2012-04-18	2012-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-14 توزيع 2.5 SAR	2025-12-25 15:06:29.789715
4093	6070	توزيع أرباح نقدية	2011-12-17	2012-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-06 توزيع 2.0 SAR	2025-12-25 15:06:29.790392
4094	1201	توزيع أرباح نقدية	2012-04-18	2012-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-19 توزيع 1.35 SAR	2025-12-25 15:06:29.790981
4095	2050	توزيع أرباح نقدية	2012-01-17	2012-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-28 توزيع 0.55 SAR	2025-12-25 15:06:29.791619
4096	3090	توزيع أرباح نقدية	2012-01-07	2012-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-29 توزيع 0.5 SAR	2025-12-25 15:06:29.792311
4097	2030	توزيع أرباح نقدية	2012-02-13	2012-04-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-12 توزيع 0.5 SAR	2025-12-25 15:06:29.792806
4098	2010	توزيع أرباح نقدية	2011-12-18	2012-04-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-22 توزيع 3.0 SAR	2025-12-25 15:06:29.793263
4099	2180	توزيع أرباح نقدية	2011-12-31	2012-04-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-01 توزيع 1.0 SAR	2025-12-25 15:06:29.79397
4100	2020	توزيع أرباح نقدية	2011-11-29	2012-04-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-25 توزيع 7.0 SAR	2025-12-25 15:06:29.794463
4101	4290	توزيع أسهم خزينة كأسهم منحة	2012-02-20	2012-04-11	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:30.477484
4102	4290	توزيع أرباح نقدية	2012-02-20	2012-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:30.478412
4103	4290	زيادة رأس المال المصرح به	2012-02-20	2012-04-11	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  200000000 إلى  250000000	2025-12-25 15:06:30.478804
4104	6040	توزيع أرباح نقدية	2011-12-24	2012-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-09 توزيع 0.5 SAR	2025-12-25 15:06:30.479101
4105	2040	توزيع أسهم خزينة كأسهم منحة	2012-04-09	2012-04-10	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 375,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:30.479442
4106	2040	توزيع أرباح نقدية	2011-12-26	2012-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-23 توزيع 3.5 SAR	2025-12-25 15:06:30.479801
4180	2280	استحواذ على شركة	2011-12-21	2011-12-21	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Fondomonte Sandoval S A	2025-12-25 15:06:30.621526
4107	2240	توزيع أرباح نقدية	2012-04-08	2012-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-09 توزيع 0.75 SAR	2025-12-25 15:06:30.480146
4108	4010	توزيع أرباح نقدية	2012-02-20	2012-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-24 توزيع 0.69 SAR	2025-12-25 15:06:30.521204
4109	2250	توزيع أرباح نقدية	2011-12-25	2012-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-22 توزيع 1.0 SAR	2025-12-25 15:06:30.522093
4110	1050	توزيع أسهم خزينة كأسهم منحة	2012-04-07	2012-04-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 9,040,178,750  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:30.522778
4111	2360	توزيع أرباح نقدية	2012-04-04	2012-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-15 توزيع 1.0 SAR	2025-12-25 15:06:30.523474
4112	2060	توزيع أسهم خزينة كأسهم منحة	2012-04-04	2012-04-07	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,689,141,660  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:30.52413
4113	1020	توزيع أرباح نقدية	2011-12-31	2012-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-14 توزيع 0.5 SAR	2025-12-25 15:06:30.524775
4114	2060	توزيع أرباح نقدية	2011-12-27	2012-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-18 توزيع 1.5 SAR	2025-12-25 15:06:30.52555
4115	2320	توزيع أرباح نقدية	2012-04-03	2012-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-04 توزيع 1.5 SAR	2025-12-25 15:06:30.526205
4116	7010	توزيع أرباح نقدية	2012-01-18	2012-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-11 توزيع 0.5 SAR	2025-12-25 15:06:30.526805
4117	2300	توزيع أرباح نقدية	2012-04-02	2012-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-03 توزيع 1.75 SAR	2025-12-25 15:06:30.527358
4118	2280	توزيع أسهم خزينة كأسهم منحة	2012-04-02	2012-04-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 4,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:30.527985
4119	2300	توزيع أسهم خزينة كأسهم منحة	2012-04-02	2012-04-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 375,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:30.528574
4120	4002	توزيع أسهم خزينة كأسهم منحة	2012-04-02	2012-04-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:30.52912
4121	5110	توزيع أرباح نقدية	2012-02-20	2012-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-14 توزيع 0.7 SAR	2025-12-25 15:06:30.529833
4122	4002	توزيع أرباح نقدية	2012-02-16	2012-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-20 توزيع 3.0 SAR	2025-12-25 15:06:30.530593
4123	4140	توزيع أرباح نقدية	2012-01-10	2012-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-22 توزيع 0.5 SAR	2025-12-25 15:06:30.531243
4124	6001	توزيع أرباح نقدية	2011-12-20	2012-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-16 توزيع 2.0 SAR	2025-12-25 15:06:30.531799
4125	2280	توزيع أرباح نقدية	2011-12-07	2012-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-11 توزيع 2.25 SAR	2025-12-25 15:06:30.532204
4126	3010	توزيع أرباح نقدية	2012-02-20	2012-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-16 توزيع 2.0 SAR	2025-12-25 15:06:30.532697
4127	4040	توزيع أرباح نقدية	2012-02-19	2012-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-23 توزيع 0.5 SAR	2025-12-25 15:06:30.533291
4128	2090	توزيع أرباح نقدية	2012-01-21	2012-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-30 توزيع 1.2 SAR	2025-12-25 15:06:30.533915
4129	8030	توزيع أرباح نقدية	2012-03-31	2012-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-01 توزيع 2.0 SAR	2025-12-25 15:06:30.534547
4130	4090	توزيع أرباح نقدية	2012-03-15	2012-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-14 توزيع 0.25 SAR	2025-12-25 15:06:30.535387
4131	6010	توزيع أرباح نقدية	2012-02-18	2012-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-01 توزيع 0.75 SAR	2025-12-25 15:06:30.597983
4132	4090	توزيع أرباح نقدية	2012-02-16	2012-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-14 توزيع 0.25 SAR	2025-12-25 15:06:30.598473
4133	4280	توزيع أرباح نقدية	2012-02-25	2012-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-10 توزيع 0.12 SAR	2025-12-25 15:06:30.598751
4134	2080	توزيع أرباح نقدية	2012-02-19	2012-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-16 توزيع 1.0 SAR	2025-12-25 15:06:30.598995
4135	1090	توزيع أرباح نقدية	2011-12-20	2012-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-07 توزيع 0.85 SAR	2025-12-25 15:06:30.599216
4136	2340	توزيع أرباح نقدية	2012-03-25	2012-03-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-26 توزيع 1.5 SAR	2025-12-25 15:06:30.599425
4137	2070	استحواذ على شركة	2012-03-22	2012-03-22	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع EirGen Pharma Ltd	2025-12-25 15:06:30.59963
4138	1301	توزيع أرباح نقدية	2012-03-21	2012-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-22 توزيع 1.0 SAR	2025-12-25 15:06:30.599832
4139	3040	توزيع أرباح نقدية	2012-02-14	2012-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-07 توزيع 3.5 SAR	2025-12-25 15:06:30.600039
4140	3050	توزيع أرباح نقدية	2011-12-28	2012-03-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-28 توزيع 3.5 SAR	2025-12-25 15:06:30.600236
4141	2310	توزيع أرباح نقدية	2011-12-20	2012-03-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-02 توزيع 1.25 SAR	2025-12-25 15:06:30.600488
4142	1320	توزيع أرباح نقدية	2012-03-19	2012-03-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-20 توزيع 0.75 SAR	2025-12-25 15:06:30.600685
4143	1010	توزيع أرباح نقدية	2012-01-01	2012-03-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-26 توزيع 0.75 SAR	2025-12-25 15:06:30.600881
4144	1040	توزيع أسهم خزينة كأسهم منحة	2012-03-18	2012-03-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,969,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:30.601122
4145	4003	توزيع أرباح نقدية	2012-03-18	2012-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-05-01 توزيع 2.5 SAR	2025-12-25 15:06:30.601327
4146	3080	توزيع أرباح نقدية	2012-02-12	2012-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-28 توزيع 3.5 SAR	2025-12-25 15:06:30.601518
4147	1030	توزيع أرباح نقدية	2012-01-02	2012-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-25 توزيع 0.5 SAR	2025-12-25 15:06:30.601707
4148	1040	توزيع أرباح نقدية	2011-12-20	2012-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-27 توزيع 1.0 SAR	2025-12-25 15:06:30.601897
4149	1080	توزيع أرباح نقدية	2011-12-19	2012-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-01 توزيع 1.0 SAR	2025-12-25 15:06:30.612755
4150	1060	توزيع أسهم خزينة كأسهم منحة	2012-03-13	2012-03-14	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 10,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:30.613037
4151	1060	توزيع أرباح نقدية	2011-12-24	2012-03-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-20 توزيع 0.65 SAR	2025-12-25 15:06:30.613238
4152	8010	توزيع أرباح نقدية	2012-02-06	2012-03-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-17 توزيع 3.5 SAR	2025-12-25 15:06:30.61342
4153	7020	توزيع أرباح نقدية	2012-01-18	2012-03-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-01 توزيع 2.0 SAR	2025-12-25 15:06:30.613598
4154	4200	توزيع أسهم خزينة كأسهم منحة	2012-03-10	2012-03-11	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:30.61377
4155	4200	توزيع أرباح نقدية	2012-01-17	2012-03-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-04-09 توزيع 2.0 SAR	2025-12-25 15:06:30.613953
4156	3060	توزيع أرباح نقدية	2012-01-21	2012-03-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-24 توزيع 2.5 SAR	2025-12-25 15:06:30.614146
4157	4150	توزيع أرباح نقدية	2012-01-18	2012-03-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-27 توزيع 1.25 SAR	2025-12-25 15:06:30.61434
4158	4210	توزيع أرباح نقدية	2012-03-05	2012-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-06 توزيع 1.0 SAR	2025-12-25 15:06:30.614535
4159	4270	توزيع أرباح نقدية	2012-03-04	2012-03-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-05 توزيع 0.5 SAR	2025-12-25 15:06:30.614727
4160	1120	توزيع أرباح نقدية	2012-01-17	2012-03-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-11 توزيع 2.0 SAR	2025-12-25 15:06:30.614904
4161	2160	توزيع أرباح نقدية	2012-02-01	2012-03-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-03-10 توزيع 1.25 SAR	2025-12-25 15:06:30.615083
4162	8311	إدراج الشركة	2012-02-27	2012-02-27	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-02-27	2025-12-25 15:06:30.615296
4163	3020	تغيير اسم الشركة	2012-01-31	2012-02-27	\N	\N	\N	SAR	تم تعديل اسم الشركة من Yamama Saudi Cemen إلى Yamama Cement	2025-12-25 15:06:30.615502
4164	2330	توزيع أرباح نقدية	2012-02-21	2012-02-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-02-22 توزيع 1.0 SAR	2025-12-25 15:06:30.61569
4165	4190	توزيع أرباح نقدية	2012-02-08	2012-02-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-02-29 توزيع 1.6 SAR	2025-12-25 15:06:30.61601
4166	4010	توزيع أسهم خزينة كأسهم منحة	2012-02-19	2012-02-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:30.616328
4167	1201	إدراج الشركة	2012-02-07	2012-02-07	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2012-02-07	2025-12-25 15:06:30.616596
4168	2320	استحواذ على شركة	2012-02-01	2012-02-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Petitjean SAS	2025-12-25 15:06:30.616988
4169	4240	توزيع أرباح نقدية	2012-01-14	2012-01-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-02-20 توزيع 2.0 SAR	2025-12-25 15:06:30.617478
4170	7040	زيادة رأس مال - إصدار حقوق أولوية	2012-01-14	2012-01-15	\N	\N	\N	SAR	زياده راس المال من 400,000,000 SAR الى 1,575,000,000 SAR من خلال اصدار 117,500,000 سهم بسعر اصدار SAR 10.0  لكل سهم	2025-12-25 15:06:30.617891
4171	7204	زيادة رأس مال - اكتتاب خاص	2012-01-03	2012-01-04	\N	\N	\N	SAR	زيادة رأس المال من   4,125,000  الى 5,625,000 عن طريق تحويل سندات إلى 1,500,000 سهم	2025-12-25 15:06:30.618232
4172	2360	توزيع أرباح نقدية	2011-12-31	2012-01-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-01-01 توزيع 2.0 SAR	2025-12-25 15:06:30.618595
4173	4050	توزيع أرباح نقدية	2011-12-19	2011-12-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-01-11 توزيع 0.5 SAR	2025-12-25 15:06:30.618967
4174	3092	الإندماج مع شركة	2011-01-01	2011-12-31	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من Riyadh Cement Co - Liquidated	2025-12-25 15:06:30.619324
4175	4280	توزيع أرباح نقدية	2010-12-18	2011-12-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2012-01-11 توزيع 0.12 SAR	2025-12-25 15:06:30.619717
4176	7010	استحواذ على شركة	2011-12-28	2011-12-28	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Saudi Telecom Channels Co	2025-12-25 15:06:30.620091
4177	4190	توزيع أسهم خزينة كأسهم منحة	2011-12-25	2011-12-26	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 600,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:30.620448
4178	2230	توزيع أرباح نقدية	2011-12-25	2011-12-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-12-26 توزيع 2.0 SAR	2025-12-25 15:06:30.620803
4181	7010	استحواذ على شركة	2011-12-14	2011-12-13	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Gulf Digital Media Model Co	2025-12-25 15:06:30.621934
4182	2260	زيادة رأس مال - إصدار حقوق أولوية	2010-06-12	2011-11-30	\N	\N	\N	SAR	زياده راس المال من 2,925,300,000 SAR الى 4,387,950,000 SAR من خلال اصدار 146,265,000 سهم بسعر اصدار SAR 10.0  لكل سهم	2025-12-25 15:06:30.62309
4183	8130	زيادة رأس مال - إصدار حقوق أولوية	2011-11-19	2011-11-20	\N	\N	\N	SAR	زياده راس المال من 100,000,000 SAR الى 166,666,670 SAR من خلال اصدار 6,666,667 سهم بسعر اصدار SAR 12.0  لكل سهم	2025-12-25 15:06:30.623498
4184	7010	توزيع أرباح نقدية	2011-10-19	2011-10-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-11-16 توزيع 0.5 SAR	2025-12-25 15:06:30.623844
4185	4190	توزيع أرباح نقدية	2011-10-18	2011-10-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-11-01 توزيع 3.4 SAR	2025-12-25 15:06:30.624209
4186	2050	توزيع أرباح نقدية	2011-10-17	2011-10-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-11-02 توزيع 0.25 SAR	2025-12-25 15:06:30.62457
4187	3001	إدراج الشركة	2011-10-16	2011-10-16	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2011-10-16	2025-12-25 15:06:30.624925
4188	1301	توزيع أرباح نقدية	2011-10-08	2011-10-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-10-26 توزيع 0.75 SAR	2025-12-25 15:06:30.625278
4189	4020	توزيع أرباح نقدية	2011-10-04	2011-10-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-10-29 توزيع 0.5 SAR	2025-12-25 15:06:30.625613
4190	1320	توزيع أرباح نقدية	2011-09-28	2011-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-10-01 توزيع 0.75 SAR	2025-12-25 15:06:30.626084
4191	4090	توزيع أرباح نقدية	2011-09-21	2011-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-10-18 توزيع 0.25 SAR	2025-12-25 15:06:30.626516
4192	4280	توزيع أرباح نقدية	2010-12-18	2011-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-10-12 توزيع 0.12 SAR	2025-12-25 15:06:30.626946
4193	6050	زيادة رأس مال - إصدار حقوق أولوية	2011-09-14	2011-09-17	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:30.627434
4194	4090	توزيع أرباح نقدية	2011-08-21	2011-08-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-09-20 توزيع 0.5 SAR	2025-12-25 15:06:30.627814
4195	1301	إدراج الشركة	2011-08-21	2011-08-21	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2011-08-21	2025-12-25 15:06:30.628314
4196	4100	توزيع أرباح نقدية	2011-05-30	2011-08-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-24 توزيع 1.5 SAR	2025-12-25 15:06:30.628642
4197	1320	استحواذ على شركة	2011-08-17	2011-08-17	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Chemical Development Co	2025-12-25 15:06:30.628926
4198	4010	توزيع أرباح نقدية	2011-08-09	2011-08-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-09-14 توزيع 0.5 SAR	2025-12-25 15:06:30.629203
4199	4070	توزيع أرباح نقدية	2011-05-22	2011-08-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-10-03 توزيع 1.5 SAR	2025-12-25 15:06:30.629528
4200	7040	تخفيض رأس مال - بتخفيض عدد الأسهم	2011-08-06	2011-08-07	\N	\N	\N	SAR	تخفيض رأس المال من   1,000,000,000  الى 400,000,000  وعدد الاسهم الى 40,000,000 بقيمة اسمية للسهم 10 	2025-12-25 15:06:30.629825
4201	6002	توزيع أرباح نقدية	2011-08-01	2011-08-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-02 توزيع 1.5 SAR	2025-12-25 15:06:31.287356
4202	6002	توزيع أسهم خزينة كأسهم منحة	2011-08-01	2011-08-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:31.288188
4203	4190	توزيع أرباح نقدية	2011-07-19	2011-08-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-15 توزيع 2.0 SAR	2025-12-25 15:06:31.288626
4204	2240	توزيع أرباح نقدية	2011-07-31	2011-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-01 توزيع 0.75 SAR	2025-12-25 15:06:31.289036
4205	7020	توزيع أرباح نقدية	2011-07-23	2011-07-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-14 توزيع 1.25 SAR	2025-12-25 15:06:31.289414
4206	7010	توزيع أرباح نقدية	2011-07-18	2011-07-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-10 توزيع 0.5 SAR	2025-12-25 15:06:31.289839
4207	2050	توزيع أرباح نقدية	2011-07-19	2011-07-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-08 توزيع 0.25 SAR	2025-12-25 15:06:31.290251
4208	2010	توزيع أرباح نقدية	2011-07-16	2011-07-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-06 توزيع 2.0 SAR	2025-12-25 15:06:31.290735
4209	3050	توزيع أرباح نقدية	2011-06-20	2011-07-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-23 توزيع 2.75 SAR	2025-12-25 15:06:31.291137
4210	1120	توزيع أرباح نقدية	2011-07-11	2011-07-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-25 توزيع 1.25 SAR	2025-12-25 15:06:31.291563
4211	3090	توزيع أرباح نقدية	2011-07-03	2011-07-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-08-08 توزيع 0.9 SAR	2025-12-25 15:06:31.291917
4212	1010	توزيع أرباح نقدية	2011-07-06	2011-07-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-25 توزيع 0.55 SAR	2025-12-25 15:06:31.292328
4213	2020	توزيع أرباح نقدية	2011-07-10	2011-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-27 توزيع 6.0 SAR	2025-12-25 15:06:31.29277
4214	2360	توزيع أرباح نقدية	2011-07-10	2011-07-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-11 توزيع 2.0 SAR	2025-12-25 15:06:31.293348
4215	1050	توزيع أرباح نقدية	2011-06-25	2011-07-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-16 توزيع 0.7 SAR	2025-12-25 15:06:31.293722
4216	2330	توزيع أرباح نقدية	2011-06-29	2011-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-02 توزيع 1.0 SAR	2025-12-25 15:06:31.294075
4217	1090	توزيع أرباح نقدية	2011-06-26	2011-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-09 توزيع 0.8 SAR	2025-12-25 15:06:31.294478
4218	3040	توزيع أرباح نقدية	2011-06-21	2011-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-20 توزيع 2.25 SAR	2025-12-25 15:06:31.294872
4219	3020	توزيع أرباح نقدية	2011-06-20	2011-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-16 توزيع 2.0 SAR	2025-12-25 15:06:31.29531
4220	3010	توزيع أرباح نقدية	2011-06-19	2011-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-31 توزيع 1.0 SAR	2025-12-25 15:06:31.295708
4221	4280	توزيع أرباح نقدية	2010-12-18	2011-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-13 توزيع 0.12 SAR	2025-12-25 15:06:31.296079
4222	2270	توزيع أرباح نقدية	2011-06-28	2011-06-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-06-29 توزيع 3.0 SAR	2025-12-25 15:06:31.296446
4223	7050	إدراج الشركة	2011-06-28	2011-06-28	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2011-06-28	2025-12-25 15:06:31.296798
4224	8190	توزيع أرباح نقدية	2011-06-26	2011-06-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-23 توزيع 1.0 SAR	2025-12-25 15:06:31.297188
4225	2110	توزيع أرباح نقدية	2011-04-30	2011-06-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-07-09 توزيع 0.38 SAR	2025-12-25 15:06:31.29765
4226	2110	توزيع أرباح نقدية	2011-04-30	2011-06-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-06-08 توزيع 0.38 SAR	2025-12-25 15:06:31.298035
4227	1310	توزيع أرباح نقدية	2011-05-31	2011-06-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-06-01 توزيع 0.75 SAR	2025-12-25 15:06:31.298399
4228	4250	زيادة رأس مال - إصدار حقوق أولوية	2011-05-28	2011-05-29	\N	\N	\N	SAR	زياده راس المال من 6,714,000,000 SAR الى 9,294,000,000 SAR من خلال اصدار 258,000,000 سهم بسعر اصدار SAR 10.0  لكل سهم	2025-12-25 15:06:31.298793
4229	1310	استحواذ على شركة	2011-05-21	2011-05-21	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Gulf Elite General Contracting Co	2025-12-25 15:06:31.299197
4230	2320	زيادة رأس مال - اكتتاب خاص	2011-05-14	2011-05-15	\N	\N	\N	SAR	زيادة رأس المال من   405,000,000  الى 426,313,120 عن طريق تحويل سندات إلى 2,131,312 سهم	2025-12-25 15:06:31.299685
4231	8030	توزيع أرباح نقدية	2011-05-08	2011-05-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-06-06 توزيع 1.25 SAR	2025-12-25 15:06:31.300189
4232	4190	توزيع أرباح نقدية	2011-04-25	2011-05-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-11 توزيع 2.7 SAR	2025-12-25 15:06:31.300682
4233	4080	توزيع أرباح نقدية	2011-01-19	2011-04-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-21 توزيع 0.75 SAR	2025-12-25 15:06:31.301318
4234	7010	توزيع أرباح نقدية	2011-04-19	2011-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-11 توزيع 0.5 SAR	2025-12-25 15:06:31.301887
4235	2340	توزيع أرباح نقدية	2011-04-25	2011-04-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-26 توزيع 1.0 SAR	2025-12-25 15:06:31.302443
4236	2050	توزيع أرباح نقدية	2011-04-19	2011-04-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-10 توزيع 0.25 SAR	2025-12-25 15:06:31.302967
4237	3090	توزيع أرباح نقدية	2011-02-14	2011-04-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-18 توزيع 0.45 SAR	2025-12-25 15:06:31.303494
4238	2010	توزيع أرباح نقدية	2010-12-20	2011-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-07 توزيع 2.0 SAR	2025-12-25 15:06:31.304003
4239	2250	توزيع أرباح نقدية	2010-12-11	2011-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-02 توزيع 0.5 SAR	2025-12-25 15:06:31.304469
4240	4260	توزيع أرباح نقدية	2011-04-19	2011-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-17 توزيع 2.25 SAR	2025-12-25 15:06:31.304962
4241	4230	توزيع أرباح نقدية	2011-04-19	2011-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-03 توزيع 1.0 SAR	2025-12-25 15:06:31.305386
4242	4090	توزيع أرباح نقدية	2011-02-23	2011-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-09 توزيع 0.7 SAR	2025-12-25 15:06:31.305842
4243	4150	توزيع أرباح نقدية	2011-02-14	2011-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-08 توزيع 1.0 SAR	2025-12-25 15:06:31.306298
4244	4210	توزيع أرباح نقدية	2011-04-18	2011-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-07 توزيع 1.0 SAR	2025-12-25 15:06:31.306782
4245	6002	توزيع أرباح نقدية	2011-04-17	2011-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-27 توزيع 1.5 SAR	2025-12-25 15:06:31.307298
4246	4290	توزيع أسهم خزينة كأسهم منحة	2011-02-21	2011-04-17	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:31.307817
4247	4290	توزيع أرباح نقدية	2011-02-21	2011-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:31.309228
4248	4290	زيادة رأس المال المصرح به	2011-02-21	2011-04-17	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  150000000 إلى  200000000	2025-12-25 15:06:31.309737
4249	2070	توزيع أرباح نقدية	2011-02-20	2011-04-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-04 توزيع 1.5 SAR	2025-12-25 15:06:31.310261
4250	6040	توزيع أرباح نقدية	2011-02-14	2011-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-11 توزيع 0.5 SAR	2025-12-25 15:06:31.310908
4251	1210	توزيع أرباح نقدية	2011-04-05	2011-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-24 توزيع 1.0 SAR	2025-12-25 15:06:31.311418
4252	2240	توزيع أرباح نقدية	2011-04-04	2011-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-05 توزيع 0.75 SAR	2025-12-25 15:06:31.311906
4253	2060	توزيع أرباح نقدية	2011-02-21	2011-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-19 توزيع 1.0 SAR	2025-12-25 15:06:31.31239
4254	5110	توزيع أرباح نقدية	2011-02-21	2011-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-30 توزيع 0.7 SAR	2025-12-25 15:06:31.312891
4255	4270	توزيع أرباح نقدية	2011-04-03	2011-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-01 توزيع 0.5 SAR	2025-12-25 15:06:31.313423
5169	2080	توزيع أرباح نقدية	2001-03-18	2001-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.639998
4256	3010	توزيع أرباح نقدية	2011-02-27	2011-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-17 توزيع 1.0 SAR	2025-12-25 15:06:31.313937
4257	4040	توزيع أرباح نقدية	2011-01-23	2011-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-20 توزيع 0.5 SAR	2025-12-25 15:06:31.315283
4258	2020	توزيع أرباح نقدية	2010-12-06	2011-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-16 توزيع 6.0 SAR	2025-12-25 15:06:31.315838
4259	2280	توزيع أرباح نقدية	2010-12-06	2011-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-11 توزيع 2.25 SAR	2025-12-25 15:06:31.316456
4260	2320	توزيع أرباح نقدية	2011-03-30	2011-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-23 توزيع 1.5 SAR	2025-12-25 15:06:31.317045
4261	8010	توزيع أسهم خزينة كأسهم منحة	2011-03-30	2011-04-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 750,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:31.317571
4262	2030	توزيع أرباح نقدية	2011-02-16	2011-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-05-03 توزيع 0.5 SAR	2025-12-25 15:06:31.318095
4263	8010	توزيع أرباح نقدية	2011-02-12	2011-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-06 توزيع 3.0 SAR	2025-12-25 15:06:31.318586
4264	2180	توزيع أرباح نقدية	2011-01-18	2011-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-23 توزيع 1.0 SAR	2025-12-25 15:06:31.319198
4265	2360	توزيع أرباح نقدية	2011-03-29	2011-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-30 توزيع 3.0 SAR	2025-12-25 15:06:31.319872
4266	4030	توزيع أرباح نقدية	2011-02-22	2011-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-13 توزيع 1.0 SAR	2025-12-25 15:06:31.322407
4267	7010	توزيع أرباح نقدية	2011-03-19	2011-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-13 توزيع 0.75 SAR	2025-12-25 15:06:31.323474
4268	2080	توزيع أرباح نقدية	2011-02-23	2011-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-27 توزيع 0.7 SAR	2025-12-25 15:06:31.323952
4269	4001	توزيع أرباح نقدية	2011-01-18	2011-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-12 توزيع 3.0 SAR	2025-12-25 15:06:31.324333
4270	4002	توزيع أرباح نقدية	2011-01-18	2011-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-16 توزيع 2.0 SAR	2025-12-25 15:06:31.324729
4271	2050	توزيع أرباح نقدية	2011-01-17	2011-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-04 توزيع 0.25 SAR	2025-12-25 15:06:31.325146
4272	1213	توزيع أرباح نقدية	2011-03-27	2011-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-13 توزيع 1.0 SAR	2025-12-25 15:06:31.325571
4273	1080	توزيع أسهم خزينة كأسهم منحة	2011-03-27	2011-03-28	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 8,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:31.325982
4274	3080	توزيع أرباح نقدية	2011-02-14	2011-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-06 توزيع 3.5 SAR	2025-12-25 15:06:31.326383
4275	1050	توزيع أرباح نقدية	2011-01-06	2011-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-09 توزيع 1.0 SAR	2025-12-25 15:06:31.326774
4276	4280	توزيع أرباح نقدية	2010-12-18	2011-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-10 توزيع 0.12 SAR	2025-12-25 15:06:31.327163
4277	1030	توزيع أسهم خزينة كأسهم منحة	2011-03-26	2011-03-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 5,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:31.327563
4278	2300	توزيع أرباح نقدية	2011-03-26	2011-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-27 توزيع 1.5 SAR	2025-12-25 15:06:31.327935
4279	4010	توزيع أرباح نقدية	2011-02-20	2011-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-11 توزيع 1.0 SAR	2025-12-25 15:06:31.328281
4280	6001	توزيع أرباح نقدية	2011-01-29	2011-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-16 توزيع 1.5 SAR	2025-12-25 15:06:31.328587
4281	3040	توزيع أرباح نقدية	2011-02-23	2011-03-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-09 توزيع 2.75 SAR	2025-12-25 15:06:31.328933
4282	2310	توزيع أسهم خزينة كأسهم منحة	2011-03-15	2011-03-16	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,666,666,660  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:31.329748
4283	1060	توزيع أرباح نقدية	2011-01-26	2011-03-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-22 توزيع 0.68 SAR	2025-12-25 15:06:31.330194
4284	1010	توزيع أرباح نقدية	2011-01-31	2011-03-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-27 توزيع 0.7 SAR	2025-12-25 15:06:31.330792
4285	2330	توزيع أرباح نقدية	2011-03-13	2011-03-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-14 توزيع 1.0 SAR	2025-12-25 15:06:31.33123
4286	4200	توزيع أرباح نقدية	2011-01-17	2011-03-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-05 توزيع 2.0 SAR	2025-12-25 15:06:31.331717
4287	6070	توزيع أسهم خزينة كأسهم منحة	2011-03-09	2011-03-12	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:31.332113
4288	3060	توزيع أرباح نقدية	2011-03-05	2011-03-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-04-04 توزيع 2.0 SAR	2025-12-25 15:06:31.332528
4289	3050	توزيع أرباح نقدية	2011-03-01	2011-03-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-19 توزيع 2.5 SAR	2025-12-25 15:06:31.332955
4290	1320	توزيع أرباح نقدية	2011-03-07	2011-03-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-08 توزيع 1.0 SAR	2025-12-25 15:06:31.333396
4291	1120	توزيع أرباح نقدية	2011-01-19	2011-03-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-14 توزيع 1.5 SAR	2025-12-25 15:06:31.333794
4292	4240	توزيع أرباح نقدية	2011-03-01	2011-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-29 توزيع 2.5 SAR	2025-12-25 15:06:31.334226
4293	3020	توزيع أرباح نقدية	2011-01-16	2011-02-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-12 توزيع 2.0 SAR	2025-12-25 15:06:31.33471
4294	2160	توزيع أرباح نقدية	2010-12-28	2011-02-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-09 توزيع 1.5 SAR	2025-12-25 15:06:31.335165
4295	7020	توزيع أرباح نقدية	2011-01-16	2011-02-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-03-13 توزيع 2.0 SAR	2025-12-25 15:06:31.335661
4296	4190	توزيع أرباح نقدية	2011-02-08	2011-02-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-02-28 توزيع 2.0 SAR	2025-12-25 15:06:31.336162
4297	1090	توزيع أرباح نقدية	2011-01-04	2011-02-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-02-20 توزيع 0.75 SAR	2025-12-25 15:06:31.336671
4298	2200	استحواذ على شركة	2011-01-01	2011-01-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Arabian-Yadong Coating Co Ltd	2025-12-25 15:06:31.337221
4299	4031	استحواذ على شركة	2010-02-07	2011-01-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Saudi Arabian Airlines Corp	2025-12-25 15:06:31.337743
4300	4031	استحواذ على شركة	2010-02-07	2011-01-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع National Handling Services Co Ltd	2025-12-25 15:06:31.33829
4301	4031	استحواذ على شركة	2010-02-07	2011-01-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Attar Ground Services Ltd	2025-12-25 15:06:32.002966
4302	4050	توزيع أرباح نقدية	2010-12-01	2010-12-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2011-01-04 توزيع 0.5 SAR	2025-12-25 15:06:32.003792
4303	2280	توزيع أسهم خزينة كأسهم منحة	2010-12-05	2010-12-06	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:32.004427
4304	1330	توزيع أرباح نقدية	2010-11-29	2010-11-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-11-30 توزيع 1.3 SAR	2025-12-25 15:06:32.004852
4305	2340	توزيع أرباح نقدية	2010-11-22	2010-11-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-12-18 توزيع 1.5 SAR	2025-12-25 15:06:32.005368
4306	7010	توزيع أرباح نقدية	2010-10-19	2010-10-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-11-24 توزيع 0.75 SAR	2025-12-25 15:06:32.005773
4307	2050	توزيع أرباح نقدية	2010-10-18	2010-10-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-11-02 توزيع 0.25 SAR	2025-12-25 15:06:32.006282
4308	4190	توزيع أرباح نقدية	2010-10-18	2010-10-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-11-07 توزيع 2.0 SAR	2025-12-25 15:06:32.006799
4309	8040	تغيير اسم الشركة	2010-09-01	2010-09-06	\N	\N	\N	SAR	تم تعديل اسم الشركة	2025-12-25 15:06:32.007234
4310	4010	توزيع أرباح نقدية	2010-08-21	2010-08-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-09-05 توزيع 0.5 SAR	2025-12-25 15:06:32.007706
4311	4100	توزيع أرباح نقدية	2010-06-05	2010-08-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-24 توزيع 1.5 SAR	2025-12-25 15:06:32.008312
4312	2240	توزيع أرباح نقدية	2010-07-31	2010-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-14 توزيع 0.75 SAR	2025-12-25 15:06:32.008881
4313	4190	توزيع أرباح نقدية	2010-07-20	2010-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-18 توزيع 1.55 SAR	2025-12-25 15:06:32.010127
4314	6002	توزيع أرباح نقدية	2010-07-28	2010-07-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-10 توزيع 1.5 SAR	2025-12-25 15:06:32.01076
4315	7010	توزيع أرباح نقدية	2010-07-20	2010-07-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-11 توزيع 0.75 SAR	2025-12-25 15:06:32.011698
4316	3040	توزيع أرباح نقدية	2010-06-26	2010-07-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-14 توزيع 2.25 SAR	2025-12-25 15:06:32.012398
4317	2010	توزيع أرباح نقدية	2010-07-18	2010-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-07 توزيع 1.5 SAR	2025-12-25 15:06:32.013913
4318	2050	توزيع أرباح نقدية	2010-07-18	2010-07-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-07-28 توزيع 0.25 SAR	2025-12-25 15:06:32.014593
4319	3050	توزيع أرباح نقدية	2010-07-17	2010-07-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-07-24 توزيع 2.0 SAR	2025-12-25 15:06:32.015085
4320	3020	توزيع أرباح نقدية	2010-07-12	2010-07-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-07-31 توزيع 2.0 SAR	2025-12-25 15:06:32.015589
4321	1120	توزيع أرباح نقدية	2010-07-10	2010-07-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-07-19 توزيع 1.5 SAR	2025-12-25 15:06:32.016064
4322	1010	توزيع أرباح نقدية	2010-07-10	2010-07-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-07-24 توزيع 0.6 SAR	2025-12-25 15:06:32.016474
4323	2020	توزيع أرباح نقدية	2010-07-03	2010-07-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-07-21 توزيع 6.0 SAR	2025-12-25 15:06:32.016814
4324	3090	توزيع أرباح نقدية	2010-06-29	2010-07-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-08-17 توزيع 0.9 SAR	2025-12-25 15:06:32.017102
4325	2330	توزيع أرباح نقدية	2010-06-30	2010-07-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-07-03 توزيع 0.75 SAR	2025-12-25 15:06:32.017425
4326	2270	توزيع أرباح نقدية	2010-06-26	2010-06-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-06-27 توزيع 1.5 SAR	2025-12-25 15:06:32.017726
4327	4300	توزيع أرباح نقدية	2010-05-19	2010-06-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:32.018238
4328	4150	توزيع أرباح نقدية	2010-02-23	2010-06-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-06-22 توزيع 0.5 SAR	2025-12-25 15:06:32.018726
4329	7204	توزيع أرباح نقدية	2010-05-31	2010-06-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-06-01 توزيع 0.05 USD	2025-12-25 15:06:32.019136
4330	1310	توزيع أرباح نقدية	2010-05-29	2010-05-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-30 توزيع 0.75 SAR	2025-12-25 15:06:32.019463
4331	2250	توزيع أرباح نقدية	2010-02-23	2010-05-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-06-01 توزيع 0.5 SAR	2025-12-25 15:06:32.01979
4332	3030	توزيع أسهم خزينة كأسهم منحة	2010-05-18	2010-05-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,530,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:32.020717
4333	2150	توزيع أسهم خزينة كأسهم منحة	2010-05-09	2010-05-10	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.021024
4334	2030	توزيع أرباح نقدية	2010-02-22	2010-05-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-06-15 توزيع 0.5 SAR	2025-12-25 15:06:32.021376
4335	4080	توزيع أرباح نقدية	2009-12-29	2010-05-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-29 توزيع 0.75 SAR	2025-12-25 15:06:32.021662
4336	7010	توزيع أرباح نقدية	2010-04-19	2010-05-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-12 توزيع 0.75 SAR	2025-12-25 15:06:32.022048
4337	2060	توزيع أسهم خزينة كأسهم منحة	2010-04-26	2010-04-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 5,067,531,560  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.02257
4338	2160	توزيع أرباح نقدية	2010-03-03	2010-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-22 توزيع 1.0 SAR	2025-12-25 15:06:32.023075
4339	2060	توزيع أرباح نقدية	2010-02-22	2010-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-12 توزيع 0.75 SAR	2025-12-25 15:06:32.023573
4340	4210	توزيع أرباح نقدية	2010-04-25	2010-04-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-15 توزيع 0.5 SAR	2025-12-25 15:06:32.024129
4341	2220	توزيع أرباح نقدية	2010-04-24	2010-04-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-25 توزيع 0.5 SAR	2025-12-25 15:06:32.02465
4342	2110	توزيع أرباح نقدية	2010-03-20	2010-04-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-24 توزيع 0.75 SAR	2025-12-25 15:06:32.025124
4343	4240	توزيع أرباح نقدية	2010-04-19	2010-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-30 توزيع 2.0 SAR	2025-12-25 15:06:32.02555
4344	2050	توزيع أرباح نقدية	2010-04-18	2010-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-27 توزيع 0.5 SAR	2025-12-25 15:06:32.025934
4345	4230	توزيع أرباح نقدية	2010-04-19	2010-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-18 توزيع 2.0 SAR	2025-12-25 15:06:32.026396
4346	2050	توزيع أرباح نقدية	2010-01-18	2010-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-26 توزيع 0.25 SAR	2025-12-25 15:06:32.026832
4347	4090	توزيع أرباح نقدية	2010-02-24	2010-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-16 توزيع 0.3 SAR	2025-12-25 15:06:32.027244
4348	2010	توزيع أرباح نقدية	2009-12-21	2010-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-01 توزيع 1.5 SAR	2025-12-25 15:06:32.027647
4349	4260	توزيع أرباح نقدية	2010-04-14	2010-04-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-11 توزيع 2.0 SAR	2025-12-25 15:06:32.028066
4350	1210	توزيع أرباح نقدية	2010-04-14	2010-04-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-03 توزيع 1.0 SAR	2025-12-25 15:06:32.029331
4351	2070	توزيع أرباح نقدية	2010-02-21	2010-04-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-05 توزيع 1.5 SAR	2025-12-25 15:06:32.02973
4352	6002	توزيع أرباح نقدية	2010-04-12	2010-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-01 توزيع 0.75 SAR	2025-12-25 15:06:32.030116
4353	4020	توزيع أرباح نقدية	2010-03-09	2010-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-15 توزيع 0.75 SAR	2025-12-25 15:06:32.030461
4354	2080	توزيع أرباح نقدية	2010-02-22	2010-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-01 توزيع 0.5 SAR	2025-12-25 15:06:32.030914
4355	2280	توزيع أرباح نقدية	2010-01-20	2010-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-26 توزيع 4.0 SAR	2025-12-25 15:06:32.031266
4356	7010	توزيع أرباح نقدية	2010-01-19	2010-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-21 توزيع 0.75 SAR	2025-12-25 15:06:32.031667
4357	6001	توزيع أرباح نقدية	2010-02-22	2010-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-26 توزيع 1.0 SAR	2025-12-25 15:06:32.031992
4358	4001	توزيع أرباح نقدية	2010-02-14	2010-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-28 توزيع 2.5 SAR	2025-12-25 15:06:32.032303
4359	2300	توزيع أرباح نقدية	2010-04-06	2010-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-07 توزيع 1.25 SAR	2025-12-25 15:06:32.032605
4360	6040	توزيع أرباح نقدية	2010-02-20	2010-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-23 توزيع 0.5 SAR	2025-12-25 15:06:32.032915
4361	8030	توزيع أرباح نقدية	2010-04-04	2010-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-03 توزيع 0.75 SAR	2025-12-25 15:06:32.03321
4362	5110	توزيع أرباح نقدية	2010-02-24	2010-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-03 توزيع 0.7 SAR	2025-12-25 15:06:32.033554
4363	4290	توزيع أرباح نقدية	2010-02-21	2010-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:32.033932
4364	4010	توزيع أرباح نقدية	2010-02-22	2010-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-19 توزيع 0.9 SAR	2025-12-25 15:06:32.034311
4365	3090	توزيع أرباح نقدية	2010-01-27	2010-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-05-03 توزيع 0.5 SAR	2025-12-25 15:06:32.034665
4366	8040	زيادة رأس مال - إصدار حقوق أولوية	2010-04-03	2010-04-04	\N	\N	\N	SAR	زياده راس المال من 100,000,000 SAR الى 200,000,000 SAR من خلال اصدار 10,000,000 سهم بسعر اصدار SAR 12.5  لكل سهم	2025-12-25 15:06:32.035037
4367	4030	توزيع أرباح نقدية	2010-01-19	2010-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-11 توزيع 1.0 SAR	2025-12-25 15:06:32.035503
4368	2240	توزيع أرباح نقدية	2010-03-31	2010-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-03 توزيع 1.5 SAR	2025-12-25 15:06:32.035973
4369	2240	توزيع أسهم خزينة كأسهم منحة	2010-03-31	2010-04-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 600,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.036359
4370	2340	توزيع أرباح نقدية	2010-03-31	2010-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-03 توزيع 3.5 SAR	2025-12-25 15:06:32.036685
4371	4090	توزيع أرباح نقدية	2010-03-21	2010-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-27 توزيع 0.3 SAR	2025-12-25 15:06:32.03698
4372	4002	توزيع أرباح نقدية	2010-01-26	2010-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-25 توزيع 1.0 SAR	2025-12-25 15:06:32.037322
4373	2320	توزيع أرباح نقدية	2010-03-29	2010-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-30 توزيع 1.5 SAR	2025-12-25 15:06:32.037678
4374	3080	توزيع أرباح نقدية	2010-02-21	2010-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-11 توزيع 3.0 SAR	2025-12-25 15:06:32.038148
4375	2310	توزيع أرباح نقدية	2009-12-23	2010-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-12 توزيع 1.0 SAR	2025-12-25 15:06:32.038613
4376	3040	توزيع أرباح نقدية	2010-02-22	2010-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-12 توزيع 3.0 SAR	2025-12-25 15:06:32.039054
4377	3030	توزيع أرباح نقدية	2010-02-24	2010-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-07 توزيع 3.5 SAR	2025-12-25 15:06:32.039537
4378	2040	توزيع أرباح نقدية	2009-12-28	2010-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-06 توزيع 3.0 SAR	2025-12-25 15:06:32.039932
4379	3010	توزيع أرباح نقدية	2010-02-10	2010-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-04 توزيع 0.25 SAR	2025-12-25 15:06:32.04034
4380	1080	توزيع أرباح نقدية	2010-01-16	2010-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-04 توزيع 1.0 SAR	2025-12-25 15:06:32.040753
4381	2020	توزيع أرباح نقدية	2010-02-21	2010-03-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-01 توزيع 7.0 SAR	2025-12-25 15:06:32.041064
4382	1320	توزيع أرباح نقدية	2010-03-15	2010-03-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-16 توزيع 2.0 SAR	2025-12-25 15:06:32.041363
4383	4200	توزيع أرباح نقدية	2010-01-19	2010-03-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-04-10 توزيع 1.5 SAR	2025-12-25 15:06:32.042566
4384	3050	توزيع أرباح نقدية	2010-01-30	2010-03-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-20 توزيع 2.5 SAR	2025-12-25 15:06:32.042973
4385	2330	توزيع أرباح نقدية	2010-03-09	2010-03-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-10 توزيع 0.5 SAR	2025-12-25 15:06:32.043372
4386	8010	توزيع أرباح نقدية	2010-02-01	2010-03-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-31 توزيع 4.0 SAR	2025-12-25 15:06:32.043788
4387	1050	توزيع أرباح نقدية	2010-01-19	2010-03-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-20 توزيع 1.0 SAR	2025-12-25 15:06:32.044189
4388	3060	توزيع أرباح نقدية	2010-02-06	2010-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-20 توزيع 3.0 SAR	2025-12-25 15:06:32.044572
4389	1010	توزيع أرباح نقدية	2010-01-18	2010-03-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-10 توزيع 0.7 SAR	2025-12-25 15:06:32.044963
4390	3020	توزيع أرباح نقدية	2010-01-19	2010-02-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-13 توزيع 2.0 SAR	2025-12-25 15:06:32.045357
4391	1120	توزيع أرباح نقدية	2010-01-18	2010-02-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-03-06 توزيع 1.5 SAR	2025-12-25 15:06:32.045789
4392	3020	استحواذ على شركة	2010-02-21	2010-02-21	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Yemen Saudi Cement Co	2025-12-25 15:06:32.046269
4393	4190	توزيع أرباح نقدية	2010-02-08	2010-02-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-02-21 توزيع 2.3 SAR	2025-12-25 15:06:32.046643
4394	4280	تخفيض رأس مال - بتخفيض عدد الأسهم	2010-02-10	2010-02-13	\N	\N	\N	SAR	تخفيض رأس المال من   63,000,000,000  الى 37,058,823,000  وعدد الاسهم الى 3,705,882,300 بقيمة اسمية للسهم 10 	2025-12-25 15:06:32.047023
4395	2270	توزيع أرباح نقدية	2010-01-26	2010-01-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-01-27 توزيع 1.5 SAR	2025-12-25 15:06:32.047446
4396	2230	توزيع أرباح نقدية	2009-12-30	2010-01-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2010-01-09 توزيع 2.5 SAR	2025-12-25 15:06:32.04782
4397	2180	توزيع أسهم خزينة كأسهم منحة	2009-12-28	2009-12-29	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 115,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:32.048147
4398	2280	استحواذ على شركة	2008-11-08	2009-12-27	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Hail Agricultural Development Co.	2025-12-25 15:06:32.048468
4399	1212	استحواذ على شركة	2009-11-24	2009-11-24	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Tanmiya for Steel Manufacturing	2025-12-25 15:06:32.048869
4400	3040	توزيع أسهم خزينة كأسهم منحة	2009-11-16	2009-11-17	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 900,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:32.049209
4401	4190	توزيع أرباح نقدية	2009-10-19	2009-11-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-11-10 توزيع 1.7 SAR	2025-12-25 15:06:32.640063
4402	7040	تغيير السنة المالية	2009-11-02	2009-11-02	\N	\N	\N	SAR	تاريخ نهاية الحق فىتغيير السنة المالية	2025-12-25 15:06:32.640982
4403	7010	توزيع أرباح نقدية	2009-10-19	2009-10-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-11-11 توزيع 0.75 SAR	2025-12-25 15:06:32.641515
4404	2050	توزيع أرباح نقدية	2009-10-18	2009-10-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-11-01 توزيع 0.25 SAR	2025-12-25 15:06:32.641994
4405	6030	إلغاء الإدراج	2009-10-17	2009-10-17	\N	\N	\N	SAR	إلغاء التداول على أسهم الشركة اعتباراً من 2009-10-17	2025-12-25 15:06:32.642434
4406	2280	زيادة رأس مال - اكتتاب خاص	2009-10-14	2009-10-17	\N	\N	\N	SAR	زيادة رأس المال من   1,090,000,000  الى 1,150,000,000 عن طريق تحويل سندات إلى 6,000,000 سهم	2025-12-25 15:06:32.643529
4407	2280	استحواذ على شركة	2009-10-15	2009-10-15	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Ernst and Young - Bahrain	2025-12-25 15:06:32.643935
4408	4090	توزيع أرباح نقدية	2009-09-28	2009-10-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-10-20 توزيع 0.3 SAR	2025-12-25 15:06:32.644408
4409	2280	استحواذ على شركة	2009-09-30	2009-09-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Yara Ceramica	2025-12-25 15:06:32.64478
4410	4010	توزيع أرباح نقدية	2009-08-24	2009-08-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-09-13 توزيع 0.6 SAR	2025-12-25 15:06:32.646197
4411	4070	توزيع أرباح نقدية	2009-06-02	2009-08-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-10-06 توزيع 1.2 SAR	2025-12-25 15:06:32.646716
4412	2260	زيادة رأس مال - إصدار حقوق أولوية	2009-06-27	2009-08-23	\N	\N	\N	SAR	زياده راس المال من 1,875,000,000 SAR الى 2,925,300,000 SAR من خلال اصدار 105,030,000 سهم بسعر اصدار SAR 10.0  لكل سهم	2025-12-25 15:06:32.647399
4413	1210	توزيع أسهم خزينة كأسهم منحة	2009-08-18	2009-08-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 275,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.647965
4414	4100	توزيع أرباح نقدية	2009-06-16	2009-08-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-18 توزيع 1.5 SAR	2025-12-25 15:06:32.648681
4415	4190	توزيع أرباح نقدية	2009-07-06	2009-08-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-18 توزيع 1.5 SAR	2025-12-25 15:06:32.649249
4416	8080	زيادة رأس مال - إصدار حقوق أولوية	2009-08-08	2009-08-09	\N	\N	\N	SAR	زياده راس المال من 100,000,000 SAR الى 340,000,000 SAR من خلال اصدار 24,000,000 سهم بسعر اصدار SAR 12.0  لكل سهم	2025-12-25 15:06:32.649688
4417	2330	تغيير اسم الشركة	2009-03-03	2009-08-05	\N	\N	\N	SAR	تم تعديل اسم الشركة	2025-12-25 15:06:32.650015
4418	2110	استحواذ على شركة	2009-08-02	2009-08-02	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Elimsan Şalt Cihazlari Ve Elektromekanik Sanayi Ve Ticaret Anonim Şirketi	2025-12-25 15:06:32.6504
4419	7010	توزيع أرباح نقدية	2009-07-21	2009-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-12 توزيع 0.75 SAR	2025-12-25 15:06:32.650889
4420	3010	توزيع أرباح نقدية	2009-07-20	2009-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-22 توزيع 1.0 SAR	2025-12-25 15:06:32.651265
4421	3040	توزيع أرباح نقدية	2009-07-04	2009-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-22 توزيع 6.0 SAR	2025-12-25 15:06:32.65158
4422	2330	توزيع أرباح نقدية	2009-07-25	2009-07-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-19 توزيع 0.5 SAR	2025-12-25 15:06:32.651907
4423	3020	توزيع أرباح نقدية	2009-07-13	2009-07-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-03 توزيع 1.0 SAR	2025-12-25 15:06:32.652201
4424	1120	توزيع أرباح نقدية	2009-07-14	2009-07-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-07-26 توزيع 1.25 SAR	2025-12-25 15:06:32.652535
4425	3090	توزيع أرباح نقدية	2009-07-14	2009-07-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-01 توزيع 0.75 SAR	2025-12-25 15:06:32.652951
4426	2020	توزيع أرباح نقدية	2009-07-11	2009-07-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-07-25 توزيع 5.0 SAR	2025-12-25 15:06:32.653409
4427	6001	توزيع أرباح نقدية	2009-07-05	2009-07-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-08-01 توزيع 0.75 SAR	2025-12-25 15:06:32.653933
4428	3050	توزيع أرباح نقدية	2009-07-12	2009-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-07-21 توزيع 2.5 SAR	2025-12-25 15:06:32.654333
4429	1010	توزيع أرباح نقدية	2009-07-08	2009-07-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-07-20 توزيع 0.6 SAR	2025-12-25 15:06:32.654656
4430	4300	توزيع أسهم خزينة كأسهم منحة	2009-05-23	2009-07-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 10,800,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:32.655007
4431	1210	توزيع أرباح نقدية	2009-06-30	2009-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-07-21 توزيع 0.5 SAR	2025-12-25 15:06:32.655328
4432	4090	توزيع أرباح نقدية	2009-06-21	2009-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-07-21 توزيع 0.3 SAR	2025-12-25 15:06:32.65593
4433	4190	توزيع أسهم خزينة كأسهم منحة	2009-06-03	2009-06-06	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 400,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.657256
4434	7204	توزيع أرباح نقدية	2009-05-26	2009-05-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-31 توزيع 0.05 USD	2025-12-25 15:06:32.657783
4435	1310	توزيع أرباح نقدية	2009-05-26	2009-05-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-06-16 توزيع 1.0 SAR	2025-12-25 15:06:32.658499
4436	1310	توزيع أسهم خزينة كأسهم منحة	2009-05-26	2009-05-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.658846
4437	4190	توزيع أرباح نقدية	2009-04-19	2009-05-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-20 توزيع 2.5 SAR	2025-12-25 15:06:32.659148
4438	2120	توزيع أرباح نقدية	2009-02-22	2009-05-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-26 توزيع 0.5 SAR	2025-12-25 15:06:32.659437
4439	7010	توزيع أرباح نقدية	2009-04-20	2009-05-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-20 توزيع 0.75 SAR	2025-12-25 15:06:32.659702
4440	4001	توزيع أرباح نقدية	2009-02-23	2009-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-20 توزيع 1.5 SAR	2025-12-25 15:06:32.659988
4441	2220	توزيع أسهم خزينة كأسهم منحة	2009-04-26	2009-04-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 255,564,450  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.660346
4442	2220	توزيع أرباح نقدية	2009-04-26	2009-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-02 توزيع 0.5 SAR	2025-12-25 15:06:32.660826
4443	4230	توزيع أرباح نقدية	2009-04-25	2009-04-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-20 توزيع 3.5 SAR	2025-12-25 15:06:32.661188
4444	4260	توزيع أرباح نقدية	2009-04-19	2009-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-18 توزيع 1.75 SAR	2025-12-25 15:06:32.661538
4445	2160	توزيع أرباح نقدية	2009-02-15	2009-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-16 توزيع 0.5 SAR	2025-12-25 15:06:32.661901
4446	1020	توزيع أرباح نقدية	2009-01-07	2009-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-25 توزيع 0.5 SAR	2025-12-25 15:06:32.662216
4447	2050	توزيع أرباح نقدية	2009-04-11	2009-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-25 توزيع 0.25 SAR	2025-12-25 15:06:32.662577
4448	2030	توزيع أرباح نقدية	2009-02-16	2009-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-11 توزيع 0.5 SAR	2025-12-25 15:06:32.663167
4449	2050	توزيع أرباح نقدية	2009-01-18	2009-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-02 توزيع 0.25 SAR	2025-12-25 15:06:32.663518
4450	2110	توزيع أرباح نقدية	2009-03-07	2009-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-17 توزيع 0.75 SAR	2025-12-25 15:06:32.663824
4451	2070	توزيع أرباح نقدية	2009-02-16	2009-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-05 توزيع 1.5 SAR	2025-12-25 15:06:32.664194
4452	6040	توزيع أرباح نقدية	2009-02-11	2009-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-02 توزيع 0.5 SAR	2025-12-25 15:06:32.664521
4453	2010	توزيع أرباح نقدية	2009-01-20	2009-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-25 توزيع 1.25 SAR	2025-12-25 15:06:32.664926
4454	7010	توزيع أرباح نقدية	2009-01-20	2009-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-22 توزيع 0.75 SAR	2025-12-25 15:06:32.665286
4455	4090	توزيع أرباح نقدية	2009-04-07	2009-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-11 توزيع 0.2 SAR	2025-12-25 15:06:32.665646
4456	3040	توزيع أرباح نقدية	2009-03-09	2009-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-25 توزيع 5.0 SAR	2025-12-25 15:06:32.666008
4457	4020	توزيع أرباح نقدية	2009-02-22	2009-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-05-02 توزيع 1.0 SAR	2025-12-25 15:06:32.666313
4458	4080	توزيع أرباح نقدية	2008-12-29	2009-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-29 توزيع 0.5 SAR	2025-12-25 15:06:32.666651
4459	5110	توزيع أرباح نقدية	2009-02-25	2009-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-28 توزيع 0.7 SAR	2025-12-25 15:06:32.667012
4460	1050	توزيع أرباح نقدية	2009-02-01	2009-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-18 توزيع 1.0 SAR	2025-12-25 15:06:32.667351
4461	4040	توزيع أرباح نقدية	2009-02-23	2009-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-26 توزيع 0.5 SAR	2025-12-25 15:06:32.667728
4462	4290	توزيع أسهم خزينة كأسهم منحة	2009-02-17	2009-04-05	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:32.668079
4463	4290	توزيع أرباح نقدية	2009-02-17	2009-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:32.668428
4464	4290	زيادة رأس المال المصرح به	2009-02-17	2009-04-05	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  100000000 إلى  150000000	2025-12-25 15:06:32.668755
4465	2310	توزيع أرباح نقدية	2008-12-24	2009-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-18 توزيع 1.0 SAR	2025-12-25 15:06:32.669073
4466	2300	توزيع أرباح نقدية	2009-04-01	2009-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-04 توزيع 1.0 SAR	2025-12-25 15:06:32.669398
4467	4090	توزيع أرباح نقدية	2009-03-25	2009-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-29 توزيع 0.3 SAR	2025-12-25 15:06:32.669706
4468	2320	توزيع أرباح نقدية	2009-03-31	2009-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-01 توزيع 1.0 SAR	2025-12-25 15:06:32.670032
4469	2240	توزيع أرباح نقدية	2009-03-31	2009-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-01 توزيع 1.5 SAR	2025-12-25 15:06:32.670398
4470	2370	توزيع أرباح نقدية	2009-03-31	2009-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-01 توزيع 1.2 SAR	2025-12-25 15:06:32.670728
4471	2320	توزيع أسهم خزينة كأسهم منحة	2009-03-31	2009-04-01	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 405,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:32.671083
4472	4150	توزيع أرباح نقدية	2008-12-30	2009-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-06-22 توزيع 0.5 SAR	2025-12-25 15:06:32.671398
4473	4010	توزيع أرباح نقدية	2009-02-14	2009-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-13 توزيع 1.2 SAR	2025-12-25 15:06:32.671736
4474	4030	توزيع أرباح نقدية	2008-11-29	2009-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-14 توزيع 1.5 SAR	2025-12-25 15:06:32.672092
4475	6001	توزيع أرباح نقدية	2008-12-13	2009-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-08 توزيع 1.5 SAR	2025-12-25 15:06:32.672465
4476	2060	توزيع أرباح نقدية	2009-02-18	2009-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-12 توزيع 1.0 SAR	2025-12-25 15:06:32.672868
4477	4210	توزيع أرباح نقدية	2009-03-25	2009-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-15 توزيع 2.0 SAR	2025-12-25 15:06:32.673236
4478	2080	توزيع أرباح نقدية	2009-02-21	2009-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-12 توزيع 1.5 SAR	2025-12-25 15:06:32.67362
4479	1040	توزيع أسهم خزينة كأسهم منحة	2009-03-24	2009-03-25	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,307,500,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.673997
4480	4270	توزيع أرباح نقدية	2009-03-24	2009-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-14 توزيع 1.5 SAR	2025-12-25 15:06:32.67451
4481	3030	توزيع أرباح نقدية	2009-02-17	2009-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-04 توزيع 3.5 SAR	2025-12-25 15:06:32.675143
4482	6090	توزيع أرباح نقدية	2009-02-09	2009-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-16 توزيع 0.5 SAR	2025-12-25 15:06:32.675595
4483	2280	توزيع أرباح نقدية	2009-01-19	2009-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-07 توزيع 3.5 SAR	2025-12-25 15:06:32.676
4484	4140	توزيع أرباح نقدية	2008-12-17	2009-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-20 توزيع 1.0 SAR	2025-12-25 15:06:32.676433
4485	2020	توزيع أرباح نقدية	2008-11-26	2009-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-01 توزيع 7.0 SAR	2025-12-25 15:06:32.67684
4486	3010	توزيع أرباح نقدية	2009-02-16	2009-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-05 توزيع 2.0 SAR	2025-12-25 15:06:32.677205
4487	2040	توزيع أرباح نقدية	2008-12-29	2009-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-05 توزيع 2.5 SAR	2025-12-25 15:06:32.677566
4488	1080	توزيع أرباح نقدية	2008-12-22	2009-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-04 توزيع 1.0 SAR	2025-12-25 15:06:32.67791
4489	6010	توزيع أرباح نقدية	2009-02-21	2009-03-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-25 توزيع 0.75 SAR	2025-12-25 15:06:32.678274
4490	4190	توزيع أرباح نقدية	2009-02-08	2009-03-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-23 توزيع 4.5 SAR	2025-12-25 15:06:32.678748
4491	4200	توزيع أرباح نقدية	2009-01-18	2009-03-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-04-13 توزيع 1.5 SAR	2025-12-25 15:06:32.67916
4492	4210	استحواذ على شركة	2009-03-14	2009-03-14	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع University library Group	2025-12-25 15:06:32.67951
4493	1060	توزيع أسهم خزينة كأسهم منحة	2009-03-10	2009-03-11	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 7,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:32.679894
4494	8010	توزيع أرباح نقدية	2009-02-07	2009-03-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-26 توزيع 2.0 SAR	2025-12-25 15:06:32.68028
4495	3020	توزيع أرباح نقدية	2009-01-20	2009-03-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-23 توزيع 2.0 SAR	2025-12-25 15:06:32.680656
4496	3060	توزيع أرباح نقدية	2009-01-28	2009-03-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-28 توزيع 4.0 SAR	2025-12-25 15:06:32.681048
4497	3050	توزيع أرباح نقدية	2009-01-28	2009-03-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-14 توزيع 2.0 SAR	2025-12-25 15:06:32.681432
4498	1010	توزيع أرباح نقدية	2009-01-19	2009-03-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-11 توزيع 0.7 SAR	2025-12-25 15:06:32.681777
4499	1120	توزيع أرباح نقدية	2009-01-19	2009-02-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-02 توزيع 1.75 SAR	2025-12-25 15:06:32.682117
4500	1090	توزيع أرباح نقدية	2008-12-31	2009-02-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2009-03-03 توزيع 0.75 SAR	2025-12-25 15:06:32.682472
4501	2280	استحواذ على شركة	2009-01-31	2009-01-31	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Muscat City Desalination SAOG	2025-12-25 15:06:33.335198
4502	6020	استحواذ على شركة	2008-12-13	2008-12-13	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Bandaria Group	2025-12-25 15:06:33.335795
4503	2140	توزيع أسهم خزينة كأسهم منحة	2008-12-01	2008-12-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 490,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.336064
4504	2030	تغيير السنة المالية	2008-12-01	2008-12-01	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:33.336313
4505	2030	توزيع أسهم خزينة كأسهم منحة	2008-11-30	2008-12-01	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 150,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:33.336613
4506	2030	توزيع أرباح نقدية	2008-07-28	2008-12-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-12-01 توزيع 1.0 SAR	2025-12-25 15:06:33.336862
4507	4270	استحواذ على شركة	2008-11-05	2008-11-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Flexible Packaging Co Ltd	2025-12-25 15:06:33.337083
4508	3060	استحواذ على شركة	2008-11-05	2008-11-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Saudi Arabia UAE Concrete Products Ltd.	2025-12-25 15:06:33.337319
4509	7020	استحواذ على شركة	2008-11-03	2008-11-03	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Zajil International Telecom Co KSCC	2025-12-25 15:06:33.337542
4510	2050	توزيع أرباح نقدية	2008-10-25	2008-11-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-11-15 توزيع 0.25 SAR	2025-12-25 15:06:33.337789
4511	7010	توزيع أرباح نقدية	2008-10-25	2008-10-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-11-12 توزيع 1.0 SAR	2025-12-25 15:06:33.338012
4512	4210	استحواذ على شركة	2008-10-27	2008-10-27	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Nia’ma co	2025-12-25 15:06:33.338228
4513	7010	استحواذ على شركة	2008-10-27	2008-10-27	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Nia’ma co	2025-12-25 15:06:33.338479
4514	4100	توزيع أرباح نقدية	2008-07-27	2008-10-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-11-01 توزيع 1.2 SAR	2025-12-25 15:06:33.339205
4515	4240	توزيع أرباح نقدية	2008-10-21	2008-10-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-11-26 توزيع 1.75 SAR	2025-12-25 15:06:33.339689
4516	7020	زيادة رأس مال - إصدار حقوق أولوية	2008-10-19	2008-10-20	\N	\N	\N	SAR	زياده راس المال من 5,000,000,000 SAR الى 7,000,000,000 SAR من خلال اصدار 200,000,000 سهم بسعر اصدار SAR 10.0  لكل سهم	2025-12-25 15:06:33.340131
4517	4300	توزيع أسهم خزينة كأسهم منحة	2008-09-03	2008-10-14	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 7,200,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.341452
4518	4090	توزيع أرباح نقدية	2008-10-01	2008-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-10-29 توزيع 0.3 SAR	2025-12-25 15:06:33.341777
4519	4070	توزيع أرباح نقدية	2008-07-15	2008-09-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-11-01 توزيع 1.0 SAR	2025-12-25 15:06:33.342063
4520	4290	توزيع أسهم خزينة كأسهم منحة	2008-02-25	2008-09-15	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:33.342319
4521	4290	زيادة رأس المال المصرح به	2008-02-25	2008-09-15	\N	\N	\N	SAR	زيادة رأس مال المصرح به من  80000000 إلى  100000000	2025-12-25 15:06:33.342706
4522	4190	توزيع أرباح نقدية	2008-07-20	2008-09-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-09-21 توزيع 4.5 SAR	2025-12-25 15:06:33.343092
4523	2190	زيادة رأس مال - إصدار حقوق أولوية	2008-08-24	2008-08-25	\N	\N	\N	SAR	زياده راس المال من 400,000,000 SAR الى 680,000,000 SAR من خلال اصدار 28,000,000 سهم بسعر اصدار SAR 11.5  لكل سهم	2025-12-25 15:06:33.343527
4524	3040	توزيع أرباح نقدية	2008-07-20	2008-08-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-08-30 توزيع 3.0 SAR	2025-12-25 15:06:33.34394
4525	3010	توزيع أرباح نقدية	2008-07-30	2008-08-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-08-16 توزيع 1.0 SAR	2025-12-25 15:06:33.344339
4526	4180	استحواذ على شركة	2008-08-05	2008-08-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Oriental Weavers	2025-12-25 15:06:33.34475
4527	7010	توزيع أرباح نقدية	2008-07-20	2008-08-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-08-13 توزيع 1.0 SAR	2025-12-25 15:06:33.345223
4528	2210	زيادة رأس مال - إصدار حقوق أولوية	2008-07-26	2008-07-27	\N	\N	\N	SAR	زياده راس المال من 765,000,000 SAR الى 1,285,200,000 SAR من خلال اصدار 52,020,000 سهم بسعر اصدار SAR 15.0  لكل سهم	2025-12-25 15:06:33.345631
4529	1060	توزيع أرباح نقدية	2008-07-22	2008-07-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-30 توزيع 0.96 SAR	2025-12-25 15:06:33.346065
4530	2010	توزيع أرباح نقدية	2008-07-19	2008-07-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-08-04 توزيع 1.75 SAR	2025-12-25 15:06:33.346533
4531	2050	توزيع أرباح نقدية	2008-07-16	2008-07-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-08-16 توزيع 0.25 SAR	2025-12-25 15:06:33.346932
4532	2370	توزيع أرباح نقدية	2008-07-16	2008-07-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-19 توزيع 0.5 SAR	2025-12-25 15:06:33.347316
4533	2370	توزيع أسهم خزينة كأسهم منحة	2008-07-15	2008-07-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 400,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.347695
4534	3050	توزيع أرباح نقدية	2008-07-13	2008-07-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-26 توزيع 3.0 SAR	2025-12-25 15:06:33.348097
4535	3090	توزيع أرباح نقدية	2008-07-06	2008-07-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-08-03 توزيع 1.5 SAR	2025-12-25 15:06:33.348467
4536	2020	توزيع أرباح نقدية	2008-06-28	2008-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-27 توزيع 6.0 SAR	2025-12-25 15:06:33.348858
4537	2270	توزيع أرباح نقدية	2008-05-28	2008-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-30 توزيع 1.5 SAR	2025-12-25 15:06:33.34925
4538	4290	استحواذ على شركة	2008-07-08	2008-07-08	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Linguaphone Ltd	2025-12-25 15:06:33.349655
4539	2310	توزيع أرباح نقدية	2008-06-08	2008-07-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-20 توزيع 1.0 SAR	2025-12-25 15:06:33.35005
4540	1120	توزيع أرباح نقدية	2008-06-29	2008-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-12 توزيع 1.25 SAR	2025-12-25 15:06:33.350444
4541	1090	توزيع أرباح نقدية	2008-06-28	2008-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-12 توزيع 0.9 SAR	2025-12-25 15:06:33.350741
4542	1010	توزيع أرباح نقدية	2008-06-23	2008-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-15 توزيع 0.7 SAR	2025-12-25 15:06:33.351055
4543	4280	استحواذ على شركة	2008-06-18	2008-06-18	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Abraj Nas for Commercial Investments Ltd	2025-12-25 15:06:33.351358
4544	4240	توزيع أرباح نقدية	2008-05-20	2008-06-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-07-22 توزيع 1.75 SAR	2025-12-25 15:06:33.351672
4545	4180	تغيير اسم الشركة	2008-01-07	2008-06-10	\N	\N	\N	SAR	تم تعديل اسم الشركة من Fitaihi إلى Fitaihi	2025-12-25 15:06:33.351997
4546	2060	زيادة رأس مال - إصدار حقوق أولوية	2008-05-24	2008-05-27	\N	\N	\N	SAR	زياده راس المال من 3,495,735,750 SAR الى 4,606,846,870 SAR من خلال اصدار 111,111,112 سهم بسعر اصدار SAR 18.0  لكل سهم	2025-12-25 15:06:33.352447
4547	2060	توزيع أرباح نقدية	2008-02-23	2008-05-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-06-22 توزيع 1.0 SAR	2025-12-25 15:06:33.353075
4548	2250	توزيع أرباح نقدية	2008-02-06	2008-05-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-06-05 توزيع 0.5 SAR	2025-12-25 15:06:33.353426
4549	6090	توزيع أرباح نقدية	2008-02-25	2008-05-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-31 توزيع 0.5 SAR	2025-12-25 15:06:33.353784
4550	4210	استحواذ على شركة	2008-05-10	2008-05-10	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Shaher	2025-12-25 15:06:33.354075
4551	4180	توزيع أسهم خزينة كأسهم منحة	2008-05-06	2008-05-07	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.354377
4552	2080	توزيع أرباح نقدية	2008-02-23	2008-05-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-06-04 توزيع 1.5 SAR	2025-12-25 15:06:33.354667
4553	6070	توزيع أرباح نقدية	2008-02-23	2008-05-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-06-21 توزيع 0.5 SAR	2025-12-25 15:06:33.355019
4554	2240	استحواذ على شركة	2008-05-04	2008-05-04	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Hudson Products Corp	2025-12-25 15:06:33.355314
4555	2050	توزيع أرباح نقدية	2008-04-19	2008-05-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-15 توزيع 0.25 SAR	2025-12-25 15:06:33.356143
4556	4080	توزيع أرباح نقدية	2008-01-21	2008-05-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-27 توزيع 1.0 SAR	2025-12-25 15:06:33.357072
4557	7010	استحواذ على شركة	2008-04-29	2008-04-29	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Oger Telecom Ltd	2025-12-25 15:06:33.357795
4558	4010	توزيع أرباح نقدية	2008-03-31	2008-04-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-10 توزيع 1.0 SAR	2025-12-25 15:06:33.358541
4559	1060	توزيع أسهم خزينة كأسهم منحة	2008-04-27	2008-04-28	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:33.359103
4560	3090	توزيع أرباح نقدية	2007-12-31	2008-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-03 توزيع 2.5 SAR	2025-12-25 15:06:33.359799
4561	6010	توزيع أسهم خزينة كأسهم منحة	2008-04-22	2008-04-23	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 600,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:33.360604
4562	4020	توزيع أرباح نقدية	2008-02-24	2008-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-18 توزيع 1.0 SAR	2025-12-25 15:06:33.361087
4563	2240	توزيع أرباح نقدية	2008-04-20	2008-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-21 توزيع 1.5 SAR	2025-12-25 15:06:33.361725
4564	4040	توزيع أرباح نقدية	2008-03-01	2008-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-12 توزيع 0.5 SAR	2025-12-25 15:06:33.362257
4565	4260	توزيع أرباح نقدية	2008-04-19	2008-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-18 توزيع 1.5 SAR	2025-12-25 15:06:33.363009
4566	4230	توزيع أرباح نقدية	2008-04-19	2008-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-17 توزيع 2.0 SAR	2025-12-25 15:06:33.36349
4567	2340	توزيع أسهم خزينة كأسهم منحة	2008-04-19	2008-04-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 812,500,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.364276
4568	2340	توزيع أرباح نقدية	2008-04-19	2008-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-20 توزيع 1.5 SAR	2025-12-25 15:06:33.364875
4569	4300	توزيع أرباح نقدية	2008-03-22	2008-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-10 توزيع 3.0 SAR	2025-12-25 15:06:33.365473
4570	5110	توزيع أرباح نقدية	2008-02-20	2008-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-11 توزيع 0.7 SAR	2025-12-25 15:06:33.366165
4571	1020	توزيع أسهم خزينة كأسهم منحة	2008-04-16	2008-04-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.366797
4572	2300	توزيع أرباح نقدية	2008-04-12	2008-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-13 توزيع 0.75 SAR	2025-12-25 15:06:33.36733
4573	2300	توزيع أسهم خزينة كأسهم منحة	2008-04-12	2008-04-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.367901
4574	2110	توزيع أرباح نقدية	2008-03-11	2008-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-18 توزيع 0.75 SAR	2025-12-25 15:06:33.368188
4575	2150	توزيع أرباح نقدية	2008-02-24	2008-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-23 توزيع 1.0 SAR	2025-12-25 15:06:33.368643
4576	4150	توزيع أرباح نقدية	2008-02-26	2008-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-26 توزيع 0.5 SAR	2025-12-25 15:06:33.36912
4577	6040	توزيع أرباح نقدية	2008-02-20	2008-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-06-04 توزيع 0.5 SAR	2025-12-25 15:06:33.369564
4578	2240	استحواذ على شركة	2008-04-08	2008-04-08	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Rabiah and Nassar and Zamil Concrete Industries Co Ltd	2025-12-25 15:06:33.369849
4579	2020	توزيع أسهم خزينة كأسهم منحة	2008-04-07	2008-04-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.371203
4580	2220	توزيع أسهم خزينة كأسهم منحة	2008-04-07	2008-04-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 204,451,560  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.371963
4581	2220	توزيع أرباح نقدية	2008-04-07	2008-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-08 توزيع 1.0 SAR	2025-12-25 15:06:33.372613
4582	4030	توزيع أرباح نقدية	2008-02-20	2008-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-20 توزيع 1.0 SAR	2025-12-25 15:06:33.373217
4583	2020	توزيع أرباح نقدية	2007-12-30	2008-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-14 توزيع 2.0 SAR	2025-12-25 15:06:33.373907
4584	2070	توزيع أرباح نقدية	2008-01-19	2008-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-05-05 توزيع 1.5 SAR	2025-12-25 15:06:33.374272
4585	4090	توزيع أرباح نقدية	2008-02-18	2008-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-30 توزيع 0.7 SAR	2025-12-25 15:06:33.374753
4586	3080	توزيع أرباح نقدية	2008-02-24	2008-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-08 توزيع 4.0 SAR	2025-12-25 15:06:33.375286
4587	7020	توزيع أرباح نقدية	2008-02-20	2008-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-26 توزيع 0.5 SAR	2025-12-25 15:06:33.375883
4588	1050	توزيع أرباح نقدية	2007-12-02	2008-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-09 توزيع 0.5 SAR	2025-12-25 15:06:33.376444
4589	2340	استحواذ على شركة	2008-03-30	2008-03-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Red Sea Cables Co	2025-12-25 15:06:33.376754
4590	2010	توزيع أسهم خزينة كأسهم منحة	2008-03-29	2008-03-30	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 30,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.377012
4591	2010	توزيع أرباح نقدية	2007-12-30	2008-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-12 توزيع 2.0 SAR	2025-12-25 15:06:33.377354
4592	1060	توزيع أرباح نقدية	2007-12-10	2008-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-05 توزيع 2.22 SAR	2025-12-25 15:06:33.377552
4593	3050	توزيع أرباح نقدية	2008-02-23	2008-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-05 توزيع 2.5 SAR	2025-12-25 15:06:33.378076
4594	2050	توزيع أسهم خزينة كأسهم منحة	2008-03-25	2008-03-26	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 5,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:33.378648
4595	2050	توزيع أرباح نقدية	2008-01-19	2008-03-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-15 توزيع 0.25 SAR	2025-12-25 15:06:33.379017
4596	2280	توزيع أرباح نقدية	2008-01-21	2008-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-07 توزيع 2.5 SAR	2025-12-25 15:06:33.379541
4597	3030	توزيع أرباح نقدية	2008-02-18	2008-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-05 توزيع 5.0 SAR	2025-12-25 15:06:33.380159
4598	2360	توزيع أرباح نقدية	2008-03-22	2008-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-03-23 توزيع 2.0 SAR	2025-12-25 15:06:33.380573
4599	3020	توزيع أرباح نقدية	2008-03-22	2008-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-05 توزيع 3.0 SAR	2025-12-25 15:06:33.381212
4600	3060	توزيع أرباح نقدية	2008-02-04	2008-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-05 توزيع 5.0 SAR	2025-12-25 15:06:33.381588
4601	7020	استحواذ على شركة	2008-03-18	2008-03-18	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Bayanat Al Oula for Network Services	2025-12-25 15:06:34.052585
4602	4200	توزيع أسهم خزينة كأسهم منحة	2008-03-17	2008-03-18	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.053325
4603	4200	توزيع أرباح نقدية	2008-01-21	2008-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-07 توزيع 1.5 SAR	2025-12-25 15:06:34.053684
4604	2040	توزيع أرباح نقدية	2007-12-31	2008-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-02 توزيع 2.5 SAR	2025-12-25 15:06:34.054034
4605	1080	توزيع أسهم خزينة كأسهم منحة	2008-03-16	2008-03-17	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.054352
4606	3040	توزيع أرباح نقدية	2008-02-02	2008-03-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-03-29 توزيع 4.0 SAR	2025-12-25 15:06:34.054675
4607	8010	توزيع أرباح نقدية	2008-02-24	2008-03-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-09 توزيع 10.0 SAR	2025-12-25 15:06:34.054969
4608	4190	توزيع أرباح نقدية	2008-02-05	2008-03-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-03-17 توزيع 4.0 SAR	2025-12-25 15:06:34.055262
4609	1030	توزيع أسهم خزينة كأسهم منحة	2008-03-09	2008-03-10	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 4,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.055555
4610	1090	توزيع أسهم خزينة كأسهم منحة	2008-03-05	2008-03-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 9,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.055845
4611	1090	توزيع أرباح نقدية	2008-02-05	2008-03-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-03-19 توزيع 1.0 SAR	2025-12-25 15:06:34.05634
4612	6090	استحواذ على شركة	2008-03-01	2008-03-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Oqaan Company for Marine Products	2025-12-25 15:06:34.056612
4613	3010	توزيع أرباح نقدية	2008-01-26	2008-03-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-03-12 توزيع 3.0 SAR	2025-12-25 15:06:34.056894
4614	4010	زيادة رأس مال - اكتتاب خاص	2008-01-08	2008-02-26	\N	\N	\N	SAR	زيادة رأس المال من   500,000,000  الى 690,060,970  عن طريق الاكتتاب الخاص في 19,006,097 سهم لأحد الشركاء 	2025-12-25 15:06:34.057171
4615	1120	توزيع أسهم خزينة كأسهم منحة	2008-02-24	2008-02-25	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 15,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.057468
4616	1120	توزيع أرباح نقدية	2008-01-21	2008-02-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-03-02 توزيع 0.05 SAR	2025-12-25 15:06:34.057764
4617	4061	تخفيض رأس مال - بتخفيض عدد الأسهم	2008-02-19	2008-02-20	\N	\N	\N	SAR	تخفيض رأس المال من   1,200,000,000  الى 109,000,000  وعدد الاسهم الى 10,900,000 بقيمة اسمية للسهم 10 	2025-12-25 15:06:34.058158
4618	2180	توزيع أرباح نقدية	2008-01-15	2008-02-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2008-04-01 توزيع 0.5 SAR	2025-12-25 15:06:34.058444
4619	2250	زيادة رأس مال - إصدار حقوق أولوية	2008-02-05	2008-02-06	\N	\N	\N	SAR	زياده راس المال من 2,250,000,000 SAR الى 4,500,000,000 SAR من خلال اصدار 225,000,000 سهم بسعر اصدار SAR 10.0  لكل سهم	2025-12-25 15:06:34.058872
4620	2240	استحواذ على شركة	2008-02-05	2008-02-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Zamil Air Conditioner India Private Ltd	2025-12-25 15:06:34.059292
4621	2310	زيادة رأس مال - إصدار حقوق أولوية	2008-01-29	2008-01-30	\N	\N	\N	SAR	زياده راس المال من 2,000,000,000 SAR الى 3,333,333,330 SAR من خلال اصدار 133,333,333 سهم بسعر اصدار SAR 15.0  لكل سهم	2025-12-25 15:06:34.059624
4622	4191	استحواذ على شركة	2007-12-31	2008-01-29	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Mohammed Rashid Al Duwaish and Partners for Trading	2025-12-25 15:06:34.059971
4623	2230	استحواذ على شركة	2008-01-17	2008-01-17	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع ExploTrack	2025-12-25 15:06:34.060245
4624	7204	زيادة رأس مال - إصدار حقوق أولوية	2008-01-05	2008-01-06	\N	\N	\N	SAR	زياده راس المال من 1,375,000 JOD الى 4,125,000 JOD من خلال اصدار 2,750,000 سهم بسعر اصدار JOD 1.0  لكل سهم	2025-12-25 15:06:34.060506
4625	4191	الإندماج مع شركة	2007-12-31	2007-12-31	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من Mohamed Rashid Al Duweesh Est	2025-12-25 15:06:34.06076
4626	3010	توزيع أسهم خزينة كأسهم منحة	2007-12-04	2007-12-05	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 700,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.061022
4627	3010	زيادة رأس مال - إصدار حقوق أولوية	2007-12-04	2007-12-05	\N	\N	\N	SAR	زياده راس المال من 700,000,000 SAR الى 800,000,000 SAR من خلال اصدار 10,000,000 سهم بسعر اصدار SAR 10.0  لكل سهم	2025-12-25 15:06:34.061285
4628	4100	توزيع أرباح نقدية	2007-10-20	2007-11-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-11-28 توزيع 1.2 SAR	2025-12-25 15:06:34.061545
4629	4190	توزيع أرباح نقدية	2007-10-21	2007-11-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-11-28 توزيع 4.0 SAR	2025-12-25 15:06:34.061807
4630	2130	استحواذ على شركة	2007-11-14	2007-11-14	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Etap International	2025-12-25 15:06:34.062078
4631	2050	توزيع أرباح نقدية	2007-10-30	2007-11-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-12-15 توزيع 0.25 SAR	2025-12-25 15:06:34.062348
4632	7010	توزيع أرباح نقدية	2007-10-23	2007-11-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-11-12 توزيع 1.25 SAR	2025-12-25 15:06:34.062658
4633	4240	توزيع أرباح نقدية	2007-10-29	2007-10-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-11-19 توزيع 1.0 SAR	2025-12-25 15:06:34.06304
4634	2080	استحواذ على شركة	2007-10-01	2007-10-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Saudi Preinsulated Pipes Industries LLC	2025-12-25 15:06:34.063439
4635	4090	توزيع أرباح نقدية	2007-09-24	2007-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-10-31 توزيع 0.6 SAR	2025-12-25 15:06:34.063857
4636	4070	توزيع أرباح نقدية	2007-05-12	2007-09-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-11-20 توزيع 0.75 SAR	2025-12-25 15:06:34.064252
4637	6030	توزيع أرباح نقدية	2007-09-14	2007-09-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-09-15 توزيع 0.5 SAR	2025-12-25 15:06:34.064654
4638	7010	استحواذ على شركة	2007-09-12	2007-09-12	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Maxis Berhad - Maxis	2025-12-25 15:06:34.065079
4639	6090	استحواذ على شركة	2007-08-14	2007-08-14	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Interfish	2025-12-25 15:06:34.065467
4640	6060	تغيير اسم الشركة	2007-07-31	2007-07-31	\N	\N	\N	SAR	تم تعديل اسم الشركة من Sharqiya Agricultural Dev إلى Sharqiya Dev	2025-12-25 15:06:34.065919
4641	1040	توزيع أرباح نقدية	2007-07-18	2007-07-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-08-08 توزيع 0.71 SAR	2025-12-25 15:06:34.066395
4642	7010	توزيع أرباح نقدية	2007-07-17	2007-07-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-08-11 توزيع 1.25 SAR	2025-12-25 15:06:34.066794
4643	2010	توزيع أرباح نقدية	2007-07-17	2007-07-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-08-06 توزيع 1.0 SAR	2025-12-25 15:06:34.06744
4644	4080	استحواذ على شركة	2007-07-23	2007-07-23	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Khozama Management Co	2025-12-25 15:06:34.067842
4645	2050	توزيع أرباح نقدية	2007-07-15	2007-07-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-08-01 توزيع 0.25 SAR	2025-12-25 15:06:34.068233
4646	1030	استحواذ على شركة	2007-07-18	2007-07-18	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Baraka Group B.S.C.	2025-12-25 15:06:34.068622
4647	2260	توزيع أسهم خزينة كأسهم منحة	2007-02-28	2007-07-18	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,875,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.069013
4648	3010	توزيع أرباح نقدية	2007-07-11	2007-07-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-31 توزيع 1.0 SAR	2025-12-25 15:06:34.069421
4649	2020	توزيع أرباح نقدية	2007-07-10	2007-07-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-29 توزيع 3.0 SAR	2025-12-25 15:06:34.069816
4650	1120	توزيع أرباح نقدية	2007-07-10	2007-07-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-22 توزيع 1.5 SAR	2025-12-25 15:06:34.070255
4651	3050	توزيع أرباح نقدية	2007-07-10	2007-07-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-21 توزيع 2.0 SAR	2025-12-25 15:06:34.070641
4652	1060	توزيع أرباح نقدية	2007-07-10	2007-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-18 توزيع 1.53 SAR	2025-12-25 15:06:34.071055
4653	1050	توزيع أرباح نقدية	2007-07-08	2007-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-21 توزيع 1.25 SAR	2025-12-25 15:06:34.071444
4654	3040	توزيع أرباح نقدية	2007-06-17	2007-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-25 توزيع 2.3 SAR	2025-12-25 15:06:34.071844
4655	1090	توزيع أرباح نقدية	2007-06-26	2007-07-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-22 توزيع 1.7 SAR	2025-12-25 15:06:34.072226
4656	2050	توزيع أرباح نقدية	2007-06-26	2007-07-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:34.072612
4657	2270	توزيع أرباح نقدية	2007-06-30	2007-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-01 توزيع 1.0 SAR	2025-12-25 15:06:34.072997
5212	2090	توزيع أرباح نقدية	2000-02-29	2000-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.281001
4658	4300	توزيع أرباح نقدية	2007-06-30	2007-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-02 توزيع 3.0 SAR	2025-12-25 15:06:34.073409
4659	4090	توزيع أرباح نقدية	2007-06-30	2007-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-28 توزيع 0.3 SAR	2025-12-25 15:06:34.074629
4660	1010	توزيع أرباح نقدية	2007-06-18	2007-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-15 توزيع 1.6 SAR	2025-12-25 15:06:34.075057
4661	4240	توزيع أسهم خزينة كأسهم منحة	2007-06-23	2007-06-24	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 700,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.075459
4662	6040	استحواذ على شركة	2007-06-05	2007-06-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Rakha for Agricultural Investment and Development SAE	2025-12-25 15:06:34.075866
4663	2100	استحواذ على شركة	2007-06-05	2007-06-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Rakha for Agricultural Investment and Development SAE	2025-12-25 15:06:34.076253
4664	6090	استحواذ على شركة	2007-06-05	2007-06-05	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Rakha for Agricultural Investment and Development SAE	2025-12-25 15:06:34.076669
4665	2210	توزيع أسهم خزينة كأسهم منحة	2007-06-02	2007-06-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 765,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.077066
4666	4150	توزيع أرباح نقدية	2007-02-21	2007-05-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-07-21 توزيع 0.5 SAR	2025-12-25 15:06:34.077469
4667	2360	إدراج الشركة	2007-05-23	2007-05-23	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم 2007-05-23	2025-12-25 15:06:34.077866
4668	7204	توزيع أرباح نقدية	2007-05-21	2007-05-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-22 توزيع 0.2 USD	2025-12-25 15:06:34.078277
4669	2310	توزيع أسهم خزينة كأسهم منحة	2007-05-12	2007-05-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.078679
4670	4090	توزيع أسهم خزينة كأسهم منحة	2007-05-02	2007-05-05	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.079082
4671	1020	توزيع أسهم خزينة كأسهم منحة	2007-04-30	2007-05-01	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.079492
4672	1020	توزيع أرباح نقدية	2006-10-29	2007-05-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-05 توزيع 2.0 SAR	2025-12-25 15:06:34.079875
4673	7010	توزيع أرباح نقدية	2007-04-18	2007-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-09 توزيع 1.25 SAR	2025-12-25 15:06:34.080289
4674	2070	توزيع أرباح نقدية	2007-02-25	2007-04-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-19 توزيع 1.0 SAR	2025-12-25 15:06:34.080672
4675	4040	توزيع أسهم خزينة كأسهم منحة	2007-04-24	2007-04-25	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.081308
4676	4040	توزيع أرباح نقدية	2007-02-26	2007-04-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-20 توزيع 0.7 SAR	2025-12-25 15:06:34.081723
4677	4010	توزيع أرباح نقدية	2007-02-27	2007-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-06 توزيع 0.55 SAR	2025-12-25 15:06:34.082107
4678	5110	توزيع أرباح نقدية	2007-02-25	2007-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-14 توزيع 0.7 SAR	2025-12-25 15:06:34.082515
4679	4140	توزيع أسهم خزينة كأسهم منحة	2007-04-18	2007-04-21	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 108,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.082925
4680	2050	توزيع أرباح نقدية	2007-04-17	2007-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-05 توزيع 0.25 SAR	2025-12-25 15:06:34.08336
4681	4140	توزيع أرباح نقدية	2007-02-11	2007-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-09 توزيع 1.0 SAR	2025-12-25 15:06:34.083744
4682	2050	توزيع أرباح نقدية	2007-01-21	2007-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-05 توزيع 0.25 SAR	2025-12-25 15:06:34.084144
4683	6040	توزيع أرباح نقدية	2007-02-20	2007-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-05 توزيع 1.0 SAR	2025-12-25 15:06:34.084551
4684	7010	استحواذ على شركة	2007-04-16	2007-04-16	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Sapphire Co Ltd	2025-12-25 15:06:34.084947
4685	4020	توزيع أرباح نقدية	2007-02-26	2007-04-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-09 توزيع 0.75 SAR	2025-12-25 15:06:34.085343
4686	4030	توزيع أرباح نقدية	2007-02-27	2007-04-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-01 توزيع 1.0 SAR	2025-12-25 15:06:34.08576
4687	2080	توزيع أرباح نقدية	2007-02-24	2007-04-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-02 توزيع 1.0 SAR	2025-12-25 15:06:34.086168
4688	2060	توزيع أسهم خزينة كأسهم منحة	2007-04-12	2007-04-14	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,495,735,750  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.086563
4689	2060	توزيع أرباح نقدية	2007-01-20	2007-04-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-29 توزيع 1.0 SAR	2025-12-25 15:06:34.086945
4690	6010	توزيع أرباح نقدية	2007-02-20	2007-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-18 توزيع 1.5 SAR	2025-12-25 15:06:34.087336
4691	2230	توزيع أرباح نقدية	2007-04-04	2007-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-05 توزيع 1.0 SAR	2025-12-25 15:06:34.087744
5213	3050	توزيع أرباح نقدية	2000-02-28	2000-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.281299
4692	4090	توزيع أرباح نقدية	2007-02-20	2007-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-02 توزيع 0.7 SAR	2025-12-25 15:06:34.08813
4693	7010	توزيع أرباح نقدية	2007-01-24	2007-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-11 توزيع 1.5 SAR	2025-12-25 15:06:34.088628
4694	2040	توزيع أرباح نقدية	2006-12-26	2007-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-15 توزيع 2.5 SAR	2025-12-25 15:06:34.089001
4695	4090	توزيع أرباح نقدية	2007-03-27	2007-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-05 توزيع 0.3 SAR	2025-12-25 15:06:34.08941
4696	2030	توزيع أسهم خزينة كأسهم منحة	2007-03-03	2007-04-01	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 60,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.08979
4697	2010	توزيع أرباح نقدية	2006-12-18	2007-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-14 توزيع 2.5 SAR	2025-12-25 15:06:34.090218
4698	3020	توزيع أرباح نقدية	2007-02-27	2007-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-14 توزيع 2.0 SAR	2025-12-25 15:06:34.090545
4699	1090	استحواذ على شركة	2007-03-30	2007-03-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Wasl Accounting and Book Keeping	2025-12-25 15:06:34.090874
4700	4210	توزيع أرباح نقدية	2007-03-27	2007-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-15 توزيع 2.0 SAR	2025-12-25 15:06:34.091197
4701	2280	زيادة رأس مال - اكتتاب خاص	2007-03-27	2007-03-28	\N	\N	\N	SAR	زيادة رأس المال من   1,000,000,000  الى 1,090,000,000 عن طريق تحويل سندات إلى 9,000,000 سهم	2025-12-25 15:06:34.747272
4702	3090	توزيع أسهم خزينة كأسهم منحة	2007-03-27	2007-03-28	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 900,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.74821
4703	2280	توزيع أرباح نقدية	2007-01-21	2007-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-10 توزيع 2.0 SAR	2025-12-25 15:06:34.748581
4704	1060	توزيع أرباح نقدية	2006-12-19	2007-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-02 توزيع 2.25 SAR	2025-12-25 15:06:34.748915
4705	2020	توزيع أرباح نقدية	2006-12-12	2007-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-07 توزيع 3.0 SAR	2025-12-25 15:06:34.749228
4706	1050	توزيع أسهم خزينة كأسهم منحة	2007-03-24	2007-03-25	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 5,625,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.749608
4707	1050	توزيع أرباح نقدية	2006-12-17	2007-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-01 توزيع 0.5 SAR	2025-12-25 15:06:34.751271
4708	2240	توزيع أرباح نقدية	2007-03-21	2007-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-24 توزيع 1.5 SAR	2025-12-25 15:06:34.751538
4709	3050	توزيع أرباح نقدية	2007-02-25	2007-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-31 توزيع 2.0 SAR	2025-12-25 15:06:34.751808
4710	1040	توزيع أسهم خزينة كأسهم منحة	2007-03-20	2007-03-21	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,646,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.752063
4711	3030	توزيع أرباح نقدية	2007-02-20	2007-03-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-31 توزيع 3.6 SAR	2025-12-25 15:06:34.752353
4712	4190	توزيع أرباح نقدية	2010-02-10	2007-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-28 توزيع 6.0 SAR	2025-12-25 15:06:34.752629
4713	1080	توزيع أسهم خزينة كأسهم منحة	2007-03-18	2007-03-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 4,550,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.752911
4714	3080	توزيع أرباح نقدية	2007-02-05	2007-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-25 توزيع 5.0 SAR	2025-12-25 15:06:34.753584
4715	3040	توزيع أرباح نقدية	2007-01-24	2007-03-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-31 توزيع 4.6 SAR	2025-12-25 15:06:34.753966
4716	1090	توزيع أرباح نقدية	2006-12-16	2007-03-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-20 توزيع 1.7 SAR	2025-12-25 15:06:34.754346
4717	1120	توزيع أسهم خزينة كأسهم منحة	2007-02-28	2007-03-04	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 13,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.754675
4718	1120	توزيع أرباح نقدية	2007-01-21	2007-03-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-10 توزيع 1.0 SAR	2025-12-25 15:06:34.754948
4719	1030	توزيع أسهم خزينة كأسهم منحة	2007-03-01	2007-03-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,910,160,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.755216
4720	1010	توزيع أرباح نقدية	2006-12-11	2007-02-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-05 توزيع 1.6 SAR	2025-12-25 15:06:34.755493
4721	2180	توزيع أرباح نقدية	2006-11-15	2007-02-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-04-04 توزيع 1.2 SAR	2025-12-25 15:06:34.756005
4722	3060	توزيع أرباح نقدية	2007-01-23	2007-02-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-10 توزيع 4.0 SAR	2025-12-25 15:06:34.756415
4723	3010	توزيع أرباح نقدية	2007-01-22	2007-02-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-03-12 توزيع 2.8 SAR	2025-12-25 15:06:34.756847
4724	4100	استحواذ على شركة	2007-02-17	2007-02-17	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Jabal Omar Founders	2025-12-25 15:06:34.757186
4725	2120	زيادة رأس مال - إصدار حقوق أولوية	2007-01-17	2007-01-20	\N	\N	\N	SAR	زياده راس المال من 108,000,000 SAR الى 432,000,000 SAR من خلال اصدار 32,400,000 سهم بسعر اصدار SAR 20.0  لكل سهم	2025-12-25 15:06:34.757512
4726	2150	توزيع أسهم خزينة كأسهم منحة	2007-01-14	2007-01-15	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.757903
4727	2250	توزيع أرباح نقدية	2006-12-12	2007-01-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2007-05-16 توزيع 1.0 SAR	2025-12-25 15:06:34.758408
4728	4030	استحواذ على شركة	2006-12-31	2006-12-31	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Al Asriah Holding for International Real Estate Co	2025-12-25 15:06:34.758705
4729	2010	استحواذ على شركة	2006-12-29	2006-12-29	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Huntsman Petrochemical Co., Ltd.	2025-12-25 15:06:34.759003
4730	4061	تغيير اسم الشركة	2006-09-11	2006-12-17	\N	\N	\N	SAR	تم تعديل اسم الشركة من Al Mawashi Al Mukairish إلى Anaam Holding	2025-12-25 15:06:34.759353
4731	4030	زيادة رأس مال - إصدار حقوق أولوية	2006-11-25	2006-11-26	\N	\N	\N	SAR	زياده راس المال من 2,250,000,000 SAR الى 3,150,000,000 SAR من خلال اصدار 90,000,000 سهم بسعر اصدار SAR 16.0  لكل سهم	2025-12-25 15:06:34.759665
4732	2050	توزيع أرباح نقدية	2006-11-13	2006-11-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-12-06 توزيع 0.25 SAR	2025-12-25 15:06:34.760083
4733	6030	توزيع أرباح نقدية	2006-11-13	2006-11-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-11-14 توزيع 2.5 SAR	2025-12-25 15:06:34.760383
4734	7010	توزيع أرباح نقدية	2006-10-31	2006-11-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-11-20 توزيع 1.5 SAR	2025-12-25 15:06:34.760683
4735	2050	توزيع أسهم خزينة كأسهم منحة	2006-09-10	2006-10-14	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,750,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.760984
4736	2050	توزيع أرباح نقدية	2006-07-23	2006-10-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-11-11 توزيع 0.25 SAR	2025-12-25 15:06:34.761276
4737	4230	تغيير السنة المالية	2006-09-25	2006-09-25	\N	\N	\N	SAR	وافقت الشركة على تعديل بداية السنة المالية من undefined الى undefined	2025-12-25 15:06:34.761566
4738	4020	توزيع أسهم خزينة كأسهم منحة	2006-09-17	2006-09-18	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,200,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.761912
4739	2240	استحواذ على شركة	2006-09-10	2006-09-10	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Kinan International Real Estate Development Co.	2025-12-25 15:06:34.763143
4740	2010	توزيع أرباح نقدية	2006-07-17	2006-08-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-08-21 توزيع 1.5 SAR	2025-12-25 15:06:34.763599
4741	7010	توزيع أرباح نقدية	2006-07-18	2006-07-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-08-12 توزيع 1.5 SAR	2025-12-25 15:06:34.764038
4742	1040	توزيع أرباح نقدية	2006-07-19	2006-07-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-08-09 توزيع 0.85 SAR	2025-12-25 15:06:34.764466
4743	4090	توزيع أرباح نقدية	2006-06-29	2006-07-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-08-15 توزيع 0.5 SAR	2025-12-25 15:06:34.76491
4744	1060	توزيع أرباح نقدية	2006-07-03	2006-07-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-23 توزيع 1.5 SAR	2025-12-25 15:06:34.765344
4745	3060	توزيع أرباح نقدية	2006-07-12	2006-07-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-08-12 توزيع 0.5 SAR	2025-12-25 15:06:34.765774
4746	1090	توزيع أرباح نقدية	2006-07-05	2006-07-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-29 توزيع 1.7 SAR	2025-12-25 15:06:34.766193
4747	1050	توزيع أرباح نقدية	2006-07-05	2006-07-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-26 توزيع 1.5 SAR	2025-12-25 15:06:34.766651
4748	4300	توزيع أرباح نقدية	2006-07-05	2006-07-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-08 توزيع 15.0 SAR	2025-12-25 15:06:34.767088
4749	2060	زيادة رأس مال - اكتتاب خاص	2006-07-03	2006-07-04	\N	\N	\N	SAR	زيادة رأس المال من   1,570,000,000  الى 2,330,490,500 عن طريق تحويل سندات إلى 76,049,050 سهم	2025-12-25 15:06:34.767647
4750	1080	توزيع أرباح نقدية	2006-06-26	2006-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-08 توزيع 1.0 SAR	2025-12-25 15:06:34.768064
4751	3050	توزيع أرباح نقدية	2006-06-24	2006-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-25 توزيع 2.0 SAR	2025-12-25 15:06:34.768489
4752	2020	توزيع أرباح نقدية	2006-06-20	2006-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-22 توزيع 2.5 SAR	2025-12-25 15:06:34.768908
4753	3010	توزيع أرباح نقدية	2006-06-15	2006-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-06-22 توزيع 1.2 SAR	2025-12-25 15:06:34.769319
4754	1010	توزيع أرباح نقدية	2006-06-12	2006-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-07-10 توزيع 1.6 SAR	2025-12-25 15:06:34.769739
4755	1020	توزيع أسهم خزينة كأسهم منحة	2006-06-20	2006-06-21	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,125,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.770186
4756	1020	توزيع أرباح نقدية	2005-12-12	2006-06-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-06-27 توزيع 3.0 SAR	2025-12-25 15:06:34.770603
4757	2210	زيادة رأس مال - اكتتاب خاص	2006-06-13	2006-06-15	\N	\N	\N	SAR	زيادة رأس المال من   650,000,000  الى 680,000,000 عن طريق تحويل سندات إلى 3,000,000 سهم	2025-12-25 15:06:34.771016
4758	2220	زيادة رأس مال - اكتتاب خاص	2006-06-07	2006-06-10	\N	\N	\N	SAR	زيادة رأس المال من   125,000,000  الى 163,561,250 عن طريق تحويل سندات إلى 3,856,125 سهم	2025-12-25 15:06:34.77143
4759	2140	توزيع أسهم خزينة كأسهم منحة	2006-06-07	2006-06-08	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 428,750,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.772182
4760	2050	توزيع أرباح نقدية	2006-05-23	2006-06-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-06-20 توزيع 0.25 SAR	2025-12-25 15:06:34.772619
4761	2250	توزيع أسهم خزينة كأسهم منحة	2006-05-23	2006-05-24	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.773023
4762	2240	توزيع أسهم خزينة كأسهم منحة	2006-05-10	2006-05-11	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 450,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.774211
4763	2230	توزيع أسهم خزينة كأسهم منحة	2006-05-01	2006-05-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 632,400,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.774653
4764	4010	توزيع أرباح نقدية	2006-03-04	2006-05-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-06 توزيع 0.8 SAR	2025-12-25 15:06:34.775097
4765	2260	استحواذ على شركة	2006-04-30	2006-04-30	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Tasnee and Sahara Olefins Co	2025-12-25 15:06:34.775566
4766	7010	توزيع أرباح نقدية	2006-04-16	2006-04-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-08 توزيع 1.25 SAR	2025-12-25 15:06:34.776017
4767	4110	توزيع أرباح نقدية	2006-02-28	2006-04-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-06-11 توزيع 4.0 SAR	2025-12-25 15:06:34.776448
4768	2010	توزيع أسهم خزينة كأسهم منحة	2006-04-22	2006-04-23	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 25,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:34.776875
4769	5110	توزيع أرباح نقدية	2006-03-05	2006-04-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-15 توزيع 0.7 SAR	2025-12-25 15:06:34.778378
4770	2010	توزيع أرباح نقدية	2005-12-19	2006-04-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-06 توزيع 3.0 SAR	2025-12-25 15:06:34.779554
4771	2290	تجزئة أسهم	2006-04-19	2006-04-22	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  112.5 مليون سهم إلى 562.5 مليون سهم	2025-12-25 15:06:34.780154
4772	2070	توزيع أرباح نقدية	2006-03-15	2006-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-15 توزيع 1.0 SAR	2025-12-25 15:06:34.780451
4773	4040	توزيع أرباح نقدية	2006-03-11	2006-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-16 توزيع 3.6 SAR	2025-12-25 15:06:34.780722
4774	2050	توزيع أسهم خزينة كأسهم منحة	2006-04-15	2006-04-16	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:34.781005
4775	2050	تجزئة أسهم	2006-04-15	2006-04-16	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  36.0 مليون سهم إلى 180.0 مليون سهم	2025-12-25 15:06:34.781273
4776	2080	توزيع أرباح نقدية	2006-02-28	2006-04-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-03 توزيع 1.9 SAR	2025-12-25 15:06:34.781546
4777	2050	توزيع أرباح نقدية	2006-01-30	2006-04-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-03 توزيع 3.0 SAR	2025-12-25 15:06:34.781833
4778	5110	تجزئة أسهم	2006-04-13	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  833.32 مليون سهم إلى 4166.59 مليون سهم	2025-12-25 15:06:34.782094
4779	2070	تجزئة أسهم	2006-04-13	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  12.0 مليون سهم إلى 60.0 مليون سهم	2025-12-25 15:06:34.782338
4780	2020	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  40.0 مليون سهم إلى 200.0 مليون سهم	2025-12-25 15:06:34.782605
4781	2030	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  0.8 مليون سهم إلى 4.0 مليون سهم	2025-12-25 15:06:34.782851
4782	2040	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  5.0 مليون سهم إلى 25.0 مليون سهم	2025-12-25 15:06:34.783151
4783	2060	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  31.4 مليون سهم إلى 157.0 مليون سهم	2025-12-25 15:06:34.783409
4784	2100	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.0 مليون سهم إلى 20.0 مليون سهم	2025-12-25 15:06:34.783672
4785	2120	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.16 مليون سهم إلى 10.8 مليون سهم	2025-12-25 15:06:34.783938
4786	2130	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  8.0 مليون سهم إلى 40.0 مليون سهم	2025-12-25 15:06:34.784235
4787	2140	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.86 مليون سهم إلى 34.3 مليون سهم	2025-12-25 15:06:34.784532
4788	2150	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.0 مليون سهم إلى 20.0 مليون سهم	2025-12-25 15:06:34.784808
4789	2160	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  23.1 مليون سهم إلى 115.5 مليون سهم	2025-12-25 15:06:34.785098
4790	2180	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  1.38 مليون سهم إلى 6.88 مليون سهم	2025-12-25 15:06:34.785398
4791	2190	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  8.0 مليون سهم إلى 40.0 مليون سهم	2025-12-25 15:06:34.785672
4792	2200	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.3 مليون سهم إلى 31.5 مليون سهم	2025-12-25 15:06:34.786467
4793	2210	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  13.0 مليون سهم إلى 65.0 مليون سهم	2025-12-25 15:06:34.786726
4794	2220	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.5 مليون سهم إلى 12.5 مليون سهم	2025-12-25 15:06:34.786969
4795	2230	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.54 مليون سهم إلى 52.7 مليون سهم	2025-12-25 15:06:34.787228
4796	2240	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  7.0 مليون سهم إلى 35.0 مليون سهم	2025-12-25 15:06:34.787474
4797	2250	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  36.0 مليون سهم إلى 180.0 مليون سهم	2025-12-25 15:06:34.787745
4798	2260	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  30.0 مليون سهم إلى 150.0 مليون سهم	2025-12-25 15:06:34.788022
4799	2270	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.5 مليون سهم إلى 32.5 مليون سهم	2025-12-25 15:06:34.789174
4800	2280	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  20.0 مليون سهم إلى 100.0 مليون سهم	2025-12-25 15:06:34.789425
4801	3010	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  12.0 مليون سهم إلى 60.0 مليون سهم	2025-12-25 15:06:35.482648
4802	3020	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  27.0 مليون سهم إلى 135.0 مليون سهم	2025-12-25 15:06:35.4834
4803	3030	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  20.4 مليون سهم إلى 102.0 مليون سهم	2025-12-25 15:06:35.483802
4804	2110	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  15.2 مليون سهم إلى 76.0 مليون سهم	2025-12-25 15:06:35.484246
4805	3040	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  9.0 مليون سهم إلى 45.0 مليون سهم	2025-12-25 15:06:35.484662
4806	3050	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  28.0 مليون سهم إلى 140.0 مليون سهم	2025-12-25 15:06:35.485037
4807	3060	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  21.0 مليون سهم إلى 105.0 مليون سهم	2025-12-25 15:06:35.485416
4808	3080	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  17.2 مليون سهم إلى 86.0 مليون سهم	2025-12-25 15:06:35.485822
4809	3090	تجزئة أسهم	2006-04-12	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  14.0 مليون سهم إلى 70.0 مليون سهم	2025-12-25 15:06:35.486243
4810	2080	تجزئة أسهم	2006-03-05	2006-04-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  15.0 مليون سهم إلى 75.0 مليون سهم	2025-12-25 15:06:35.486661
4811	4030	توزيع أسهم خزينة كأسهم منحة	2006-04-10	2006-04-12	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.487039
4812	7010	توزيع أسهم خزينة كأسهم منحة	2006-04-10	2006-04-12	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 20,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.487439
4813	3090	توزيع أرباح نقدية	2006-03-05	2006-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-30 توزيع 10.0 SAR	2025-12-25 15:06:35.487809
4814	7010	توزيع أرباح نقدية	2006-01-29	2006-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-24 توزيع 2.0 SAR	2025-12-25 15:06:35.48811
4815	4090	توزيع أرباح نقدية	2006-03-04	2006-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-29 توزيع 6.0 SAR	2025-12-25 15:06:35.488342
4816	6010	توزيع أرباح نقدية	2006-02-19	2006-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-06 توزيع 6.0 SAR	2025-12-25 15:06:35.488571
4817	7010	تجزئة أسهم	2006-04-06	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  300.0 مليون سهم إلى 1500.0 مليون سهم	2025-12-25 15:06:35.48879
4818	1060	تجزئة أسهم	2006-04-06	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  75.0 مليون سهم إلى 375.0 مليون سهم	2025-12-25 15:06:35.488995
4913	7010	توزيع أرباح نقدية	2005-07-14	2005-07-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-08-06 توزيع 14.0 SAR	2025-12-25 15:06:36.213407
4819	1120	تجزئة أسهم	2006-04-06	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  135.0 مليون سهم إلى 675.0 مليون سهم	2025-12-25 15:06:35.489211
4820	1140	تجزئة أسهم	2006-04-06	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  60.0 مليون سهم إلى 300.0 مليون سهم	2025-12-25 15:06:35.489478
4821	7020	تجزئة أسهم	2006-04-05	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  100.0 مليون سهم إلى 500.0 مليون سهم	2025-12-25 15:06:35.489679
4822	1020	تجزئة أسهم	2006-04-05	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  15.0 مليون سهم إلى 75.0 مليون سهم	2025-12-25 15:06:35.489909
4823	1030	تجزئة أسهم	2006-04-05	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  48.12 مليون سهم إلى 240.62 مليون سهم	2025-12-25 15:06:35.490133
4824	1040	تجزئة أسهم	2006-04-05	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  44.1 مليون سهم إلى 220.5 مليون سهم	2025-12-25 15:06:35.490337
4825	1050	تجزئة أسهم	2006-04-05	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  67.5 مليون سهم إلى 337.5 مليون سهم	2025-12-25 15:06:35.490539
4826	1080	تجزئة أسهم	2006-04-05	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  65.0 مليون سهم إلى 325.0 مليون سهم	2025-12-25 15:06:35.490805
4827	1090	تجزئة أسهم	2006-04-05	2006-04-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  120.0 مليون سهم إلى 600.0 مليون سهم	2025-12-25 15:06:35.493842
4828	4020	توزيع أرباح نقدية	2006-03-08	2006-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-26 توزيع 0.8 SAR	2025-12-25 15:06:35.494162
4829	4150	توزيع أرباح نقدية	2005-12-13	2006-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-13 توزيع 0.5 SAR	2025-12-25 15:06:35.494446
4830	4010	تجزئة أسهم	2006-03-30	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.0 مليون سهم إلى 50.0 مليون سهم	2025-12-25 15:06:35.49496
4831	4020	تجزئة أسهم	2006-03-30	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  12.0 مليون سهم إلى 60.0 مليون سهم	2025-12-25 15:06:35.495275
4832	6050	تجزئة أسهم	2006-03-30	2006-04-01	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:35.495571
4833	4040	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  20.0 مليون سهم إلى 100.0 مليون سهم	2025-12-25 15:06:35.495842
4834	4061	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  24.0 مليون سهم إلى 120.0 مليون سهم	2025-12-25 15:06:35.496141
4835	4070	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  3.0 مليون سهم إلى 15.0 مليون سهم	2025-12-25 15:06:35.496443
4836	4090	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  24.61 مليون سهم إلى 123.04 مليون سهم	2025-12-25 15:06:35.496712
4837	4100	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  32.96 مليون سهم إلى 164.82 مليون سهم	2025-12-25 15:06:35.496992
4838	4110	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  3.6 مليون سهم إلى 18.0 مليون سهم	2025-12-25 15:06:35.497255
4839	4130	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  3.0 مليون سهم إلى 15.0 مليون سهم	2025-12-25 15:06:35.497499
4840	4140	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  1.44 مليون سهم إلى 7.2 مليون سهم	2025-12-25 15:06:35.497755
4841	4150	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  20.0 مليون سهم إلى 100.0 مليون سهم	2025-12-25 15:06:35.497995
4842	4160	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.0 مليون سهم إلى 10.0 مليون سهم	2025-12-25 15:06:35.49826
4843	4170	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.03 مليون سهم إلى 10.15 مليون سهم	2025-12-25 15:06:35.498515
4844	4180	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  7.7 مليون سهم إلى 38.5 مليون سهم	2025-12-25 15:06:35.498737
4845	4190	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.0 مليون سهم إلى 30.0 مليون سهم	2025-12-25 15:06:35.498951
4846	4200	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.0 مليون سهم إلى 20.0 مليون سهم	2025-12-25 15:06:35.49916
4847	6090	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.0 مليون سهم إلى 50.0 مليون سهم	2025-12-25 15:06:35.499398
4848	6020	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.0 مليون سهم إلى 50.0 مليون سهم	2025-12-25 15:06:35.499609
4849	6030	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.0 مليون سهم إلى 30.0 مليون سهم	2025-12-25 15:06:35.499875
4850	6040	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.0 مليون سهم إلى 20.0 مليون سهم	2025-12-25 15:06:35.50009
4851	6060	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  1.5 مليون سهم إلى 7.5 مليون سهم	2025-12-25 15:06:35.500311
4852	6070	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.0 مليون سهم إلى 20.0 مليون سهم	2025-12-25 15:06:35.50052
4853	6080	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  1.0 مليون سهم إلى 5.0 مليون سهم	2025-12-25 15:06:35.500726
4854	8010	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.0 مليون سهم إلى 50.0 مليون سهم	2025-12-25 15:06:35.500922
4855	4050	تجزئة أسهم	2006-03-29	2006-04-01	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من50.0  to 10.0  وبناءا على ذلك تم زيادة عدد الأسهم من  9.0 مليون سهم إلى 45.0 مليون سهم	2025-12-25 15:06:35.501132
4856	3050	توزيع أسهم خزينة كأسهم منحة	2006-03-29	2006-04-01	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,400,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.50227
4857	3050	توزيع أرباح نقدية	2006-02-12	2006-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-05 توزيع 5.0 SAR	2025-12-25 15:06:35.502558
4858	6090	توزيع أرباح نقدية	2006-01-29	2006-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-05-29 توزيع 2.5 SAR	2025-12-25 15:06:35.502901
4859	1040	توزيع أسهم خزينة كأسهم منحة	2006-03-28	2006-03-29	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,205,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:35.503245
4860	3020	توزيع أسهم خزينة كأسهم منحة	2006-03-28	2006-03-29	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,350,000,000  عن طريق توزيع أسهم منحة بمقدار 0.02% من رأس المال 	2025-12-25 15:06:35.503685
4861	3020	توزيع أرباح نقدية	2006-03-01	2006-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-03 توزيع 30.0 SAR	2025-12-25 15:06:35.504023
4862	6040	توزيع أرباح نقدية	2006-02-01	2006-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-17 توزيع 5.0 SAR	2025-12-25 15:06:35.504365
4863	1040	توزيع أرباح نقدية	2006-01-22	2006-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-04 توزيع 7.5 SAR	2025-12-25 15:06:35.504695
4864	4090	توزيع أسهم خزينة كأسهم منحة	2006-03-27	2006-03-28	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,230,365,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:35.505021
4865	2040	توزيع أرباح نقدية	2006-02-28	2006-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-10 توزيع 10.0 SAR	2025-12-25 15:06:35.505352
4866	3060	توزيع أرباح نقدية	2006-02-13	2006-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-10 توزيع 15.0 SAR	2025-12-25 15:06:35.505687
4867	4190	توزيع أرباح نقدية	2006-02-13	2006-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-05 توزيع 20.0 SAR	2025-12-25 15:06:35.506015
4868	3080	توزيع أسهم خزينة كأسهم منحة	2006-03-25	2006-03-26	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 860,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.506346
4869	2180	توزيع أرباح نقدية	2006-01-30	2006-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-04-15 توزيع 6.0 SAR	2025-12-25 15:06:35.506668
4870	1060	توزيع أسهم خزينة كأسهم منحة	2006-03-21	2006-03-22	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,750,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:35.507007
4871	4080	توزيع أسهم خزينة كأسهم منحة	2006-03-20	2006-03-22	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 812,500,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.507341
4872	1060	توزيع أرباح نقدية	2005-10-19	2006-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-28 توزيع 5.0 SAR	2025-12-25 15:06:35.507634
4873	3030	توزيع أرباح نقدية	2006-02-14	2006-03-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-29 توزيع 9.0 SAR	2025-12-25 15:06:35.507939
4874	1080	توزيع أسهم خزينة كأسهم منحة	2006-03-11	2006-03-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.508238
4875	3080	توزيع أرباح نقدية	2006-02-12	2006-03-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-20 توزيع 20.0 SAR	2025-12-25 15:06:35.508536
4876	1080	توزيع أرباح نقدية	2005-12-18	2006-03-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-20 توزيع 5.0 SAR	2025-12-25 15:06:35.508831
4877	3040	توزيع أرباح نقدية	2006-01-18	2006-03-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-25 توزيع 23.0 SAR	2025-12-25 15:06:35.509139
4878	1090	توزيع أرباح نقدية	2006-01-01	2006-03-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-25 توزيع 14.0 SAR	2025-12-25 15:06:35.509443
4879	1030	توزيع أسهم خزينة كأسهم منحة	2006-03-06	2006-03-07	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,406,250,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.509746
4880	1030	توزيع أرباح نقدية	2005-11-27	2006-03-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-14 توزيع 3.0 SAR	2025-12-25 15:06:35.510191
4881	1050	توزيع أسهم خزينة كأسهم منحة	2006-03-05	2006-03-06	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 3,375,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:35.510484
4882	1050	توزيع أرباح نقدية	2005-12-17	2006-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-18 توزيع 5.0 SAR	2025-12-25 15:06:35.510748
4883	1120	توزيع أسهم خزينة كأسهم منحة	2006-03-04	2006-03-05	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,750,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:35.511006
4884	8010	توزيع أرباح نقدية	2006-02-01	2006-03-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-25 توزيع 30.0 SAR	2025-12-25 15:06:35.511275
4885	1120	توزيع أرباح نقدية	2006-01-25	2006-03-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-18 توزيع 5.0 SAR	2025-12-25 15:06:35.511547
4886	1010	توزيع أسهم خزينة كأسهم منحة	2006-02-27	2006-02-28	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.511824
4887	1010	توزيع أرباح نقدية	2005-12-12	2006-02-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-06 توزيع 8.0 SAR	2025-12-25 15:06:35.512754
4888	3010	توزيع أرباح نقدية	2006-01-23	2006-02-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-03-05 توزيع 12.0 SAR	2025-12-25 15:06:35.513015
4889	2240	استحواذ على شركة	2006-02-15	2006-02-15	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Masaken Al Arabia	2025-12-25 15:06:35.513275
4890	1120	تغيير اسم الشركة	2006-02-11	2006-02-11	\N	\N	\N	SAR	تم تعديل اسم الشركة من Al Rajhi Banking & Investment إلى Al Rajhi Bank	2025-12-25 15:06:35.513561
4891	2190	استحواذ على شركة	2006-02-07	2006-02-07	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Sama Airline Co Ltd	2025-12-25 15:06:35.513829
4892	2110	زيادة رأس مال - إصدار حقوق أولوية	2006-01-21	2006-01-22	\N	\N	\N	SAR	زياده راس المال من 640,000,000 SAR الى 760,000,000 SAR من خلال اصدار 2,400,000 سهم بسعر اصدار SAR 50.0  لكل سهم	2025-12-25 15:06:35.514088
4893	6080	تجزئة أسهم	2006-01-18	2006-01-19	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  0.5 مليون سهم إلى 1.0 مليون سهم	2025-12-25 15:06:35.51437
4894	2060	استحواذ على شركة	2006-01-01	2006-01-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع El Nasr Spinning and Weaving and Dyeing Co	2025-12-25 15:06:35.514626
4895	1820	تغيير اسم الشركة	2006-01-01	2006-01-01	\N	\N	\N	SAR	تم تعديل اسم الشركة من Al Hokair Group إلى Al Hokair Group	2025-12-25 15:06:35.514879
4896	6090	زيادة رأس مال - إصدار حقوق أولوية	2005-12-27	2005-12-28	\N	\N	\N	SAR	زياده راس المال من 250,000,000 SAR الى 500,000,000 SAR من خلال اصدار 5,000,000 سهم بسعر اصدار SAR 75.0  لكل سهم	2025-12-25 15:06:35.515149
4897	6090	تغيير اسم الشركة	2005-12-04	2005-12-27	\N	\N	\N	SAR	تم تعديل اسم الشركة من JAZADCO إلى JAZADCO	2025-12-25 15:06:35.515416
4898	2280	توزيع أسهم خزينة كأسهم منحة	2005-12-25	2005-12-26	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.51566
4899	2030	توزيع أرباح نقدية	2005-12-03	2005-12-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2006-01-09 توزيع 8.0 SAR	2025-12-25 15:06:35.515931
4900	4190	توزيع أسهم خزينة كأسهم منحة	2005-12-18	2005-12-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:35.516213
4901	6050	زيادة رأس مال - إصدار حقوق أولوية	2005-01-12	2005-12-15	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:36.209402
4902	2210	تغيير اسم الشركة	2005-09-25	2005-12-12	\N	\N	\N	SAR	تم تعديل اسم الشركة من Nama إلى Nama Chemicals	2025-12-25 15:06:36.210217
4903	2140	توزيع أسهم خزينة كأسهم منحة	2005-12-05	2005-12-06	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 343,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.210539
4904	4100	توزيع أرباح نقدية	2005-07-31	2005-12-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-12-17 توزيع 6.0 SAR	2025-12-25 15:06:36.210861
4905	2050	زيادة رأس مال - إصدار حقوق أولوية	2005-11-16	2005-11-17	\N	\N	\N	SAR	زياده راس المال من 1,500,000,000 SAR الى 1,800,000,000 SAR من خلال اصدار 6,000,000 سهم بسعر اصدار SAR 400.0  لكل سهم	2025-12-25 15:06:36.211143
4906	2050	توزيع أرباح نقدية	2005-10-12	2005-10-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-11-19 توزيع 3.0 SAR	2025-12-25 15:06:36.211426
4907	7010	توزيع أرباح نقدية	2005-10-16	2005-10-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-11-12 توزيع 7.0 SAR	2025-12-25 15:06:36.211705
4908	3010	تغيير اسم الشركة	2005-10-18	2005-10-18	\N	\N	\N	SAR	تم تعديل اسم الشركة	2025-12-25 15:06:36.211976
4909	1120	توزيع أرباح نقدية	2005-10-05	2005-10-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-10-23 توزيع 5.0 SAR	2025-12-25 15:06:36.212253
4910	4180	توزيع أسهم خزينة كأسهم منحة	2005-10-08	2005-10-09	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 385,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:36.212549
4911	4070	توزيع أرباح نقدية	2007-07-24	2005-09-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-10-26 توزيع 3.0 SAR	2025-12-25 15:06:36.212839
4912	4300	توزيع أرباح نقدية	2005-08-03	2005-08-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-08-06 توزيع 15.0 SAR	2025-12-25 15:06:36.21311
4914	1040	توزيع أرباح نقدية	2005-07-13	2005-07-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-08-13 توزيع 7.5 SAR	2025-12-25 15:06:36.213656
4915	2160	زيادة رأس مال - إصدار حقوق أولوية	2005-07-18	2005-07-19	\N	\N	\N	SAR	زياده راس المال من 770,000,000 SAR الى 1,155,000,000 SAR من خلال اصدار 7,700,000 سهم بسعر اصدار SAR 55.0  لكل سهم	2025-12-25 15:06:36.21407
4916	3060	توزيع أرباح نقدية	2005-07-16	2005-07-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-30 توزيع 5.0 SAR	2025-12-25 15:06:36.214348
4917	2050	توزيع أسهم خزينة كأسهم منحة	2005-07-16	2005-07-17	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.214612
4918	2050	توزيع أرباح نقدية	2005-06-26	2005-07-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-23 توزيع 3.0 SAR	2025-12-25 15:06:36.214865
4919	2050	توزيع أرباح نقدية	2005-05-04	2005-07-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-23 توزيع 3.0 SAR	2025-12-25 15:06:36.215299
4920	1120	توزيع أرباح نقدية	2005-07-05	2005-07-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-17 توزيع 10.0 SAR	2025-12-25 15:06:36.215628
4921	3050	توزيع أرباح نقدية	2005-07-05	2005-07-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-16 توزيع 12.0 SAR	2025-12-25 15:06:36.215964
4922	1060	توزيع أرباح نقدية	2005-06-13	2005-07-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-16 توزيع 10.0 SAR	2025-12-25 15:06:36.216488
4923	3030	توزيع أرباح نقدية	2005-06-21	2005-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-16 توزيع 9.0 SAR	2025-12-25 15:06:36.216849
4924	4080	توزيع أرباح نقدية	2005-06-15	2005-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-08-03 توزيع 4.0 SAR	2025-12-25 15:06:36.217248
4925	1010	توزيع أرباح نقدية	2005-06-13	2005-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-10 توزيع 8.0 SAR	2025-12-25 15:06:36.217597
4926	3010	توزيع أرباح نقدية	2005-06-12	2005-07-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-23 توزيع 8.0 SAR	2025-12-25 15:06:36.217879
4927	1050	توزيع أرباح نقدية	2005-06-18	2005-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-16 توزيع 8.0 SAR	2025-12-25 15:06:36.218147
4928	1080	توزيع أرباح نقدية	2005-06-08	2005-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-09 توزيع 5.0 SAR	2025-12-25 15:06:36.218424
4929	4090	توزيع أرباح نقدية	2005-03-23	2005-06-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-07-16 توزيع 4.0 SAR	2025-12-25 15:06:36.218974
4930	2060	توزيع أسهم خزينة كأسهم منحة	2005-05-31	2005-06-01	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,570,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:36.21943
4931	2060	توزيع أرباح نقدية	2005-04-17	2005-06-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-06-14 توزيع 6.0 SAR	2025-12-25 15:06:36.219871
4932	4040	توزيع أرباح نقدية	2005-03-30	2005-05-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-05-16 توزيع 2.5 SAR	2025-12-25 15:06:36.220263
4933	4050	توزيع أرباح نقدية	2005-02-26	2005-05-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-05-21 توزيع 3.5 SAR	2025-12-25 15:06:36.220634
4934	4110	توزيع أرباح نقدية	2005-01-09	2005-05-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-05-30 توزيع 4.0 SAR	2025-12-25 15:06:36.221026
4935	3020	توزيع أرباح نقدية	2005-03-22	2005-04-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-30 توزيع 30.0 SAR	2025-12-25 15:06:36.221386
4936	4020	توزيع أرباح نقدية	2005-03-23	2005-04-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-05-21 توزيع 8.0 SAR	2025-12-25 15:06:36.22173
4937	2080	توزيع أرباح نقدية	2005-03-05	2005-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-27 توزيع 8.0 SAR	2025-12-25 15:06:36.2221
4938	4030	استحواذ على شركة	2005-04-18	2005-04-18	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Petredec Pte Ltd	2025-12-25 15:06:36.222439
4939	2010	توزيع أسهم خزينة كأسهم منحة	2005-04-16	2005-04-17	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 20,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.22279
4940	2010	توزيع أرباح نقدية	2005-03-21	2005-04-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-30 توزيع 15.0 SAR	2025-12-25 15:06:36.223117
4941	2070	توزيع أرباح نقدية	2005-02-23	2005-04-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-23 توزيع 5.0 SAR	2025-12-25 15:06:36.223474
4942	2020	توزيع أرباح نقدية	2005-02-09	2005-04-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-23 توزيع 14.0 SAR	2025-12-25 15:06:36.223845
4943	2250	توزيع أسهم خزينة كأسهم منحة	2005-03-08	2005-04-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,800,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:36.224194
4944	2250	توزيع أرباح نقدية	2005-01-02	2005-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-26 توزيع 4.0 SAR	2025-12-25 15:06:36.224532
4945	2150	توزيع أرباح نقدية	2004-12-27	2005-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-23 توزيع 5.0 SAR	2025-12-25 15:06:36.224861
4946	4140	توزيع أرباح نقدية	2005-02-20	2005-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-05-07 توزيع 5.0 SAR	2025-12-25 15:06:36.225193
4947	4010	توزيع أرباح نقدية	2005-03-06	2005-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-05 توزيع 3.0 SAR	2025-12-25 15:06:36.225499
4948	4180	توزيع أرباح نقدية	2005-02-23	2005-04-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-17 توزيع 2.5 SAR	2025-12-25 15:06:36.225857
4984	4080	توزيع أرباح نقدية	2004-10-25	2004-11-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-12-04 توزيع 7.0 SAR	2025-12-25 15:06:36.243516
4949	1090	توزيع أسهم خزينة كأسهم منحة	2005-03-31	2005-04-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 6,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:36.226194
4950	6010	توزيع أرباح نقدية	2005-02-23	2005-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-23 توزيع 5.0 SAR	2025-12-25 15:06:36.22664
4951	3050	توزيع أرباح نقدية	2005-01-31	2005-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-02 توزيع 14.0 SAR	2025-12-25 15:06:36.227014
4952	2040	توزيع أرباح نقدية	2004-12-28	2005-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-06 توزيع 10.0 SAR	2025-12-25 15:06:36.228195
4953	6040	توزيع أرباح نقدية	2005-02-09	2005-03-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-28 توزيع 3.0 SAR	2025-12-25 15:06:36.228574
4954	3040	توزيع أرباح نقدية	2005-02-23	2005-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-04-09 توزيع 22.0 SAR	2025-12-25 15:06:36.228954
4955	1020	توزيع أرباح نقدية	2004-12-21	2005-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-26 توزيع 3.0 SAR	2025-12-25 15:06:36.229324
4956	2050	توزيع أسهم خزينة كأسهم منحة	2005-03-19	2005-03-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.229675
4957	2050	توزيع أرباح نقدية	2005-02-09	2005-03-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.230032
4958	3060	توزيع أرباح نقدية	2005-02-03	2005-03-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-26 توزيع 20.0 SAR	2025-12-25 15:06:36.230448
4959	4190	توزيع أرباح نقدية	2005-02-07	2005-03-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-23 توزيع 22.0 SAR	2025-12-25 15:06:36.230893
4960	3030	توزيع أرباح نقدية	2005-02-07	2005-03-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-28 توزيع 18.0 SAR	2025-12-25 15:06:36.231339
4961	1040	توزيع أرباح نقدية	2005-01-18	2005-03-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-30 توزيع 8.5 SAR	2025-12-25 15:06:36.231786
4962	1060	توزيع أرباح نقدية	2004-12-13	2005-03-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-21 توزيع 10.0 SAR	2025-12-25 15:06:36.23222
4963	1080	توزيع أسهم خزينة كأسهم منحة	2005-03-13	2005-03-14	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.232675
4964	2090	توزيع أرباح نقدية	2005-01-12	2005-03-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.233147
4965	1080	توزيع أرباح نقدية	2004-12-19	2005-03-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-26 توزيع 4.0 SAR	2025-12-25 15:06:36.233611
4966	1120	توزيع أسهم خزينة كأسهم منحة	2005-03-12	2005-03-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 4,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:36.234075
4967	7010	توزيع أرباح نقدية	2005-02-05	2005-03-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-19 توزيع 14.0 SAR	2025-12-25 15:06:36.23454
4968	1120	توزيع أرباح نقدية	2004-12-26	2005-03-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-15 توزيع 35.0 SAR	2025-12-25 15:06:36.234982
4969	1090	توزيع أرباح نقدية	2005-01-13	2005-03-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-23 توزيع 10.5 SAR	2025-12-25 15:06:36.235406
4970	1050	توزيع أرباح نقدية	2004-12-12	2005-03-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-16 توزيع 12.0 SAR	2025-12-25 15:06:36.235832
4971	3080	توزيع أرباح نقدية	2005-02-06	2005-03-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-12 توزيع 17.5 SAR	2025-12-25 15:06:36.236239
4972	2180	توزيع أرباح نقدية	2004-12-12	2005-03-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-12 توزيع 6.0 SAR	2025-12-25 15:06:36.236604
4973	1030	توزيع أسهم خزينة كأسهم منحة	2005-02-26	2005-02-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,718,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.23697
4974	1030	توزيع أرباح نقدية	2004-11-24	2005-02-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-03-15 توزيع 3.0 SAR	2025-12-25 15:06:36.237341
4975	1010	توزيع أرباح نقدية	2004-12-13	2005-02-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-02-22 توزيع 10.0 SAR	2025-12-25 15:06:36.237715
4976	1010	توزيع أسهم خزينة كأسهم منحة	2004-12-13	2005-02-22	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 5,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.238063
4977	3010	توزيع أرباح نقدية	2005-01-12	2005-02-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2005-02-27 توزيع 9.0 SAR	2025-12-25 15:06:36.238394
4978	3010	توزيع أرباح نقدية	2004-11-28	2004-12-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-12-20 توزيع 7.0 SAR	2025-12-25 15:06:36.238691
4979	4100	زيادة رأس مال - إصدار حقوق أولوية	2004-12-12	2004-12-13	\N	\N	\N	SAR	زياده راس المال من 1,414,534,800 SAR الى 1,648,162,400 SAR من خلال اصدار 4,672,552 سهم بسعر اصدار SAR 250.0  لكل سهم	2025-12-25 15:06:36.238975
4980	4100	توزيع أرباح نقدية	2004-09-22	2004-12-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-12-25 توزيع 6.0 SAR	2025-12-25 15:06:36.239281
4981	6020	تجزئة أسهم	2004-12-10	2004-12-11	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  5.0 مليون سهم إلى 10.0 مليون سهم	2025-12-25 15:06:36.239571
4982	4080	تغيير السنة المالية	2004-12-05	2004-12-05	\N	\N	\N	SAR	تاريخ نهاية الحق فىتغيير السنة المالية	2025-12-25 15:06:36.239885
4983	2030	توزيع أرباح نقدية	2004-10-16	2004-11-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-12-14 توزيع 8.0 SAR	2025-12-25 15:06:36.240172
4986	2190	توزيع أسهم خزينة كأسهم منحة	2004-10-12	2004-10-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 400,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:36.244126
4987	2200	توزيع أسهم خزينة كأسهم منحة	2004-10-12	2004-10-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 315,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:36.244904
4988	1020	زيادة رأس مال - إصدار حقوق أولوية	2004-10-03	2004-10-04	\N	\N	\N	SAR	زياده راس المال من 600,000,000 SAR الى 750,000,000 SAR من خلال اصدار 3,000,000 سهم بسعر اصدار SAR 130.0  لكل سهم	2025-12-25 15:06:36.245201
4989	4070	توزيع أرباح نقدية	2004-09-13	2004-09-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-10-13 توزيع 3.0 SAR	2025-12-25 15:06:36.245491
4990	2050	توزيع أرباح نقدية	2004-07-17	2004-07-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.245784
4991	7010	توزيع أرباح نقدية	2004-07-14	2004-07-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-08-07 توزيع 12.0 SAR	2025-12-25 15:06:36.246072
4992	1040	توزيع أرباح نقدية	2004-07-12	2004-07-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-08-07 توزيع 6.5 SAR	2025-12-25 15:06:36.246521
4993	4110	توزيع أرباح نقدية	2004-05-26	2004-07-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-09-25 توزيع 7.0 SAR	2025-12-25 15:06:36.24697
4994	3050	توزيع أرباح نقدية	2004-07-13	2004-07-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-07-17 توزيع 11.0 SAR	2025-12-25 15:06:36.247425
4995	1060	توزيع أرباح نقدية	2004-06-28	2004-07-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-07-14 توزيع 9.0 SAR	2025-12-25 15:06:36.247893
4996	1080	توزيع أرباح نقدية	2004-06-13	2004-07-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-07-10 توزيع 5.0 SAR	2025-12-25 15:06:36.248349
4997	1050	توزيع أرباح نقدية	2004-06-26	2004-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-07-17 توزيع 8.0 SAR	2025-12-25 15:06:36.248802
4998	1010	توزيع أرباح نقدية	2004-06-22	2004-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-07-10 توزيع 8.0 SAR	2025-12-25 15:06:36.249306
4999	1090	توزيع أرباح نقدية	2004-06-15	2004-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-07-20 توزيع 10.5 SAR	2025-12-25 15:06:36.249788
5000	2110	زيادة رأس مال - إصدار حقوق أولوية	2004-04-25	2004-06-29	\N	\N	\N	SAR	زياده راس المال من 500,000,000 SAR الى 640,000,000 SAR من خلال اصدار 2,800,000 سهم بسعر اصدار SAR 100.0  لكل سهم	2025-12-25 15:06:36.250254
5001	2060	زيادة رأس مال - إصدار حقوق أولوية	2004-06-06	2004-06-07	\N	\N	\N	SAR	زياده راس المال من 785,000,000 SAR الى 981,250,000 SAR من خلال اصدار 3,925,000 سهم بسعر اصدار SAR 135.0  لكل سهم	2025-12-25 15:06:36.913892
5002	2060	توزيع أرباح نقدية	2004-04-17	2004-06-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-06-19 توزيع 5.0 SAR	2025-12-25 15:06:36.914462
5003	2170	زيادة رأس مال - إصدار حقوق أولوية	2004-06-01	2004-06-02	\N	\N	\N	SAR	زياده راس المال من 173,000,000 SAR الى 692,000,000 SAR من خلال اصدار 10,380,000 سهم بسعر اصدار SAR 60.0  لكل سهم	2025-12-25 15:06:36.914761
5004	2220	زيادة رأس مال - إصدار حقوق أولوية	2004-05-29	2004-05-30	\N	\N	\N	SAR	زياده راس المال من 100,000,000 SAR الى 125,000,000 SAR من خلال اصدار 500,000 سهم بسعر اصدار SAR 50.0  لكل سهم	2025-12-25 15:06:36.915099
5005	4050	توزيع أرباح نقدية	2004-04-06	2004-05-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-07-14 توزيع 2.5 SAR	2025-12-25 15:06:36.915417
5006	4080	استحواذ على شركة	2004-05-26	2004-05-26	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Aseer Arabian Industrial Investment Ltd	2025-12-25 15:06:36.915737
5007	2160	توزيع أسهم خزينة كأسهم منحة	2004-05-19	2004-05-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 770,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.916055
5008	2050	توزيع أسهم خزينة كأسهم منحة	2004-05-18	2004-05-19	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.916386
5009	2050	توزيع أرباح نقدية	2004-04-17	2004-05-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.916702
5010	2230	توزيع أسهم خزينة كأسهم منحة	2004-05-17	2004-05-18	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 527,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.917014
5011	1020	توزيع أرباح نقدية	2004-04-24	2004-05-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-29 توزيع 2.55 SAR	2025-12-25 15:06:36.917313
5012	4040	توزيع أرباح نقدية	2004-03-31	2004-05-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-29 توزيع 2.5 SAR	2025-12-25 15:06:36.917636
5013	4090	توزيع أرباح نقدية	2004-03-27	2004-05-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-10 توزيع 3.5 SAR	2025-12-25 15:06:36.917947
5014	2080	توزيع أرباح نقدية	2004-03-13	2004-05-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-15 توزيع 6.0 SAR	2025-12-25 15:06:36.91826
5015	3020	توزيع أرباح نقدية	2004-03-24	2004-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-01 توزيع 30.0 SAR	2025-12-25 15:06:36.91859
5016	4140	توزيع أرباح نقدية	2004-03-19	2004-04-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-25 توزيع 2.5 SAR	2025-12-25 15:06:36.919657
5017	3090	توزيع أرباح نقدية	2004-01-16	2004-04-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-04-26 توزيع 5.0 SAR	2025-12-25 15:06:36.920159
5018	4180	توزيع أسهم خزينة كأسهم منحة	2004-04-21	2004-04-22	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 220,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.920659
5019	4180	توزيع أرباح نقدية	2004-02-08	2004-04-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-04-22 توزيع 2.5 SAR	2025-12-25 15:06:36.92113
5020	2150	توزيع أرباح نقدية	2004-03-03	2004-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-24 توزيع 2.5 SAR	2025-12-25 15:06:36.921576
5021	2010	توزيع أرباح نقدية	2004-03-15	2004-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-01 توزيع 12.0 SAR	2025-12-25 15:06:36.922142
5022	2240	توزيع أرباح نقدية	2004-04-10	2004-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-04-11 توزيع 3.0 SAR	2025-12-25 15:06:36.922576
5023	2240	توزيع أسهم خزينة كأسهم منحة	2004-04-10	2004-04-11	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 350,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.923083
5024	4020	توزيع أرباح نقدية	2004-03-13	2004-04-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-05-10 توزيع 8.0 SAR	2025-12-25 15:06:36.92353
5025	2020	توزيع أرباح نقدية	2004-02-23	2004-04-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-04-21 توزيع 8.0 SAR	2025-12-25 15:06:36.924021
5026	2070	توزيع أرباح نقدية	2004-02-21	2004-04-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-04-17 توزيع 4.0 SAR	2025-12-25 15:06:36.924452
5027	6040	توزيع أرباح نقدية	2004-02-25	2004-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-31 توزيع 2.5 SAR	2025-12-25 15:06:36.924876
5028	4010	توزيع أرباح نقدية	2004-02-28	2004-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-30 توزيع 2.75 SAR	2025-12-25 15:06:36.925396
5029	6010	توزيع أرباح نقدية	2004-02-22	2004-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-04-18 توزيع 3.0 SAR	2025-12-25 15:06:36.925825
5030	2050	توزيع أرباح نقدية	2004-02-25	2004-03-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.92624
5031	3050	توزيع أرباح نقدية	2004-03-03	2004-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-27 توزيع 20.5 SAR	2025-12-25 15:06:36.926663
5032	2040	توزيع أرباح نقدية	2003-12-29	2004-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-29 توزيع 6.0 SAR	2025-12-25 15:06:36.927089
5033	2090	توزيع أرباح نقدية	2004-01-27	2004-03-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.927531
5034	3060	توزيع أرباح نقدية	2004-01-26	2004-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-29 توزيع 17.5 SAR	2025-12-25 15:06:36.927949
5035	7010	توزيع أرباح نقدية	2004-02-12	2004-03-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-04-11 توزيع 14.0 SAR	2025-12-25 15:06:36.928356
5036	1040	توزيع أسهم خزينة كأسهم منحة	2004-03-16	2004-03-17	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,260,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.928818
5037	3080	توزيع أرباح نقدية	2004-02-15	2004-03-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-23 توزيع 17.5 SAR	2025-12-25 15:06:36.929259
5038	1060	توزيع أسهم خزينة كأسهم منحة	2004-03-15	2004-03-16	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.929696
5039	4190	توزيع أرباح نقدية	2004-01-20	2004-03-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-31 توزيع 20.0 SAR	2025-12-25 15:06:36.930155
5040	1090	توزيع أرباح نقدية	2004-02-18	2004-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-18 توزيع 6.25 SAR	2025-12-25 15:06:36.930582
5041	1080	توزيع أسهم خزينة كأسهم منحة	2004-02-29	2004-03-01	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.930978
5042	1080	توزيع أرباح نقدية	2003-12-23	2004-03-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-17 توزيع 11.0 SAR	2025-12-25 15:06:36.931339
5043	1050	توزيع أرباح نقدية	2003-12-22	2004-02-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-07 توزيع 9.5 SAR	2025-12-25 15:06:36.931715
5044	1060	توزيع أرباح نقدية	2003-12-19	2004-02-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-15 توزيع 11.0 SAR	2025-12-25 15:06:36.932069
5045	3010	توزيع أرباح نقدية	2004-01-21	2004-02-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-08 توزيع 13.5 SAR	2025-12-25 15:06:36.932436
5046	1120	توزيع أرباح نقدية	2004-01-25	2004-02-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-02-25 توزيع 35.0 SAR	2025-12-25 15:06:36.932815
5047	1040	توزيع أرباح نقدية	2004-01-12	2004-02-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-03-16 توزيع 9.5 SAR	2025-12-25 15:06:36.933189
5048	4100	تجزئة أسهم	2004-02-19	2004-02-21	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  14.15 مليون سهم إلى 28.29 مليون سهم	2025-12-25 15:06:36.933794
5049	3030	توزيع أرباح نقدية	2004-01-21	2004-02-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-02-28 توزيع 17.0 SAR	2025-12-25 15:06:36.934168
5050	2180	توزيع أرباح نقدية	2003-12-25	2004-02-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-02-23 توزيع 6.0 SAR	2025-12-25 15:06:36.934523
5051	1030	توزيع أسهم خزينة كأسهم منحة	2004-02-12	2004-02-12	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,375,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.934904
5052	1030	توزيع أرباح نقدية	2003-12-14	2004-02-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2004-02-29 توزيع 3.0 SAR	2025-12-25 15:06:36.93529
5053	2200	زيادة رأس مال - إصدار حقوق أولوية	2004-01-25	2004-01-26	\N	\N	\N	SAR	زياده راس المال من 140,000,000 SAR الى 210,000,000 SAR من خلال اصدار 1,400,000 سهم بسعر اصدار SAR 50.0  لكل سهم	2025-12-25 15:06:36.935673
5054	4100	توزيع أرباح نقدية	2003-10-04	2003-12-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-12-24 توزيع 12.0 SAR	2025-12-25 15:06:36.936033
5214	3020	توزيع أرباح نقدية	2000-02-26	2000-03-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.281812
5055	2190	زيادة رأس مال - إصدار حقوق أولوية	2003-12-13	2003-12-14	\N	\N	\N	SAR	زياده راس المال من 150,000,000 SAR الى 200,000,000 SAR من خلال اصدار 1,000,000 سهم بسعر اصدار SAR 50.0  لكل سهم	2025-12-25 15:06:36.936402
5056	4080	توزيع أرباح نقدية	2003-09-02	2003-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-10-01 توزيع 2.5 SAR	2025-12-25 15:06:36.936858
5057	2030	توزيع أرباح نقدية	2003-07-31	2003-09-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-10-15 توزيع 5.0 SAR	2025-12-25 15:06:36.93721
5058	7010	توزيع أرباح نقدية	2013-07-18	2003-08-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-08-30 توزيع 8.0 SAR	2025-12-25 15:06:36.937562
5059	1040	توزيع أرباح نقدية	2003-07-16	2003-07-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-08-06 توزيع 7.5 SAR	2025-12-25 15:06:36.937906
5060	1060	توزيع أرباح نقدية	2003-06-30	2003-07-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-08-06 توزيع 9.0 SAR	2025-12-25 15:06:36.93827
5061	2060	زيادة رأس مال - اكتتاب خاص	2003-07-20	2003-07-21	\N	\N	\N	SAR	زيادة رأس المال من   600,000,000  الى 785,000,000 عن طريق تحويل سندات إلى 3,700,000 سهم	2025-12-25 15:06:36.938628
5062	2060	توزيع أرباح نقدية	2003-04-19	2003-07-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-07-29 توزيع 3.0 SAR	2025-12-25 15:06:36.938964
5063	2050	توزيع أرباح نقدية	2003-07-05	2003-07-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:36.93928
5064	2050	زيادة رأس مال - إصدار حقوق أولوية	2003-07-05	2003-07-06	\N	\N	\N	SAR	زياده راس المال من 628,571,400 SAR الى 800,000,000 SAR من خلال اصدار 3,428,572 سهم بسعر اصدار SAR 50.0  لكل سهم	2025-12-25 15:06:36.939594
5065	1090	توزيع أرباح نقدية	2003-06-23	2003-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-07-15 توزيع 9.75 SAR	2025-12-25 15:06:36.939918
5066	1010	توزيع أرباح نقدية	2003-06-15	2003-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-07-09 توزيع 8.0 SAR	2025-12-25 15:06:36.940237
5067	2190	زيادة رأس مال - إصدار حقوق أولوية	2002-02-17	2003-06-15	\N	\N	\N	SAR	زياده راس المال من 100,000,000  الى 150,000,000  من خلال اصدار 1,000,000 سهم بسعر اصدار  50.0  لكل سهم	2025-12-25 15:06:36.940556
5068	2160	توزيع أسهم خزينة كأسهم منحة	2003-06-03	2003-06-04	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 700,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.940904
5069	2160	توزيع أرباح نقدية	2003-04-21	2003-06-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-06-04 توزيع 3.5 SAR	2025-12-25 15:06:36.941232
5070	6060	توزيع أرباح نقدية	2003-04-27	2003-05-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-06-14 توزيع 2.5 SAR	2025-12-25 15:06:36.94157
5071	4090	تخفيض رأس مال - بتخفيض عدد الأسهم	2003-05-15	2003-05-17	\N	\N	\N	SAR	تخفيض رأس المال من   1,000,000,000  الى 750,000,000  وعدد الاسهم الى 15,000,000 بقيمة اسمية للسهم 50 	2025-12-25 15:06:36.941871
5072	4040	توزيع أرباح نقدية	2003-03-31	2003-05-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-06-08 توزيع 2.5 SAR	2025-12-25 15:06:36.942193
5073	4110	تخفيض رأس مال - بتخفيض عدد الأسهم	2003-05-08	2003-05-10	\N	\N	\N	SAR	تخفيض رأس المال من   300,000,000  الى 180,000,000  وعدد الاسهم الى 3,600,000 بقيمة اسمية للسهم 50 	2025-12-25 15:06:36.942504
5074	5110	توزيع أرباح نقدية	2003-03-26	2003-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-05-19 توزيع 3.5 SAR	2025-12-25 15:06:36.942812
5075	2080	توزيع أرباح نقدية	2003-03-07	2003-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-05-04 توزيع 5.0 SAR	2025-12-25 15:06:36.943133
5076	4140	توزيع أرباح نقدية	2003-03-12	2003-04-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-05-20 توزيع 4.5 SAR	2025-12-25 15:06:36.943461
5077	2230	توزيع أرباح نقدية	2003-04-22	2003-04-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-23 توزيع 4.0 SAR	2025-12-25 15:06:36.943769
5078	3090	توزيع أرباح نقدية	2003-03-03	2003-04-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-23 توزيع 5.0 SAR	2025-12-25 15:06:36.944074
5079	4010	توزيع أرباح نقدية	2003-03-19	2003-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-21 توزيع 2.5 SAR	2025-12-25 15:06:36.944378
5080	3020	توزيع أرباح نقدية	2003-04-11	2003-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-26 توزيع 30.0 SAR	2025-12-25 15:06:36.944905
5081	2010	توزيع أرباح نقدية	2003-03-22	2003-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-05-05 توزيع 5.0 SAR	2025-12-25 15:06:36.945243
5082	4020	توزيع أرباح نقدية	2003-03-16	2003-04-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-05-10 توزيع 6.0 SAR	2025-12-25 15:06:36.945574
5083	4180	توزيع أرباح نقدية	2003-01-06	2003-04-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-15 توزيع 2.5 SAR	2025-12-25 15:06:36.945895
5084	2020	توزيع أرباح نقدية	2003-02-01	2003-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-20 توزيع 4.0 SAR	2025-12-25 15:06:36.946237
5085	6040	توزيع أرباح نقدية	2003-02-24	2003-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-09 توزيع 2.5 SAR	2025-12-25 15:06:36.94657
5086	2070	توزيع أرباح نقدية	2003-02-26	2003-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-12 توزيع 7.0 SAR	2025-12-25 15:06:36.947034
5087	3030	توزيع أرباح نقدية	2003-03-03	2003-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-04-07 توزيع 12.0 SAR	2025-12-25 15:06:36.947371
5088	2240	توزيع أرباح نقدية	2003-03-26	2003-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-27 توزيع 6.0 SAR	2025-12-25 15:06:36.947735
5089	3050	توزيع أرباح نقدية	2003-03-06	2003-03-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-31 توزيع 20.0 SAR	2025-12-25 15:06:36.94805
5090	3080	توزيع أرباح نقدية	2003-02-26	2003-03-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-30 توزيع 17.0 SAR	2025-12-25 15:06:36.948347
5091	2050	توزيع أرباح نقدية	2003-01-18	2003-03-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-19 توزيع 12.0 SAR	2025-12-25 15:06:36.948648
5092	2040	توزيع أرباح نقدية	2003-01-01	2003-03-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-15 توزيع 3.0 SAR	2025-12-25 15:06:36.948979
5093	3060	توزيع أرباح نقدية	2003-02-06	2003-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-22 توزيع 10.0 SAR	2025-12-25 15:06:36.949292
5094	1040	توزيع أرباح نقدية	2003-02-03	2003-03-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-29 توزيع 9.0 SAR	2025-12-25 15:06:36.949604
5095	1120	توزيع أرباح نقدية	2003-02-01	2003-03-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-08 توزيع 28.0 SAR	2025-12-25 15:06:36.949939
5096	2180	توزيع أرباح نقدية	2003-01-08	2003-03-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-06 توزيع 6.0 SAR	2025-12-25 15:06:36.95026
5097	1080	توزيع أرباح نقدية	2003-01-01	2003-03-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-12 توزيع 12.0 SAR	2025-12-25 15:06:36.950623
5098	1020	توزيع أرباح نقدية	2003-01-28	2003-02-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-02-27 توزيع 2.5 SAR	2025-12-25 15:06:36.95092
5099	1050	توزيع أسهم خزينة كأسهم منحة	2003-02-22	2003-02-23	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,250,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:36.951232
5100	1090	توزيع أرباح نقدية	2003-02-01	2003-02-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-11 توزيع 11.75 SAR	2025-12-25 15:06:36.951574
5101	1050	توزيع أرباح نقدية	2003-01-22	2003-02-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-05 توزيع 10.0 SAR	2025-12-25 15:06:37.609295
5102	1010	توزيع أرباح نقدية	2003-01-06	2003-02-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-04 توزيع 8.0 SAR	2025-12-25 15:06:37.610311
5103	1090	تغيير اسم الشركة	2003-02-14	2003-02-14	\N	\N	\N	SAR	تم تعديل اسم الشركة من Samba إلى Samba	2025-12-25 15:06:37.610721
5104	1060	توزيع أرباح نقدية	2003-01-22	2003-02-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-12 توزيع 8.0 SAR	2025-12-25 15:06:37.611131
5105	1030	توزيع أرباح نقدية	2003-01-29	2003-02-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-03-03 توزيع 12.0 SAR	2025-12-25 15:06:37.611491
5106	4100	توزيع أرباح نقدية	2002-10-06	2003-01-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2003-01-14 توزيع 12.0 SAR	2025-12-25 15:06:37.61182
5107	1820	تغيير اسم الشركة	2003-01-01	2003-01-01	\N	\N	\N	SAR	تم تعديل اسم الشركة من Al Hokair Group إلى Al Hokair Group	2025-12-25 15:06:37.612188
5108	6040	توزيع أرباح نقدية	2002-03-24	2002-09-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-09-28 توزيع 2.5 SAR	2025-12-25 15:06:37.612555
5109	4080	توزيع أرباح نقدية	2002-08-17	2002-09-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-09-26 توزيع 2.5 SAR	2025-12-25 15:06:37.612895
5110	2240	استحواذ على شركة	2002-09-14	2002-09-14	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Rite Azel Co	2025-12-25 15:06:37.613229
5111	1060	توزيع أرباح نقدية	2002-07-03	2002-07-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-08-07 توزيع 8.0 SAR	2025-12-25 15:06:37.613568
5112	1040	توزيع أرباح نقدية	2002-06-25	2002-07-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-08-13 توزيع 7.0 SAR	2025-12-25 15:06:37.613913
5113	6060	توزيع أرباح نقدية	2002-07-11	2002-07-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-08-25 توزيع 3.0 SAR	2025-12-25 15:06:37.614923
5114	6060	تخفيض رأس مال - بتخفيض عدد الأسهم	2002-07-11	2002-07-13	\N	\N	\N	SAR	تخفيض رأس المال من   178,343,450  الى 75,000,000  وعدد الاسهم الى 1,500,000 بقيمة اسمية للسهم 50 	2025-12-25 15:06:37.615343
5115	1090	توزيع أرباح نقدية	2002-06-29	2002-07-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-07-20 توزيع 9.0 SAR	2025-12-25 15:06:37.615784
5116	1010	توزيع أرباح نقدية	2002-06-03	2002-07-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-07-20 توزيع 7.5 SAR	2025-12-25 15:06:37.616249
5117	5110	توزيع أرباح نقدية	2002-05-20	2002-06-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-07-13 توزيع 4.0 SAR	2025-12-25 15:06:37.616969
5118	5110	توزيع أسهم خزينة كأسهم منحة	2002-05-20	2002-06-29	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 38,287,770,900  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:37.617444
5119	4050	توزيع أرباح نقدية	2002-04-16	2002-06-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-07-11 توزيع 2.5 SAR	2025-12-25 15:06:37.617808
5120	2060	توزيع أرباح نقدية	2002-04-21	2002-06-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.61828
5121	6050	توزيع أرباح نقدية	2002-04-22	2002-05-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.618687
5122	3060	توزيع أرباح نقدية	2002-04-01	2002-05-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-05-22 توزيع 7.5 SAR	2025-12-25 15:06:37.619116
5123	4040	توزيع أرباح نقدية	2002-03-31	2002-04-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-06-12 توزيع 2.5 SAR	2025-12-25 15:06:37.619463
5124	2240	توزيع أرباح نقدية	2002-04-18	2002-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-21 توزيع 5.0 SAR	2025-12-25 15:06:37.619896
5125	2160	توزيع أسهم خزينة كأسهم منحة	2002-04-15	2002-04-16	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 650,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:37.620259
5126	3090	توزيع أرباح نقدية	2002-03-16	2002-04-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-15 توزيع 3.5 SAR	2025-12-25 15:06:37.620602
5127	3020	توزيع أرباح نقدية	2002-03-12	2002-04-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.620918
5128	4020	توزيع أرباح نقدية	2002-03-23	2002-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-05-29 توزيع 6.0 SAR	2025-12-25 15:06:37.621214
5129	4180	توزيع أرباح نقدية	2002-01-26	2002-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-14 توزيع 2.5 SAR	2025-12-25 15:06:37.621561
5130	2010	توزيع أرباح نقدية	2002-03-13	2002-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-14 توزيع 3.0 SAR	2025-12-25 15:06:37.622016
5131	2070	توزيع أرباح نقدية	2002-02-12	2002-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-13 توزيع 6.0 SAR	2025-12-25 15:06:37.622378
5132	4170	توزيع أرباح نقدية	2002-03-04	2002-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-01 توزيع 2.5 SAR	2025-12-25 15:06:37.622677
5133	3040	توزيع أرباح نقدية	2002-03-14	2002-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-17 توزيع 21.0 SAR	2025-12-25 15:06:37.623014
5134	3010	توزيع أرباح نقدية	2002-03-11	2002-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.623319
5135	3030	توزيع أرباح نقدية	2002-02-13	2002-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-09 توزيع 9.0 SAR	2025-12-25 15:06:37.623637
5136	2020	توزيع أرباح نقدية	2002-02-13	2002-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-04-09 توزيع 5.0 SAR	2025-12-25 15:06:37.623956
5137	2180	توزيع أرباح نقدية	2002-02-12	2002-03-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-03-12 توزيع 5.0 SAR	2025-12-25 15:06:37.624337
5138	1040	توزيع أسهم خزينة كأسهم منحة	2002-03-07	2002-03-09	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 945,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:37.624843
5139	2090	توزيع أرباح نقدية	2002-03-03	2002-03-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.625289
5140	1080	توزيع أسهم خزينة كأسهم منحة	2002-01-21	2002-03-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,800,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:37.625723
5141	1080	توزيع أرباح نقدية	2002-01-21	2002-03-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.626178
5142	1010	توزيع أرباح نقدية	2002-01-20	2002-03-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-03-13 توزيع 15.0 SAR	2025-12-25 15:06:37.626643
5143	2050	توزيع أرباح نقدية	2002-02-10	2002-02-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.627097
5144	3080	توزيع أرباح نقدية	2002-02-16	2002-02-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-03-15 توزيع 15.0 SAR	2025-12-25 15:06:37.627547
5145	1040	توزيع أرباح نقدية	2002-01-28	2002-02-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-03-30 توزيع 20.0 SAR	2025-12-25 15:06:37.62799
5146	1090	توزيع أرباح نقدية	2002-01-29	2002-02-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-03-03 توزيع 14.5 SAR	2025-12-25 15:06:37.628411
5147	1030	توزيع أرباح نقدية	2002-01-23	2002-02-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-03-10 توزيع 8.0 SAR	2025-12-25 15:06:37.629092
5148	1060	توزيع أرباح نقدية	2002-01-16	2002-02-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-03-13 توزيع 9.0 SAR	2025-12-25 15:06:37.629561
5149	1120	توزيع أرباح نقدية	2002-01-28	2002-02-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-02-18 توزيع 28.0 SAR	2025-12-25 15:06:37.630018
5150	1050	توزيع أرباح نقدية	2002-01-22	2002-01-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-02-14 توزيع 14.0 SAR	2025-12-25 15:06:37.630491
5151	4110	تجزئة أسهم	2002-01-12	2002-01-26	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  3.0 مليون سهم إلى 6.0 مليون سهم	2025-12-25 15:06:37.630926
5152	4100	توزيع أرباح نقدية	2002-01-05	2002-01-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-01-21 توزيع 12.0 SAR	2025-12-25 15:06:37.631358
5153	4150	توزيع أرباح نقدية	2001-03-28	2002-01-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-02-23 توزيع 2.5 SAR	2025-12-25 15:06:37.631814
5154	4070	توزيع أرباح نقدية	2001-10-24	2001-12-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2002-01-10 توزيع 3.0 SAR	2025-12-25 15:06:37.632282
5155	4050	تخفيض رأس مال - بتخفيض عدد الأسهم	2001-11-24	2001-12-01	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:37.63276
5156	2080	توزيع أسهم خزينة كأسهم منحة	2001-08-26	2001-10-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:37.633287
5157	2030	توزيع أرباح نقدية	2001-08-02	2001-09-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-10-15 توزيع 5.0 SAR	2025-12-25 15:06:37.633809
5158	6040	توزيع أرباح نقدية	2001-08-21	2001-09-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-09-22 توزيع 2.5 SAR	2025-12-25 15:06:37.634321
5159	7201	تغيير اسم الشركة	2001-09-16	2001-09-16	\N	\N	\N	SAR	تم تعديل اسم الشركة من Arab Sea for Contracting إلى ASIS	2025-12-25 15:06:37.634871
5160	1090	توزيع أرباح نقدية	2001-07-09	2001-07-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.635388
5161	6070	توزيع أرباح نقدية	2001-04-01	2001-05-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-05-24 توزيع 2.5 SAR	2025-12-25 15:06:37.635894
5162	3060	توزيع أرباح نقدية	2001-04-28	2001-05-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.636403
5163	4040	توزيع أرباح نقدية	2001-04-02	2001-05-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-06-26 توزيع 2.5 SAR	2025-12-25 15:06:37.636867
5164	2160	توزيع أسهم خزينة كأسهم منحة	2001-03-22	2001-05-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 550,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:37.637324
5165	3090	توزيع أرباح نقدية	2001-04-01	2001-04-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-04-25 توزيع 3.0 SAR	2025-12-25 15:06:37.63779
5166	3010	توزيع أرباح نقدية	2001-04-01	2001-04-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.638264
5167	4140	توزيع أرباح نقدية	2001-03-18	2001-04-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-05-17 توزيع 2.0 SAR	2025-12-25 15:06:37.639091
5168	2050	توزيع أرباح نقدية	2001-03-21	2001-04-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.639553
5170	4020	توزيع أرباح نقدية	2001-03-26	2001-04-10	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-05-29 توزيع 4.5 SAR	2025-12-25 15:06:37.640541
5171	2070	توزيع أرباح نقدية	2001-02-20	2001-04-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-05-28 توزيع 5.0 SAR	2025-12-25 15:06:37.641137
5172	3050	توزيع أرباح نقدية	2001-02-26	2001-04-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.641562
5173	2180	توزيع أرباح نقدية	2001-03-20	2001-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-04-18 توزيع 4.0 SAR	2025-12-25 15:06:37.642018
5174	3080	توزيع أرباح نقدية	2001-03-19	2001-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-04-16 توزيع 14.0 SAR	2025-12-25 15:06:37.642472
5175	3040	توزيع أرباح نقدية	2001-02-27	2001-03-31	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.642898
5176	2090	توزيع أسهم خزينة كأسهم منحة	2001-02-12	2001-03-28	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:37.643315
5177	3030	توزيع أرباح نقدية	2001-02-27	2001-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.643764
5178	3020	توزيع أرباح نقدية	2001-02-21	2001-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.644196
5179	1040	توزيع أرباح نقدية	2001-01-31	2001-03-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.644617
5180	2090	توزيع أرباح نقدية	2001-02-12	2001-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.646034
5181	4010	توزيع أرباح نقدية	2001-02-27	2001-03-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-03-26 توزيع 3.0 SAR	2025-12-25 15:06:37.646479
5182	2020	توزيع أرباح نقدية	2001-03-11	2001-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.646924
5183	2020	توزيع أسهم خزينة كأسهم منحة	2001-02-10	2001-03-17	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 2,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:37.647362
5184	1080	توزيع أرباح نقدية	2001-01-19	2001-03-03	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.64779
5185	1050	توزيع أرباح نقدية	2001-02-01	2001-02-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-02-26 توزيع 11.25 SAR	2025-12-25 15:06:37.648342
5186	1120	توزيع أرباح نقدية	2001-02-12	2001-02-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.648678
5187	1090	توزيع أرباح نقدية	2001-02-04	2001-02-07	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.648972
5188	1010	توزيع أرباح نقدية	2001-01-25	2001-01-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-02-20 توزيع 10.0 SAR	2025-12-25 15:06:37.64925
5189	1030	توزيع أسهم خزينة كأسهم منحة	2000-11-20	2001-01-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,100,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:37.649567
5190	1030	توزيع أرباح نقدية	2000-11-20	2001-01-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-01-27 توزيع 5.0 SAR	2025-12-25 15:06:37.649898
5191	4100	توزيع أرباح نقدية	2000-10-28	2001-01-24	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2001-02-06 توزيع 12.0 SAR	2025-12-25 15:06:37.650234
5192	6040	توزيع أرباح نقدية	2000-04-26	2000-10-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-10-21 توزيع 2.5 SAR	2025-12-25 15:06:37.650538
5193	2030	توزيع أرباح نقدية	2000-09-09	2000-09-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-10-01 توزيع 5.0 SAR	2025-12-25 15:06:37.650857
5194	4170	توزيع أرباح نقدية	2000-07-24	2000-08-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-03-09 توزيع 2.5 SAR	2025-12-25 15:06:37.651155
5195	4090	توزيع أرباح نقدية	2000-04-01	2000-07-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-07-22 توزيع 1.88 SAR	2025-12-25 15:06:37.651459
5196	2100	تجزئة أسهم	2000-06-18	2000-06-24	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.0 مليون سهم إلى 4.0 مليون سهم	2025-12-25 15:06:37.651767
5197	2210	توزيع أرباح نقدية	2000-05-01	2000-05-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-05-27 توزيع 2.5 SAR	2025-12-25 15:06:37.652098
5198	2160	توزيع أسهم خزينة كأسهم منحة	2000-05-06	2000-05-20	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 400,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:37.652398
5199	4040	توزيع أرباح نقدية	2000-04-22	2000-05-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-08-12 توزيع 2.5 SAR	2025-12-25 15:06:37.652805
5200	3060	توزيع أرباح نقدية	2000-04-04	2000-05-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:37.65319
5201	2160	توزيع أرباح نقدية	2000-04-12	2000-05-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.276873
5202	4020	توزيع أرباح نقدية	2000-04-08	2000-05-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-06-03 توزيع 4.0 SAR	2025-12-25 15:06:38.27771
5203	2070	توزيع أرباح نقدية	2000-03-01	2000-04-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-05-06 توزيع 5.0 SAR	2025-12-25 15:06:38.278083
5204	3010	توزيع أرباح نقدية	2000-04-20	2000-04-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.278414
5205	2050	توزيع أرباح نقدية	2000-03-27	2000-04-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.278751
5206	4140	توزيع أرباح نقدية	2000-03-08	2000-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-05-20 توزيع 4.0 SAR	2025-12-25 15:06:38.279087
5207	3040	توزيع أرباح نقدية	2000-03-01	2000-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.279426
5208	6010	تجزئة أسهم	2000-04-11	2000-04-12	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.0 مليون سهم إلى 8.0 مليون سهم	2025-12-25 15:06:38.279755
5209	4010	توزيع أرباح نقدية	2000-03-08	2000-04-09	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-04-18 توزيع 3.75 SAR	2025-12-25 15:06:38.280075
5210	2140	توزيع أرباح نقدية	2000-03-08	2000-04-06	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-04-25 توزيع 2.5 SAR	2025-12-25 15:06:38.280404
5211	2080	توزيع أرباح نقدية	2000-03-12	2000-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.280694
5215	3030	توزيع أرباح نقدية	2000-02-26	2000-03-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.282134
5216	2020	توزيع أرباح نقدية	2000-02-26	2000-03-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.282655
5217	3080	توزيع أرباح نقدية	2000-02-28	2000-03-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.283243
5218	1030	توزيع أسهم خزينة كأسهم منحة	2000-02-17	2000-02-27	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.284155
5219	1030	توزيع أرباح نقدية	2000-02-17	2000-02-27	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.284935
5220	4100	توزيع أرباح نقدية	1999-12-08	2000-02-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-02-16 توزيع 12.0 SAR	2025-12-25 15:06:38.285487
5221	1040	توزيع أسهم خزينة كأسهم منحة	1999-12-28	2000-01-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.285982
5222	2180	توزيع أرباح نقدية	2000-01-26	2000-01-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 2000-04-29 توزيع 2.5 SAR	2025-12-25 15:06:38.286506
5223	2050	توزيع أسهم خزينة كأسهم منحة	1999-12-02	1999-12-22	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.287118
5224	1090	توزيع أسهم خزينة كأسهم منحة	1999-10-13	1999-11-13	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 4,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:38.287531
5225	2030	توزيع أرباح نقدية	1999-10-14	1999-10-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-10-16 توزيع 5.0 SAR	2025-12-25 15:06:38.287971
5226	4020	تجزئة أسهم	1999-08-11	1999-08-12	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.0 مليون سهم إلى 12.0 مليون سهم	2025-12-25 15:06:38.288327
5227	1090	زيادة رأس مال - اكتتاب خاص	1999-05-30	1999-07-04	\N	\N	\N	SAR	زيادة رأس المال من   2,400,000,000  الى 3,153,846,150  عن طريق الاكتتاب الخاص في 15,076,923 سهم كأسهم خيارات للموظفين 	2025-12-25 15:06:38.288734
5228	1090	الإندماج مع شركة	1999-01-06	1999-07-03	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من United Saudi Bank	2025-12-25 15:06:38.289126
5229	6010	توزيع أرباح نقدية	1999-06-15	1999-06-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-08-28 توزيع 5.0 SAR	2025-12-25 15:06:38.289442
5230	4040	توزيع أرباح نقدية	1999-06-01	1999-06-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-09-05 توزيع 3.25 SAR	2025-12-25 15:06:38.289774
5231	2210	توزيع أرباح نقدية	1999-05-23	1999-05-30	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.290056
5232	3060	توزيع أرباح نقدية	1999-04-18	1999-05-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.290355
5233	6070	توزيع أرباح نقدية	1999-03-17	1999-05-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-05-13 توزيع 2.5 SAR	2025-12-25 15:06:38.290725
5234	3080	تجزئة أسهم	1999-05-11	1999-05-12	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.45 مليون سهم إلى 12.9 مليون سهم	2025-12-25 15:06:38.291045
5235	2140	توزيع أرباح نقدية	1999-04-19	1999-05-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-05-12 توزيع 2.5 SAR	2025-12-25 15:06:38.291328
5236	2160	توزيع أرباح نقدية	1999-04-05	1999-05-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-06-01 توزيع 6.5 SAR	2025-12-25 15:06:38.291617
5237	6040	توزيع أرباح نقدية	1999-04-03	1999-05-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-05-01 توزيع 2.5 SAR	2025-12-25 15:06:38.29189
5238	4090	توزيع أرباح نقدية	1999-03-20	1999-04-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-05-15 توزيع 1.88 SAR	2025-12-25 15:06:38.292153
5239	3020	توزيع أرباح نقدية	1999-03-20	1999-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.292414
5240	4140	توزيع أرباح نقدية	1999-03-16	1999-04-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-04-18 توزيع 2.5 SAR	2025-12-25 15:06:38.29269
5241	3010	توزيع أرباح نقدية	1999-04-04	1999-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.292944
5242	2080	توزيع أرباح نقدية	1999-03-16	1999-04-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.293207
5243	4020	توزيع أرباح نقدية	1999-03-18	1999-04-13	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-05-15 توزيع 6.5 SAR	2025-12-25 15:06:38.293469
5244	2070	توزيع أرباح نقدية	1999-03-06	1999-04-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-04-24 توزيع 5.0 SAR	2025-12-25 15:06:38.293729
5245	2090	توزيع أرباح نقدية	1999-03-09	1999-04-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.293986
5246	3050	توزيع أرباح نقدية	1999-03-09	1999-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.294291
5247	3080	توزيع أرباح نقدية	1999-03-08	1999-04-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.294663
5248	2050	توزيع أرباح نقدية	1999-03-15	1999-03-24	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.295172
5249	3030	توزيع أرباح نقدية	1999-03-08	1999-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.295762
5250	3040	توزيع أرباح نقدية	1999-02-17	1999-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.296076
5251	2010	توزيع أرباح نقدية	1999-03-16	1999-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-04-18 توزيع 5.0 SAR	2025-12-25 15:06:38.296352
5252	2020	توزيع أرباح نقدية	1999-03-09	1999-03-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.296655
5253	6090	تجزئة أسهم	1998-05-11	1999-03-10	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.5 مليون سهم إلى 5.0 مليون سهم	2025-12-25 15:06:38.296939
5254	4010	توزيع أرباح نقدية	1999-02-17	1999-03-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-03-15 توزيع 3.5 SAR	2025-12-25 15:06:38.29722
5255	1030	توزيع أسهم خزينة كأسهم منحة	1999-02-17	1999-03-04	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.29749
5256	1030	توزيع أرباح نقدية	1999-02-17	1999-03-04	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.297764
5257	3090	تجزئة أسهم	1999-02-20	1999-02-21	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  7.0 مليون سهم إلى 14.0 مليون سهم	2025-12-25 15:06:38.298028
5258	4100	توزيع أرباح نقدية	1999-01-10	1999-02-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1999-02-27 توزيع 12.0 SAR	2025-12-25 15:06:38.298296
5259	6050	تجزئة أسهم	1999-02-02	1999-02-03	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.298696
5260	2050	زيادة رأس مال - اكتتاب خاص	1999-01-07	1999-01-03	\N	\N	\N	SAR	زيادة رأس المال من	2025-12-25 15:06:38.298979
5261	4040	تجزئة أسهم	1998-12-20	1998-12-26	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.0 مليون سهم إلى 20.0 مليون سهم	2025-12-25 15:06:38.299252
5262	4130	تجزئة أسهم	1998-12-14	1998-12-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  1.5 مليون سهم إلى 3.0 مليون سهم	2025-12-25 15:06:38.299544
5263	3020	تخفيض رأس مال - بتخفيض قيمة أسمية	1998-11-25	1998-12-13	\N	\N	\N	SAR	وافق المساهمون على تخفيض رأس المال إلى 450,000,000  عن طريق تخفيض القيمة الاسمية للسهم من 100 الى 50 	2025-12-25 15:06:38.299805
5264	2190	زيادة رأس مال - إصدار حقوق أولوية	1998-10-07	1998-11-24	\N	\N	\N	SAR	زياده راس المال من 59,000,000  الى 100,000,000  من خلال اصدار 820,000 سهم بسعر اصدار  50.0  لكل سهم	2025-12-25 15:06:38.300062
5265	4050	تجزئة أسهم	1998-11-08	1998-11-09	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.0 مليون سهم إلى 12.0 مليون سهم	2025-12-25 15:06:38.300346
5266	2170	تجزئة أسهم	1998-10-06	1998-10-07	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  1.73 مليون سهم إلى 3.46 مليون سهم	2025-12-25 15:06:38.30064
5267	4080	زيادة رأس المال - زيادة القيمة الاسمية	1998-09-24	1998-10-03	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى   250,000,000   عن طريق زيادة القيمة الاسمية للسهم من 90 الى 100	2025-12-25 15:06:38.300926
5268	4080	تجزئة أسهم	1998-09-24	1998-10-03	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.5 مليون سهم إلى 5.0 مليون سهم	2025-12-25 15:06:38.301208
5269	2030	توزيع أرباح نقدية	1998-09-05	1998-10-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-10-17 توزيع 15.0 SAR	2025-12-25 15:06:38.301491
5270	2110	تجزئة أسهم	1998-07-16	1998-08-22	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  5.0 مليون سهم إلى 10.0 مليون سهم	2025-12-25 15:06:38.301765
5271	2120	تجزئة أسهم	1998-08-04	1998-08-15	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  1.08 مليون سهم إلى 2.16 مليون سهم	2025-12-25 15:06:38.302073
5272	4030	تجزئة أسهم	1998-07-23	1998-07-25	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  20.0 مليون سهم إلى 40.0 مليون سهم	2025-12-25 15:06:38.302343
5273	6040	تجزئة أسهم	1998-07-07	1998-07-08	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.0 مليون سهم إلى 4.0 مليون سهم	2025-12-25 15:06:38.302637
5274	2080	تجزئة أسهم	1998-06-23	1998-07-02	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.30295
5275	2040	تجزئة أسهم	1998-06-25	1998-06-27	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  2.0 مليون سهم إلى 4.0 مليون سهم	2025-12-25 15:06:38.303301
5276	2040	زيادة رأس مال - إصدار حقوق أولوية	1998-05-14	1998-06-27	\N	\N	\N	SAR	زياده راس المال من 200,000,000  الى 250,000,000  من خلال اصدار 1,000,000 سهم بسعر اصدار  50.0  لكل سهم	2025-12-25 15:06:38.303636
5277	2130	تجزئة أسهم	1998-06-01	1998-06-24	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.0 مليون سهم إلى 8.0 مليون سهم	2025-12-25 15:06:38.303963
5278	2070	تجزئة أسهم	1998-06-18	1998-06-20	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  6.0 مليون سهم إلى 12.0 مليون سهم	2025-12-25 15:06:38.304298
5279	2170	توزيع أرباح نقدية	1998-06-14	1998-06-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-07-13 توزيع 5.0 SAR	2025-12-25 15:06:38.304623
5280	2110	توزيع أسهم خزينة كأسهم منحة	1997-02-20	1998-06-18	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:38.306636
5281	3060	تجزئة أسهم	1998-06-11	1998-06-13	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.5 مليون سهم إلى 21.0 مليون سهم	2025-12-25 15:06:38.306997
5282	4150	تجزئة أسهم	1998-06-11	1998-06-13	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.0 مليون سهم إلى 20.0 مليون سهم	2025-12-25 15:06:38.307359
5283	4010	تجزئة أسهم	1998-06-02	1998-06-03	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  5.0 مليون سهم إلى 10.0 مليون سهم	2025-12-25 15:06:38.307706
5284	2140	تجزئة أسهم	1998-05-27	1998-05-30	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  3.0 مليون سهم إلى 6.0 مليون سهم	2025-12-25 15:06:38.308085
5285	4040	توزيع أرباح نقدية	1998-04-29	1998-05-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-08-26 توزيع 7.0 SAR	2025-12-25 15:06:38.308424
5286	4140	تجزئة أسهم	1998-05-23	1998-05-24	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  0.72 مليون سهم إلى 1.44 مليون سهم	2025-12-25 15:06:38.308778
5287	1020	تجزئة أسهم	1998-05-21	1998-05-23	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.309099
5288	6070	توزيع أرباح نقدية	1998-03-31	1998-05-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-05-25 توزيع 5.0 SAR	2025-12-25 15:06:38.309421
5289	3060	توزيع أرباح نقدية	1998-03-30	1998-05-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-06-13 توزيع 10.0 SAR	2025-12-25 15:06:38.309744
5290	2160	توزيع أرباح نقدية	1998-04-18	1998-05-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-06-08 توزيع 5.0 SAR	2025-12-25 15:06:38.310137
5291	4090	توزيع أرباح نقدية	1998-03-31	1998-05-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-06-01 توزيع 1.88 SAR	2025-12-25 15:06:38.310515
5292	3020	توزيع أرباح نقدية	1998-03-04	1998-05-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.310859
5293	3040	تجزئة أسهم	1998-05-05	1998-05-06	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  4.5 مليون سهم إلى 9.0 مليون سهم	2025-12-25 15:06:38.311176
5294	2080	توزيع أرباح نقدية	1998-04-20	1998-05-02	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.311469
5295	1040	تجزئة أسهم	1998-04-26	1998-04-27	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.311762
5296	6040	توزيع أرباح نقدية	1998-03-03	1998-04-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-04-25 توزيع 5.0 SAR	2025-12-25 15:06:38.312058
5297	3050	تجزئة أسهم	1998-04-21	1998-04-22	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.5 مليون سهم إلى 21.0 مليون سهم	2025-12-25 15:06:38.31235
5298	4061	تجزئة أسهم	1998-03-24	1998-04-21	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  12.0 مليون سهم إلى 24.0 مليون سهم	2025-12-25 15:06:38.312634
5299	2070	توزيع أرباح نقدية	1998-03-18	1998-04-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-05-02 توزيع 8.0 SAR	2025-12-25 15:06:38.312921
5300	4140	توزيع أرباح نقدية	1998-03-19	1998-04-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-04-19 توزيع 10.0 SAR	2025-12-25 15:06:38.313245
5301	3030	توزيع أرباح نقدية	1998-02-26	1998-04-18	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.947366
5302	1010	تجزئة أسهم	1998-02-23	1998-04-14	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.949467
5303	3050	توزيع أرباح نقدية	1998-03-11	1998-04-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.949795
5304	3010	توزيع أرباح نقدية	1998-03-19	1998-04-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.950136
5305	1050	تجزئة أسهم	1998-03-30	1998-03-31	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.950435
5306	2010	تجزئة أسهم	1998-03-04	1998-03-29	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.950703
5307	2090	توزيع أرباح نقدية	1998-02-18	1998-03-28	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.950992
5308	2030	تجزئة أسهم	1998-03-25	1998-03-26	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  0.4 مليون سهم إلى 0.8 مليون سهم	2025-12-25 15:06:38.951352
5309	2050	تجزئة أسهم	1998-03-25	1998-03-26	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.95157
5310	2050	توزيع أسهم خزينة كأسهم منحة	1998-03-25	1998-03-26	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.951853
5311	2020	تجزئة أسهم	1998-03-24	1998-03-25	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  15.0 مليون سهم إلى 30.0 مليون سهم	2025-12-25 15:06:38.952139
5312	2020	توزيع أسهم خزينة كأسهم منحة	1998-03-24	1998-03-25	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,500,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:38.952347
5313	3080	توزيع أرباح نقدية	1998-03-03	1998-03-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-03-30 توزيع 30.0 SAR	2025-12-25 15:06:38.952752
5314	4010	توزيع أرباح نقدية	1998-03-10	1998-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-03-31 توزيع 8.0 SAR	2025-12-25 15:06:38.953017
5315	1080	تجزئة أسهم	1998-03-21	1998-03-22	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.953307
5316	1030	تجزئة أسهم	1998-01-10	1998-03-21	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.953997
5317	1030	توزيع أسهم خزينة كأسهم منحة	1998-01-10	1998-03-21	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.954363
5318	1090	تجزئة أسهم	1998-03-16	1998-03-17	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.954675
5319	2090	تجزئة أسهم	1998-03-16	1998-03-17	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.954973
5320	2050	توزيع أرباح نقدية	1998-03-07	1998-03-17	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.955205
5321	2020	توزيع أرباح نقدية	1998-03-01	1998-03-16	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.955455
5322	2010	توزيع أرباح نقدية	1998-03-04	1998-03-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.95572
5323	3030	توزيع أرباح نقدية	1998-02-17	1998-03-12	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.956004
5324	1060	تجزئة أسهم	1997-10-21	1998-03-11	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.956231
5325	1120	تجزئة أسهم	1998-03-09	1998-03-10	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:38.956469
5326	1120	توزيع أسهم خزينة كأسهم منحة	1998-03-09	1998-03-10	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.956759
5327	4100	توزيع أرباح نقدية	1997-12-20	1998-02-26	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-03-04 توزيع 12.0 SAR	2025-12-25 15:06:38.957022
5328	4020	توزيع أرباح نقدية	1998-02-14	1998-02-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-03-15 توزيع 7.5 SAR	2025-12-25 15:06:38.957361
5329	6010	توزيع أرباح نقدية	1997-11-03	1997-12-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1998-02-21 توزيع 7.0 SAR	2025-12-25 15:06:38.95765
5330	3030	تجزئة أسهم	1997-10-04	1997-11-25	\N	\N	\N	SAR	تم تخفيض القيمة الاسمية للسهم من100.0  to 50.0  وبناءا على ذلك تم زيادة عدد الأسهم من  10.2 مليون سهم إلى 20.4 مليون سهم	2025-12-25 15:06:38.957953
5331	2110	زيادة رأس مال - إصدار حقوق أولوية	1997-02-20	1997-11-01	\N	\N	\N	SAR	زياده راس المال من 300,000,000  الى 400,000,000  من خلال اصدار 1,000,000 سهم بسعر اصدار  100.0  لكل سهم	2025-12-25 15:06:38.958213
5332	6040	توزيع أرباح نقدية	1997-05-07	1997-08-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-08-17 توزيع 5.0 SAR	2025-12-25 15:06:38.958472
5333	2170	توزيع أرباح نقدية	1997-05-23	1997-06-16	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-06-30 توزيع 5.0 SAR	2025-12-25 15:06:38.958746
5334	6090	توزيع أرباح نقدية	1997-06-02	1997-05-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-07-09 توزيع 5.0 SAR	2025-12-25 15:06:38.959173
5335	4040	توزيع أرباح نقدية	1997-03-31	1997-05-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-06-25 توزيع 7.0 SAR	2025-12-25 15:06:38.959403
5336	4020	توزيع أرباح نقدية	1997-04-13	1997-05-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-05-08 توزيع 7.0 SAR	2025-12-25 15:06:38.959689
5337	2040	توزيع أسهم خزينة كأسهم منحة	1997-01-07	1997-05-06	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 200,000,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:38.959933
5338	4150	توزيع أرباح نقدية	1997-03-23	1997-05-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-06-21 توزيع 5.0 SAR	2025-12-25 15:06:38.960183
5339	6070	توزيع أرباح نقدية	1997-03-23	1997-05-03	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-05-10 توزيع 5.0 SAR	2025-12-25 15:06:38.960567
5340	2140	توزيع أرباح نقدية	1997-03-31	1997-04-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-06-10 توزيع 2.5 SAR	2025-12-25 15:06:38.960797
5341	2080	توزيع أرباح نقدية	1997-03-18	1997-04-26	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.961035
5342	2070	توزيع أرباح نقدية	1997-04-13	1997-04-15	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-04-15 توزيع 10.0 SAR	2025-12-25 15:06:38.961266
5343	3030	توزيع أرباح نقدية	1997-04-06	1997-04-08	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.961557
5344	3080	توزيع أرباح نقدية	1997-03-10	1997-04-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-04-07 توزيع 35.0 SAR	2025-12-25 15:06:38.961847
5345	4140	توزيع أرباح نقدية	1997-03-09	1997-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-04-08 توزيع 10.0 SAR	2025-12-25 15:06:38.962107
5346	3060	توزيع أرباح نقدية	1997-02-22	1997-03-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-04-05 توزيع 12.0 SAR	2025-12-25 15:06:38.962359
5347	4010	توزيع أرباح نقدية	1997-03-09	1997-03-29	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-04-06 توزيع 7.5 SAR	2025-12-25 15:06:38.962637
5348	2010	توزيع أرباح نقدية	1997-03-10	1997-03-22	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-04-01 توزيع 25.0 SAR	2025-12-25 15:06:38.963061
5349	1080	توزيع أسهم خزينة كأسهم منحة	1997-03-19	1997-03-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.963286
5350	2050	توزيع أرباح نقدية	1997-02-26	1997-03-19	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.963558
5351	2020	توزيع أرباح نقدية	1997-03-04	1997-03-17	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-03-30 توزيع 40.0 SAR	2025-12-25 15:06:38.963782
5352	3010	توزيع أرباح نقدية	1997-03-12	1997-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.964008
5353	3040	توزيع أرباح نقدية	1997-02-19	1997-03-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.964276
5354	3050	توزيع أرباح نقدية	1997-02-19	1997-03-11	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.964535
5355	3050	توزيع أسهم خزينة كأسهم منحة	1997-02-19	1997-03-11	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,050,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:38.964763
5356	2090	توزيع أرباح نقدية	1997-03-04	1997-03-05	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.965032
5357	3020	توزيع أرباح نقدية	1997-02-04	1997-03-01	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.967502
5358	4100	توزيع أرباح نقدية	1996-12-10	1997-03-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-04-07 توزيع 10.0 SAR	2025-12-25 15:06:38.967811
5359	1090	توزيع أرباح نقدية	1997-01-27	1997-02-04	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1997-02-24 توزيع 27.5 SAR	2025-12-25 15:06:38.968063
5360	6040	توزيع أرباح نقدية	1996-05-18	1996-12-25	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-12-28 توزيع 5.0 SAR	2025-12-25 15:06:38.968329
5361	2030	توزيع أرباح نقدية	1996-09-19	1996-09-28	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-10-12 توزيع 16.0 SAR	2025-12-25 15:06:38.968728
5362	6010	توزيع أرباح نقدية	1996-07-30	1996-07-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-08-19 توزيع 10.0 SAR	2025-12-25 15:06:38.969006
5363	2150	توزيع أسهم خزينة كأسهم منحة	1996-06-24	1996-06-27	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 187,500,000  عن طريق توزيع أسهم منحة بمقدار 0.0% من رأس المال 	2025-12-25 15:06:38.969284
5364	2150	زيادة رأس مال - إصدار حقوق أولوية	1996-06-24	1996-06-27	\N	\N	\N	SAR	زياده راس المال من 187,500,000  الى 200,000,000  من خلال اصدار 250,000 سهم بسعر اصدار  50.0  لكل سهم	2025-12-25 15:06:38.969517
5365	6050	توزيع أرباح نقدية	1996-06-25	1996-06-20	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.969747
5366	1030	توزيع أسهم خزينة كأسهم منحة	1996-05-05	1996-06-12	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 360,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:38.969956
5367	1030	زيادة رأس مال - إصدار حقوق أولوية	1996-05-05	1996-06-12	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:38.970579
5368	4090	توزيع أرباح نقدية	1996-04-14	1996-05-21	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-07-20 توزيع 1.88 SAR	2025-12-25 15:06:38.970836
5369	4020	توزيع أرباح نقدية	1996-05-18	1996-05-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-07-07 توزيع 6.0 SAR	2025-12-25 15:06:38.971052
5370	2080	توزيع أرباح نقدية	1996-03-19	1996-05-13	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.971272
5371	4040	توزيع أرباح نقدية	1996-04-15	1996-05-12	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-06-17 توزيع 7.0 SAR	2025-12-25 15:06:38.971488
5372	4010	توزيع أرباح نقدية	1996-04-06	1996-05-11	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-05-20 توزيع 7.0 SAR	2025-12-25 15:06:38.971811
5373	2050	توزيع أسهم خزينة كأسهم منحة	1996-04-18	1996-04-20	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:38.972098
5374	2040	توزيع أرباح نقدية	1996-04-01	1996-04-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-05-07 توزيع 20.0 SAR	2025-12-25 15:06:38.972413
5375	3030	توزيع أرباح نقدية	1996-03-19	1996-04-15	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.972719
5376	2050	توزيع أرباح نقدية	1996-04-02	1996-04-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.972984
5377	3040	توزيع أرباح نقدية	1996-03-09	1996-04-06	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.973285
5378	2020	توزيع أسهم خزينة كأسهم منحة	1996-03-02	1996-04-06	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 1,000,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:38.973534
5379	3080	توزيع أرباح نقدية	1996-03-06	1996-04-02	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-04-08 توزيع 35.0 SAR	2025-12-25 15:06:38.973796
5380	3060	توزيع أرباح نقدية	1996-04-14	1996-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-04-16 توزيع 12.0 SAR	2025-12-25 15:06:38.974051
5381	4140	توزيع أرباح نقدية	1996-03-19	1996-04-01	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-04-17 توزيع 10.0 SAR	2025-12-25 15:06:38.974326
5382	2010	توزيع أرباح نقدية	1996-03-18	1996-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-04-15 توزيع 30.0 SAR	2025-12-25 15:06:38.974586
5383	2020	توزيع أرباح نقدية	1996-03-06	1996-03-23	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-04-04 توزيع 50.0 SAR	2025-12-25 15:06:38.974872
5384	3050	توزيع أرباح نقدية	1996-03-05	1996-03-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.975102
5385	3010	توزيع أرباح نقدية	1996-04-16	1996-03-21	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.975352
5386	2090	توزيع أرباح نقدية	1996-03-13	1996-03-14	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.975566
5387	4100	توزيع أرباح نقدية	1996-03-06	1996-03-14	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-04-15 توزيع 7.0 SAR	2025-12-25 15:06:38.975861
5388	3020	توزيع أرباح نقدية	1996-02-07	1996-03-10	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.976157
5389	6010	توزيع أرباح نقدية	1996-02-27	1996-02-27	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1996-03-18 توزيع 7.0 SAR	2025-12-25 15:06:38.976424
5390	4180	استحواذ على شركة	1996-01-01	1996-01-01	\N	\N	\N	SAR	تمت الموافقة على اندماج الشركة مع Global jewelery (Marina B)	2025-12-25 15:06:38.976662
5391	4061	تغيير اسم الشركة	1995-09-11	1995-09-11	\N	\N	\N	SAR	تم تعديل اسم الشركة من Al Mawashi إلى Al Mawashi Al Mukairish	2025-12-25 15:06:38.97692
5392	2090	توزيع أسهم خزينة كأسهم منحة	1995-06-29	1995-07-02	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 144,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:38.977524
5393	6050	توزيع أرباح نقدية	1995-06-21	1995-06-22	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.977787
5394	4040	توزيع أرباح نقدية	1995-04-05	1995-05-20	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1995-06-24 توزيع 7.0 SAR	2025-12-25 15:06:38.978073
5395	2150	توزيع أرباح نقدية	1995-05-17	1995-05-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1995-06-17 توزيع 5.0 SAR	2025-12-25 15:06:38.978334
5396	3010	توزيع أرباح نقدية	1995-03-28	1995-04-25	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.978579
5397	3050	توزيع أرباح نقدية	1995-03-13	1995-04-23	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:38.978842
5398	4100	توزيع أرباح نقدية	1995-02-28	1995-03-30	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1995-04-29 توزيع 5.0 SAR	2025-12-25 15:06:38.979112
5399	1090	توزيع أرباح نقدية	1995-02-13	1995-02-19	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1995-02-19 توزيع 25.0 SAR	2025-12-25 15:06:38.979351
5400	4061	الإندماج مع شركة	1995-01-15	1995-01-15	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من Nasser Mohamed Al Mukairish and Partners for Real Estate Investment	2025-12-25 15:06:38.979602
5401	6040	توزيع أرباح نقدية	1994-11-26	1994-12-08	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1994-12-10 توزيع 5.0 SAR	2025-12-25 15:06:39.691734
5402	4070	زيادة رأس مال - إصدار حقوق أولوية	1994-07-06	1994-07-07	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.692598
5403	1030	توزيع أسهم خزينة كأسهم منحة	1994-06-12	1994-06-30	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 180,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:39.692938
5404	4110	توزيع أرباح نقدية	1994-06-06	1994-06-07	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1994-06-07 توزيع 5.0 SAR	2025-12-25 15:06:39.693249
5405	2110	توزيع أرباح نقدية	1994-04-19	1994-06-05	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1994-06-11 توزيع 5.0 SAR	2025-12-25 15:06:39.693576
5406	3040	توزيع أسهم خزينة كأسهم منحة	1994-05-30	1994-05-31	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.693872
5407	4010	توزيع أرباح نقدية	1994-04-02	1994-05-31	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1994-06-13 توزيع 7.0 SAR	2025-12-25 15:06:39.694171
5408	2070	توزيع أرباح نقدية	1994-04-04	1994-05-18	\N	\N	\N	SAR	قررت الجمعية العامة العادية في اجتماعها في 1994-06-30 توزيع 10.0 SAR	2025-12-25 15:06:39.69459
5409	1090	توزيع أسهم خزينة كأسهم منحة	1994-04-19	1994-05-11	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.694908
5410	1040	توزيع أسهم خزينة كأسهم منحة	1994-03-06	1994-03-12	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.695216
5411	2020	توزيع أسهم خزينة كأسهم منحة	1993-08-22	1993-08-23	\N	\N	\N	SAR	وافق المساهمون في اجتماعهم على زيادة رأس المال إلى 300,000,000  عن طريق توزيع أسهم منحة بمقدار 0.01% من رأس المال 	2025-12-25 15:06:39.695553
5412	2020	زيادة رأس مال - إصدار حقوق أولوية	1993-08-22	1993-08-23	\N	\N	\N	SAR	زياده راس المال من 300,000,000  الى 500,000,000  من خلال اصدار 2,000,000 سهم بسعر اصدار  100.0  لكل سهم	2025-12-25 15:06:39.695846
5413	1080	توزيع أسهم خزينة كأسهم منحة	1993-05-11	1993-05-12	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.696152
5414	1060	زيادة رأس مال - إصدار حقوق أولوية	1993-02-17	1993-02-18	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.69643
5415	1060	توزيع أسهم خزينة كأسهم منحة	1993-02-17	1993-02-18	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.697351
5416	9580	توزيع أسهم خزينة كأسهم منحة	2025-12-23	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.697766
5417	4292	توزيع أرباح نقدية	2025-12-16	\N	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:39.698116
5418	4291	توزيع أرباح نقدية	2025-10-27	\N	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:39.698443
5419	1213	زيادة رأس مال - إصدار حقوق أولوية	2025-10-23	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.698727
5420	9598	توزيع أرباح نقدية	2025-10-22	\N	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:39.699071
5421	9620	توزيع أسهم خزينة كأسهم منحة	2025-10-22	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.699351
5422	9610	زيادة رأس مال - اكتتاب خاص	2025-10-15	\N	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:39.699612
5423	9575	توزيع أسهم خزينة كأسهم منحة	2025-09-29	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.699881
5424	9601	توزيع أسهم خزينة كأسهم منحة	2025-09-29	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.700134
5425	9648	توزيع أرباح نقدية	2025-09-22	\N	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:39.700505
5426	9543	توزيع أسهم خزينة كأسهم منحة	2025-09-08	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.700792
5427	2380	زيادة رأس مال - اكتتاب خاص	2025-08-31	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.701055
5428	2380	تخفيض رأس مال - بتخفيض قيمة أسمية	2025-08-31	\N	\N	\N	\N	SAR	تخفيض رأس المال الى	2025-12-25 15:06:39.701366
5429	9632	توزيع أسهم خزينة كأسهم منحة	2025-08-26	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.701629
5430	9540	توزيع أسهم خزينة كأسهم منحة	2025-08-26	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.701908
5431	1214	توزيع أسهم خزينة كأسهم منحة	2025-08-21	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.702177
5432	1214	زيادة رأس مال - اكتتاب خاص	2025-08-21	\N	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:39.702458
5433	9633	توزيع أرباح نقدية	2025-08-19	\N	\N	\N	\N	SAR	المقسومات النقدية	2025-12-25 15:06:39.702723
5434	8050	زيادة رأس مال - اكتتاب خاص	2025-08-17	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.702977
5435	9546	توزيع أسهم خزينة كأسهم منحة	2025-08-13	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.703283
5436	4261	توزيع أسهم خزينة كأسهم منحة	2025-08-07	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.703573
5437	8150	زيادة رأس مال - اكتتاب خاص	2025-07-27	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.703853
5438	9606	زيادة رأس مال - اكتتاب خاص	2025-07-14	\N	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:39.70441
5439	1810	تخفيض رأس مال - بتخفيض عدد الأسهم	2025-06-19	\N	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:39.7047
5440	9561	توزيع أسهم خزينة كأسهم منحة	2025-06-11	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.705014
5441	4260	توزيع أسهم خزينة كأسهم منحة	2025-06-04	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.705291
5442	6012	زيادة رأس مال - إصدار حقوق أولوية	2025-05-29	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.70557
5443	7204	زيادة رأس مال - اكتتاب خاص	2025-04-30	\N	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:39.705851
5444	9606	زيادة رأس مال - اكتتاب خاص	2025-04-20	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.706179
5445	9537	توزيع أسهم خزينة كأسهم منحة	2025-04-13	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.706465
5446	9510	توزيع أسهم خزينة كأسهم منحة	2025-04-03	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.706748
5447	4083	توزيع أسهم خزينة كأسهم منحة	2025-03-24	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.707081
5448	6050	زيادة رأس مال - إصدار حقوق أولوية	2025-02-10	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.707375
5449	9539	توزيع أسهم خزينة كأسهم منحة	2025-01-16	\N	\N	\N	\N	SAR	توزيع أسهم منحة بنسبة	2025-12-25 15:06:39.707657
5450	9539	زيادة رأس مال - اكتتاب خاص	2025-01-16	\N	\N	\N	\N	SAR	تجميع السهم منحة بنسبة	2025-12-25 15:06:39.707931
5451	4061	زيادة رأس مال - إصدار حقوق أولوية	2025-01-05	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.708211
5452	1820	زيادة رأس مال - اكتتاب خاص	2024-12-29	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.708489
5453	8190	تخفيض رأس مال - بتخفيض عدد الأسهم	2024-12-09	\N	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:39.708771
5454	4270	زيادة رأس مال - اكتتاب خاص	2024-11-05	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.709057
5455	3003	زيادة رأس مال - اكتتاب خاص	2024-10-27	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.709334
5456	9553	زيادة رأس مال - إصدار حقوق أولوية	2024-10-13	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.709609
5457	4220	زيادة رأس مال - اكتتاب خاص	2024-09-08	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.709889
5458	2360	زيادة رأس مال - إصدار حقوق أولوية	2024-08-07	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.710163
5459	2110	زيادة رأس مال - إصدار حقوق أولوية	2024-05-09	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.710461
5460	4230	زيادة رأس مال - اكتتاب خاص	2024-04-01	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.710752
5461	4290	زيادة رأس مال - اكتتاب خاص	2024-03-31	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.711046
5462	2001	زيادة رأس مال - إصدار حقوق أولوية	2024-02-14	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.71136
5463	6013	زيادة رأس مال - إصدار حقوق أولوية	2024-01-03	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.711633
5464	4160	زيادة رأس مال - إصدار حقوق أولوية	2023-11-30	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.711893
5465	6060	تجزئة أسهم	2023-07-27	\N	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:39.712167
5466	4006	تجزئة أسهم	2023-07-23	\N	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:39.712423
5467	9510	تجزئة أسهم	2023-05-08	\N	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:39.712693
5468	9514	تجزئة أسهم	2023-04-27	\N	\N	\N	\N	SAR	تجزئة السهم	2025-12-25 15:06:39.71294
5469	6017	زيادة رأس مال - اكتتاب خاص	2022-11-30	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.713189
5470	7201	زيادة رأس مال - اكتتاب خاص	2022-09-04	\N	\N	\N	\N	SAR	زيادة رأس المال منة	2025-12-25 15:06:39.713495
5471	4230	زيادة رأس مال - إصدار حقوق أولوية	2022-04-14	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.713743
5472	4240	زيادة رأس مال - إصدار حقوق أولوية	2022-03-10	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.714
5473	8110	زيادة رأس مال - إصدار حقوق أولوية	2020-12-13	\N	\N	\N	\N	SAR	تجميع السهم	2025-12-25 15:06:39.714259
5474	8090	تخفيض رأس مال - بتخفيض عدد الأسهم	2016-05-16	\N	\N	\N	\N	SAR	تخفيض رأس المال من	2025-12-25 15:06:39.714515
5475	4280	توزيع أرباح نقدية	2013-02-01	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الرابع من عام 2012 بنسبة 1.25% من رأس المال بواقع 0.125 ريال للسهم 	2025-12-25 15:06:39.714769
5476	4280	توزيع أرباح نقدية	2012-11-01	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثالث من عام 2012 بنسبة 1.25% من رأس المال بواقع 0.125 ريال للسهم 	2025-12-25 15:06:39.715238
5477	4090	توزيع أرباح نقدية	2012-10-31	\N	\N	\N	\N	SAR	أقر مجلس إدارة الشركة في 31-03-2012 توزيع أرباح نقدية عن الربع الثالث من عام 2012 بنسبة 2.5% من رأس المال بواقع 0.25 ريال للسهم.	2025-12-25 15:06:39.715507
5478	3003	إدراج الشركة	2012-10-13	\N	\N	\N	\N	SAR	إدراج الشركة في سوق الأسهم السعودية	2025-12-25 15:06:39.715794
5479	3090	توزيع أرباح نقدية	2012-09-18	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 9% عن النصف الأول 2012	2025-12-25 15:06:39.716064
5480	4010	توزيع أرباح نقدية	2012-09-04	\N	\N	\N	\N	SAR	توزيع أرباح نقدية عن النصف الأول من 2012	2025-12-25 15:06:39.716333
5481	4100	توزيع أرباح نقدية	2012-09-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-07-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 20% من رأس المال (أو من القيمة الاسمية) بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:39.71661
5482	6002	توزيع أرباح نقدية	2012-08-29	\N	\N	\N	\N	SAR	توزيع ارباح نقدية بواقع 1.75 ريال للسهم عن النصف الاول من 2012	2025-12-25 15:06:39.716872
5483	2240	توزيع أرباح نقدية	2012-08-14	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 7.5% عن النصف الأول 2012	2025-12-25 15:06:39.717131
5484	2010	توزيع أرباح نقدية	2012-08-13	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 20% عن النصف الأول من عام 2012	2025-12-25 15:06:39.717434
5485	2050	توزيع أرباح نقدية	2012-08-11	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 3% عن الربع الثاني 2012 	2025-12-25 15:06:39.717703
5486	2020	توزيع أرباح نقدية	2012-08-11	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 60% عن النصف الأول 2012	2025-12-25 15:06:39.717954
5487	4190	توزيع أرباح نقدية	2012-08-08	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بواقع ( 1.4 ) ريال  عن الربع الثاني 2012	2025-12-25 15:06:39.718205
5488	7010	توزيع أرباح نقدية	2012-08-08	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 5% عن الربع الثاني 2012	2025-12-25 15:06:39.718481
5489	4150	توزيع أرباح نقدية	2012-08-08	\N	\N	\N	\N	SAR	توزيع أرباح نقدية عن النصف الأول من 2012	2025-12-25 15:06:39.718734
5490	1090	توزيع أرباح نقدية	2012-08-04	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 8% عن النصف الأول من عام 2012	2025-12-25 15:06:39.71903
5491	4280	توزيع أرباح نقدية	2012-07-31	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثاني من عام 2012 بنسبة 1.25% من رأس المال بواقع 0.125 ريال للسهم 	2025-12-25 15:06:39.719329
5492	7020	توزيع أرباح نقدية	2012-07-31	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 10% عن الربع الثاني من 2012	2025-12-25 15:06:39.719618
5493	7030	زيادة رأس مال - إصدار حقوق أولوية	2012-07-28	\N	\N	\N	\N	SAR	تمت الموافقة على زيادة رأس مال الشركة عن طريق إصدار أسهم حقوق أولوية بقيمة 6 مليار ريال	2025-12-25 15:06:39.71992
5494	3050	توزيع أرباح نقدية	2012-07-28	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 30% عن النصف الأول من عام 2012	2025-12-25 15:06:39.720212
5495	1010	توزيع أرباح نقدية	2012-07-23	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2012 بنسبة 6.5% من رأس المال بواقع 0.65 ريال للسهم.	2025-12-25 15:06:39.720512
5496	1120	توزيع أرباح نقدية	2012-07-23	\N	\N	\N	\N	SAR	توزيع أرباح نقدية بنسبة 12.5% عن النصف الأول من عام 2012 بواقع 1.25 ريال للسهم.	2025-12-25 15:06:39.720805
5497	3020	توزيع أرباح نقدية	2012-07-21	\N	\N	\N	\N	SAR	وافق مجلس إدارة الشركة على توزيع أرباح نقدية عن النصف الأول 2012 بواقع 1.5 ريال للسهم	2025-12-25 15:06:39.721108
5498	3010	توزيع أرباح نقدية	2012-07-21	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2012 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:39.721406
5499	2330	توزيع أرباح نقدية	2012-07-21	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2012 بنسبة 10% من رأس المال بواقع 1 ريال للسهم.\r\n\r\n\r\n\r\n	2025-12-25 15:06:39.721682
5500	2230	توزيع أرباح نقدية	2012-07-17	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 04-07-2012 على توزيع أرباح نقدية عن الربع الرابع من عام 2011 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم 	2025-12-25 15:06:39.722007
5501	2270	توزيع أرباح نقدية	2012-07-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 25 يونيو 2012 على توزيع أرباح نقدية بنسبة 30% من رأس المال بواقع 3 ريال للسهم.	2025-12-25 15:06:40.502313
5502	3030	توزيع أرباح نقدية	2012-07-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2012 بنسبة 35% من رأس المال بواقع 3.5 ريال للسهم	2025-12-25 15:06:40.503065
5503	4090	توزيع أرباح نقدية	2012-07-14	\N	\N	\N	\N	SAR	أقر مجلس إدارة الشركة في 31-03-2012 توزيع أرباح نقدية عن الربع الثاني من عام 2012 بنسبة 2.5% من رأس المال بواقع 0.25 ريال للسهم.	2025-12-25 15:06:40.503517
5504	6004	إدراج الشركة	2012-07-09	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من 09 يوليو 2012	2025-12-25 15:06:40.503914
5505	7030	تخفيض رأس مال - بتخفيض عدد الأسهم	2012-07-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 04-07-2012 على تخفيض رأس المال إلى 4.801 مليار ريال ليصبح عدد أسهم الشركة 480.1 مليون سهم.\r\n	2025-12-25 15:06:40.504336
5506	6004	بيع جزء من الشركة	2012-07-04	\N	\N	\N	\N	SAR	وافقت هيئة السوق المالية على طرح 24.6 مليون سهم من أسهم الشركة للاكتتاب العام 	2025-12-25 15:06:40.504929
5507	1212	توزيع أرباح نقدية	2012-06-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 28-05-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 17.5% من رأس المال بواقع 1.75 ريال للسهم \r\n\r\n\r\n\r\n	2025-12-25 15:06:40.568741
5508	6021	إدراج الشركة	2012-06-24	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم الاحد 04/08/1433 هـ الموافق 24/06/2012 م\r\n	2025-12-25 15:06:40.569357
5509	3091	توزيع أرباح نقدية	2012-06-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة الشركة على توزيع 5% من رأس المال بواقع (0.50) ريال عن كل سهم، عن  الربع الأول لعام 2012م 	2025-12-25 15:06:40.569814
5510	2200	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-06-12	\N	\N	\N	\N	SAR	قررت الجمعية العامة المنعقدة في 11-06-2012 زيادة رأس مال الشركة عن طريق منح سهم مجاني مقابل كل (3.7058) سهم لتصبح عدد الأسهم بعد الزيادة 40 مليون سهم بدلا من 31.5 مليون سهم.	2025-12-25 15:06:40.570205
5511	8190	توزيع أرباح نقدية	2012-06-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 14-05-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 10% من رأس المال بواقع 1 ريال للسهم	2025-12-25 15:06:40.570647
5512	1810	إدراج الشركة	2012-06-04	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من 04-06-2012\r\n	2025-12-25 15:06:40.571006
5513	1330	توزيع أرباح نقدية	2012-06-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 09-05-2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:40.571393
5514	1810	بيع جزء من الشركة	2012-06-02	\N	\N	\N	\N	SAR	قامت الشركة بطرح 30% من أسهمها للاكتتاب العام. \r\n	2025-12-25 15:06:40.571738
5515	4080	توزيع أرباح نقدية	2012-05-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 14-05-2012 على توزيع أرباح نقدية بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم	2025-12-25 15:06:40.572105
5516	4260	شراء نسبة من شركة	2012-05-30	\N	\N	\N	\N	SAR	قامت الشركة بشراء 32.5% من شركة ترانزليس القابضة الهندية المحدودة\r\n	2025-12-25 15:06:40.572461
5517	6002	توزيع أرباح نقدية	2012-05-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 29-04-2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بواقع 1.5 ريال للسهم 	2025-12-25 15:06:40.572808
5518	2070	توزيع أرباح نقدية	2012-05-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 25 أبريل 2012 على توزيع ارباح للمساهمين بنسبة (20%) من رأس المال عن عام 2011 بمعدل 2 ريال للسهم الواحد.	2025-12-25 15:06:40.57315
5519	1210	توزيع أرباح نقدية	2012-05-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 01/05/2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:40.573569
5520	4260	توزيع أرباح نقدية	2012-05-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18 ابريل 2012 على توزيع أرباح نقدية بنسبة 25% من رأس المال بواقع (2.5) ريال للسهم.	2025-12-25 15:06:40.573927
5521	1330	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-05-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 09-05-2012 على زيادة رأس المال إلى 531,250,000 ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل  4 أسهم\r\n	2025-12-25 15:06:40.574468
5522	2030	توزيع أرباح نقدية	2012-05-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 15-04-2012  على توزيع أرباح نقدية عن عام 2011  بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.50 ريال للسهم \r\n	2025-12-25 15:06:40.574802
5523	2150	توزيع أرباح نقدية	2012-05-12	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 21 أبريل 2012 على توزيع ارباح للمساهمين بنسبة (22.5%) من رأس المال عن عام 2011 بمعدل (2,25) ريال للسهم الواحد.	2025-12-25 15:06:40.57514
5524	3002	إدراج الشركة	2012-05-12	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من 12-05-2012	2025-12-25 15:06:40.57547
5525	7010	توزيع أرباح نقدية	2012-05-09	\N	\N	\N	\N	SAR	أقر مجلس إدارة الشركة في 18-04-2012  توزيع أرباح نقدية عن الربع الأول 2012 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم.\r\n	2025-12-25 15:06:40.575794
5526	4190	توزيع أرباح نقدية	2012-05-09	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الأول من عام 2012 بنسبة 22% من رأس المال بواقع 2.2 ريال للسهم 	2025-12-25 15:06:40.576118
5527	6040	توزيع أرباح نقدية	2012-05-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 10-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:40.576449
5528	4030	توزيع أرباح نقدية	2012-05-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 22-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 5% من رأس المال بواقع 0.5 ريال للسهم	2025-12-25 15:06:40.576771
5529	2360	توزيع أرباح نقدية	2012-05-09	\N	\N	\N	\N	SAR	وافق مجلس الإدارة في 04-04-2012 على توزيع أرباح نقدية عن الربع الأول من عام 2012 بنسبة 12.5% من رأس المال بواقع 1.25 ريال 	2025-12-25 15:06:40.577116
5530	4280	توزيع أرباح نقدية	2012-05-09	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الأول من عام 2012 بنسبة 1.25% من رأس المال بواقع 0.125ريال للسهم \r\n\r\n	2025-12-25 15:06:40.577435
5632	2230	توزيع أرباح نقدية	2011-12-28	\N	\N	\N	\N	SAR	وافق مجلس الادارة على توزيع أرباح نقدية بواقع 2 ريال للسهم عن الربع الثالث 2011	2025-12-25 15:06:41.529366
5531	7020	توزيع أرباح نقدية	2012-05-08	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الأول من عام 2012  بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 1 ريال للسهم.\r\n	2025-12-25 15:06:40.577706
5532	6070	توزيع أرباح نقدية	2012-05-06	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-04-2012  على توزيع أرباح نقدية عن عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:40.578043
5533	3002	بيع جزء من الشركة	2012-05-06	\N	\N	\N	\N	SAR	قامت الشركة بطرح 50% من أسهمها للاكتتاب العام. \r\n	2025-12-25 15:06:40.643318
5534	2050	توزيع أرباح نقدية	2012-05-05	\N	\N	\N	\N	SAR	وافق مجلس الإدارة المنعقد في 17 ابريل 2012 على توزيع أرباح نقدية عن الربع الأول من عام 2012 بنسبة 3% 	2025-12-25 15:06:40.666092
5535	1201	توزيع أرباح نقدية	2012-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-04-2012 على توزيع أرباح نقدية عن عام 2011  بنسبة 13.5% من رأس المال (أو من القيمة الاسمية) بواقع 1.35 ريال للسهم \r\n	2025-12-25 15:06:40.666946
5536	4003	توزيع أرباح نقدية	2012-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 25% من رأس المال بواقع (2.5) ريال للسهم الواحد.\r\n	2025-12-25 15:06:40.667405
5537	6010	توزيع أرباح نقدية	2012-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 31-03-2012 على توزيع أرباح نقدية عن عام 2011  بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم \r\n	2025-12-25 15:06:40.668598
5538	2180	توزيع أرباح نقدية	2012-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 11-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:40.669143
5539	2090	توزيع أرباح نقدية	2012-04-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 01-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 12% من رأس المال (أو من القيمة الاسمية) بواقع 1.2 ريال للسهم \r\n	2025-12-25 15:06:40.669597
5540	3090	توزيع أرباح نقدية	2012-04-29	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 17 أبريل 2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم.	2025-12-25 15:06:40.670017
5541	2050	توزيع أرباح نقدية	2012-04-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 17-04-2012 على توزيع أرباح نقدية عن الربع الرابع من عام 2011 بنسبة 5.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.55 ريال للسهم \r\n	2025-12-25 15:06:40.670419
5542	4230	توزيع أرباح نقدية	2012-04-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:40.670796
5543	2220	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 24-04-2012 على زيادة رأس المال إلى 281,120,890 مليون ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل 10 سهم	2025-12-25 15:06:40.67125
5544	2020	توزيع أرباح نقدية	2012-04-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 11-04-2012  على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 70% من رأس المال بواقع 7 ريالات للسهم \r\n	2025-12-25 15:06:40.671588
5545	4010	توزيع أرباح نقدية	2012-04-24	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 08-04-2012  على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بواقع 0.69. ريال للسهم \r\n	2025-12-25 15:06:40.671906
5546	2040	توزيع أرباح نقدية	2012-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 09-04-2012  على توزيع أرباح نقدية عن عام 2011 بنسبة 35% من رأس المال بواقع 3.5 ريال للسهم 	2025-12-25 15:06:40.672198
5547	4040	توزيع أرباح نقدية	2012-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 1 ابريل 2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 5% من رأس المال بواقع 0.50 ريال للسهم	2025-12-25 15:06:40.672493
5548	2250	توزيع أرباح نقدية	2012-04-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 08 أبريل 2012 على توزيع أرباح نقدية بنسبة 10% من رأس المال بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:40.672779
5549	2340	توزيع أرباح نقدية	2012-04-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 25-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم 	2025-12-25 15:06:40.673073
5550	2010	توزيع أرباح نقدية	2012-04-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 14 ابريل 2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 30% من رأس المال بواقع 3 ريال للسهم.	2025-12-25 15:06:40.673356
5551	4140	توزيع أرباح نقدية	2012-04-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 02-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 5% من رأس المال بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:40.673647
5552	4260	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-04-2012 على زيادة رأس المال إلى 244 مليون ريال من خلال توزيع أسهم منحة بنسبة 33.3% من رأس المال\r\n	2025-12-25 15:06:40.673944
5553	4230	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-04-2012 على زيادة رأس المال إلى 400 مليون ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل 3 سهم\r\n	2025-12-25 15:06:40.674375
5554	4002	توزيع أرباح نقدية	2012-04-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 02-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 30% من رأس المال بواقع 3 ريال للسهم 	2025-12-25 15:06:40.674877
5664	1320	شراء نسبة من شركة	2011-08-17	\N	\N	\N	\N	SAR	قامت الشركة بشراء 20% من شركة التطوير الكيميائي \r\n	2025-12-25 15:06:41.546819
5555	2320	توزيع أرباح نقدية	2012-04-19	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 03-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم	2025-12-25 15:06:40.675049
5556	2240	توزيع أرباح نقدية	2012-04-18	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 08-04-2012  على توزيع أرباح نقدية عن النصف الثاني من عام 2011  بنسبة 7.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.75 ريال للسهم \r\n	2025-12-25 15:06:40.71848
5557	2060	توزيع أرباح نقدية	2012-04-18	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 4 ابريل 2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم 	2025-12-25 15:06:40.718879
5558	3010	توزيع أرباح نقدية	2012-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 01-04-2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 20% من رأس المال (أو من القيمة الاسمية) بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:40.719219
5559	4020	توزيع أرباح نقدية	2012-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 01-04-2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 5% من رأس المال  بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:40.719543
5560	2080	توزيع أرباح نقدية	2012-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 26-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 10% من رأس المال  بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:40.741333
5561	6001	توزيع أرباح نقدية	2012-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 02-04-2012  على توزيع أرباح نقدية عن عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم 	2025-12-25 15:06:40.741774
5562	2300	توزيع أرباح نقدية	2012-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 02-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 17.5% من رأس المال بواقع 1.75 ريال للسهم 	2025-12-25 15:06:40.742123
5563	8030	توزيع أرباح نقدية	2012-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 31-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 20% من رأس المال (أو من القيمة الاسمية) بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:40.742447
5564	6021	بيع جزء من الشركة	2012-04-15	\N	\N	\N	\N	SAR	وافقت هيئة السوق المالية على طرح 6 مليون سهم من أسهم الشركة للإكتتاب العام 	2025-12-25 15:06:40.742751
5565	2360	توزيع أرباح نقدية	2012-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 04-04-2012  على توزيع أرباح نقدية عن عام 2011 بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:40.743087
5566	4090	توزيع أرباح نقدية	2012-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 31-03-2012 على توزيع أرباح نقدية إضافية عن عام 2011 بنسبة 2.5% من رأس المال بواقع 0.25 ريال للسهم \r\n	2025-12-25 15:06:40.743416
5567	5110	توزيع أرباح نقدية	2012-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 2 أبريل 2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 7% من رأس المال بواقع 0.7 ريال للسهم 	2025-12-25 15:06:40.743743
5568	4090	توزيع أرباح نقدية	2012-04-14	\N	\N	\N	\N	SAR	أقر مجلس إدارة الشركة في 15-02-2012 على توزيع أرباح نقدية عن الربع الأول من عام 2012 بنسبة 2.5% من رأس المال بواقع 0.25 ريال للسهم \r\n	2025-12-25 15:06:40.744076
5569	1020	توزيع أرباح نقدية	2012-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 04-04-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة5% من رأس المال بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:40.749309
5570	2280	توزيع أرباح نقدية	2012-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 02-04-2012 على توزيع أرباح نقدية عن عام  2011 بنسبة 22.5% من رأس المال بواقع 2.25 ريال للسهم \r\n	2025-12-25 15:06:40.749899
5571	7010	توزيع أرباح نقدية	2012-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 03-04-2012 على توزيع أرباح نقدية عن الربع الرابع 2011 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم.\r\n	2025-12-25 15:06:40.750284
5572	2040	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 09-04-2012  على زيادة رأس المال إلى 375 مليون ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل  سهمين\r\n	2025-12-25 15:06:40.750632
5573	4200	توزيع أرباح نقدية	2012-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 10 مارس 2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم.\r\n	2025-12-25 15:06:40.750976
5574	7040	زيادة رأس مال - إصدار حقوق أولوية	2012-04-08	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 1.575 مليار ريال من خلال إصدار أسهم حقوق أولوية	2025-12-25 15:06:40.751477
5575	1050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-08	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 07-04-2012 على زيادة رأس المال إلى  9040178750 ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل  4 أسهم\r\n	2025-12-25 15:06:40.751847
5576	4003	تأسيس شركة	2012-04-07	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس  الشركة المتحدة للإلكترونيات "اكسترا" في سلطنة عمان \r\n	2025-12-25 15:06:40.752295
5577	3040	توزيع أرباح نقدية	2012-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 21-03-2012 على توزيع أرباح نقدية  عن النصف الثاني من عام 2011  بنسبة 35% من رأس المال بواقع 3.5 ريال للسهم \r\n	2025-12-25 15:06:40.752815
5578	1090	توزيع أرباح نقدية	2012-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 26-03-2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 8.5% من رأس المال بواقع 0.85 ريال للسهم \r\n	2025-12-25 15:06:40.753175
5579	2060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 4 ابريل 2012 على زيادة رأس المال إلى 6,689,141,660 ريال من خلال توزيع أسهم منحة بواقع سهم لكل 5 أسهم عن عام 2011\r\n	2025-12-25 15:06:40.753591
5580	4180	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 04-04-2012  على زيادة رأس المال إلى 550 مليون ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل  10 سهم\r\n	2025-12-25 15:06:40.753965
5581	1320	توزيع أرباح نقدية	2012-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 19-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم.	2025-12-25 15:06:40.754375
5582	1301	توزيع أرباح نقدية	2012-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 21-03-2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 10% من رأس المال بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:40.754708
5583	2280	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 02-04-2012 على زيادة رأس المال إلى 4000 مليون ريال من خلال توزيع أسهم منحة بنسبة 73.9% من رأس المال\r\n	2025-12-25 15:06:40.754973
5584	4002	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 02-04-2012 على زيادة رأس المال إلى 500 مليون ريال من خلال توزيع أسهم منحة بنسبة 100% من رأس المال	2025-12-25 15:06:40.755253
5585	2300	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 02-04-2012 على زيادة رأس المال إلى 375 مليون ريال من خلال توزيع أسهم منحة بنسبة 25% من رأس المال\r\n	2025-12-25 15:06:40.755564
5586	2310	توزيع أرباح نقدية	2012-04-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 20-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 12.5% من رأس المال بواقع 1.25 ريال للسهم \r\n	2025-12-25 15:06:40.820368
5587	2050	زيادة حصة الشركة فى شركة تابعة	2012-04-02	\N	\N	\N	\N	SAR	قامت الشركة بزيادة حصتها في الشركة المصرية المتحدة للسكر إلى 56.86%	2025-12-25 15:06:40.820823
5588	2050	زيادة حصة الشركة فى شركة تابعة	2012-04-02	\N	\N	\N	\N	SAR	قامت الشركة بزيادة حصتها في الشركة المتحدة للسكر بالمملكة العربية السعودية  إلى 74.48%	2025-12-25 15:06:40.82119
5589	7020	توزيع أرباح نقدية	2012-04-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 11-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم.\r\n	2025-12-25 15:06:40.821548
5590	1080	توزيع أرباح نقدية	2012-04-01	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 18 مارس 2012  على توزيع أرباح عن عام 2011م على المُساهمين بنسبة 10% من قيمة السهم الاسميَّة للسهم.	2025-12-25 15:06:40.821871
5591	3050	توزيع أرباح نقدية	2012-03-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 20-03-2012 على توزيع أرباح نقدية عن  النصف الثاني من عام 2011  بنسبة 35% من رأس المال  بواقع 3.5 ريال للسهم \r\n	2025-12-25 15:06:40.822206
5592	1060	اصدار صكوك	2012-03-28	\N	\N	\N	\N	SAR	قامت الشركة باصدار صكوك بقيمة(1.5) مليار ريال سعودي مدته 5 سنوات، والعائد المتوقع على الصكوك سيكون: نسبة المؤشر سايبور + 1.2 % 	2025-12-25 15:06:40.822514
5593	5110	اصدار صكوك	2012-03-28	\N	\N	\N	\N	SAR	قامت الشركة باصدار صكوك بقيمة 1750 مليون دولار أمريكي. ويشتمل الإصدار على شريحتين من شهادات الصكوك:\r\nالأولى بقيمة 500 مليون دولار تستحق بعد خمس سنوات بعائد ثابت نسبته 2.665%.\r\nوالثانية بقيمة 1250 مليون دولار وتستحق بعد عشر سنوات بعائد ثابت نسبته 4.211%.	2025-12-25 15:06:40.822847
5594	3080	توزيع أرباح نقدية	2012-03-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18 مارس 2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 35% من رأس المال بواقع 3.50 ريال للسهم 	2025-12-25 15:06:40.82317
5595	2280	زيادة حصة الشركة فى شركة تابعة	2012-03-28	\N	\N	\N	\N	SAR	قامت الشركة بزيادة حصتها في شركة  الألبان والعصائر العالمية إلى 52%	2025-12-25 15:06:40.823487
5596	4150	توزيع أرباح نقدية	2012-03-27	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 06-03-2012 على توزيع ارباح نقدية بنسبة (12.5%) من رأس المال عن عام 2011 بمعدل (1.25) ريال للسهم .\r\n\r\n	2025-12-25 15:06:40.823868
5597	3030	توزيع أرباح نقدية	2012-03-27	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 14-03-2012 على توزيع أرباح نقدية عن النصف الثاني من عام 2011 بنسبة 45% من رأس المال (أو من القيمة الاسمية) بواقع 4.5 ريال للسهم \r\n	2025-12-25 15:06:40.824227
5598	1040	توزيع أرباح نقدية	2012-03-27	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-03-2012 على توزيع أرباح نقدية عن عام 2011  بنسبة 10% من القيمة الاسمية بواقع 1 ريال للسهم 	2025-12-25 15:06:40.824614
5599	1010	توزيع أرباح نقدية	2012-03-26	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 19-03-2012 على توزيع أرباح نقدية عن  النصف الثاني من عام 2011 بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم \r\n	2025-12-25 15:06:40.824934
5600	1030	توزيع أرباح نقدية	2012-03-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 5% من القيمة الاسمية بواقع 0.5 ريال للسهم \r\n\r\n	2025-12-25 15:06:40.825259
5601	4270	توزيع أرباح نقدية	2012-03-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 11/4/1433هـ الموافق 4/3/2012م على توزيع أرباح نقدية عن عام 2011 بنسبة 5% من رأس المال بواقع 0.5 ريال للسهم	2025-12-25 15:06:41.511368
5602	4210	توزيع أرباح نقدية	2012-03-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 05-03-2012 على توزيع أرباح نقدية عن عام 2011م بنسبة (10%) من رأس المال بواقع (1) ريال للسهم.	2025-12-25 15:06:41.520212
5603	4260	تأسيس شركة	2012-03-25	\N	\N	\N	\N	SAR	  قامت الشركة بتأسيس شركة الجذور الراسخة للنقليات المحدودة بنسبة استحواذ 95% 	2025-12-25 15:06:41.520633
5665	1301	بيع جزء من الشركة	2011-08-16	\N	\N	\N	\N	SAR	قامت الشركة بطرح 30% من أسهمها للاكتتاب العام بما يعادل 9.750 مليون سهم. \r\n	2025-12-25 15:06:41.547072
5604	3060	توزيع أرباح نقدية	2012-03-24	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 7 مارس 2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 25% من رأس المال بواقع 2.5 ريال للسهم.	2025-12-25 15:06:41.520946
5605	2070	استحواذ على شركة	2012-03-22	\N	\N	\N	\N	SAR	أعلنت الشركة الاستحواذ على حصة إستراتيجية تبلغ 48% من شركة إيرجن فارما لمتد EirGen Pharma Ltd الأيرلندية وبلغت قيمة الصفقة 19 مليون يورو ( ما يعادل 93 مليون ريـال سعودي) بتمويل ذاتي. \r\n	2025-12-25 15:06:41.521854
5606	1060	توزيع أرباح نقدية	2012-03-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 13 مارس 2012 على توزيع أرباح نقدية عن عام 2011  بواقع 65 هللة للسهم.	2025-12-25 15:06:41.522241
5607	1040	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-03-19	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18-03-2012 على زيادة رأس المال إلى 3969 مليون ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل 5 أسهم	2025-12-25 15:06:41.522545
5608	8010	توزيع أرباح نقدية	2012-03-17	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 12-03-2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 35% من القيمة الاسمية بواقع 3.5 ريال للسهم.	2025-12-25 15:06:41.522861
5609	2330	توزيع أرباح نقدية	2012-03-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن النصف الثاني 2011 بنسبة 10% من رأس المال بواقع 1 ريال للسهم.	2025-12-25 15:06:41.523218
5610	1060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-03-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 13-03-2012 على زيادة رأس المال إلى 10 مليار ريال من خلال توزيع أسهم منحة بواقع سهم لكل 3 أسهم.\r\n	2025-12-25 15:06:41.52357
5611	3020	توزيع أرباح نقدية	2012-03-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية للشركة على توزيع أرباح نقدية عن النصف الثاني 2011 بواقع 2 ريال للسهم.	2025-12-25 15:06:41.523875
5612	1120	توزيع أرباح نقدية	2012-03-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في  11 ربيع الآخر 1433هـ الموافق 4 مارس 2012م على توزيع أرباح نقدية عن النصف الثانى من عام 2011 بنسبة 20% من القيمة الاسمية وبواقع (2) ريال للسهم.	2025-12-25 15:06:41.52422
5613	4200	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-03-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 10-03-2012 على زيادة رأس المال إلى 300 مليون ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل 5 أسهم	2025-12-25 15:06:41.524575
5614	2160	توزيع أرباح نقدية	2012-03-10	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 29 فبراير 2012 على توزيع أرباح نقدية عن عام 2011 بنسبة 12.5% من رأس المال بواقع 1.25 ريال للسهم \r\n	2025-12-25 15:06:41.524937
5615	2280	اصدار صكوك	2012-03-07	\N	\N	\N	\N	SAR	قامت الشركة باصدار صكوك بقيمة مليار ريال\r\n	2025-12-25 15:06:41.525145
5616	4190	توزيع أرباح نقدية	2012-02-29	\N	\N	\N	\N	SAR	توزيع ارباح نقدية بواقع 1.6 ريال للسهم الواحد\r\n	2025-12-25 15:06:41.525353
5617	8311	إدراج الشركة	2012-02-27	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من يوم الاثنين 27-02-2012\r\n	2025-12-25 15:06:41.525591
5618	3020	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-02-27	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية للشركة على زيادة رأس المال إلى 2025000000 ريال من خلال توزيع أسهم منحة بواقع (1) سهم لكل سهمين 	2025-12-25 15:06:41.5258
5619	2330	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-02-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 21-02-2012 على زيادة رأس المال إلى 1639950000 ريال من خلال توزيع أسهم منحة بواقع (1) سهم مجاني لكل (6.25) أسهم.\r\n	2025-12-25 15:06:41.526009
5620	4010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2012-02-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 19/2/2012  على زيادة رأس المال إلى 1 مليار ريال من خلال توزيع أسهم منحة بواقع سهم لكل 2.3 سهم	2025-12-25 15:06:41.526202
5621	2320	زيادة حصة الشركة فى شركة تابعة	2012-02-20	\N	\N	\N	\N	SAR	قامت الشركة بزيادة حصتها في شركة قطر للهندسة والمقاولات إلى 9.7 %\r\n	2025-12-25 15:06:41.526398
5622	4240	توزيع أرباح نقدية	2012-02-20	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن التسعة أشهر من عام 2011 بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:41.526593
5623	1201	إدراج الشركة	2012-02-07	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من الثلاثاء 7 فبراير 2012.\r\n\r\n	2025-12-25 15:06:41.526774
5624	2320	استحواذ على شركة	2012-02-01	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من أسهم شركة  بتيتجان أس أيه أس 	2025-12-25 15:06:41.526962
5625	1201	بيع جزء من الشركة	2012-02-01	\N	\N	\N	\N	SAR	قامت الشركة بطرح 9 مليون سهم من أسهمها للاكتتاب العام 	2025-12-25 15:06:41.527145
5626	2360	توزيع أرباح نقدية	2012-01-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية بواقع 2 ريال عن النصف الثانى من عام 2011 	2025-12-25 15:06:41.527327
5627	8311	بيع جزء من الشركة	2012-01-14	\N	\N	\N	\N	SAR	قامت الشركة بطرح 16 مليون سهم من أسهمها للاكتتاب العام \r\n	2025-12-25 15:06:41.527509
5628	4050	توزيع أرباح نقدية	2012-01-11	\N	\N	\N	\N	SAR	وافق مجلس إدارة الشركة على توزيع أرباح نقدية عن فترة التسعة أشهر المنتهية في 30/9/2011  بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم 	2025-12-25 15:06:41.527697
5629	4280	توزيع أرباح نقدية	2012-01-11	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الرابع من عام 2011 بنسبة 1.25% من رأس المال بواقع 0.125 ريال للسهم \r\n\r\n\r\n	2025-12-25 15:06:41.527916
5630	6090	بيع شركة تابعة	2012-01-05	\N	\N	\N	\N	SAR	قامت الشركة ببيع كامل حصتها في شركة سيولندا المملكة المتحدة	2025-12-25 15:06:41.528867
5631	7010	شراء نسبة من شركة	2011-12-28	\N	\N	\N	\N	SAR	قامت الشركة بشراء 60% من شركة سيل للاتصالات المحدودة\r\n	2025-12-25 15:06:41.529123
5633	4190	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-12-26	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 600 مليون ريال من خلال توزيع أسهم منحة بواقع سهم لكل سهمين\r\n	2025-12-25 15:06:41.529608
5634	4003	إدراج الشركة	2011-12-24	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من السبت 24 ديسمبر 2011.\r\n	2025-12-25 15:06:41.529899
5635	2260	زيادة رأس مال - إصدار حقوق أولوية	2011-12-24	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 4,387,950,000  ريال من خلال إصدار أسهم حقوق أولوية 	2025-12-25 15:06:41.530148
5636	2280	استحواذ على شركة	2011-12-21	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من أسهم شركة فوند مونتي أي.أس بقيمة 312 مليون ريال\r\n	2025-12-25 15:06:41.530413
5637	4003	بيع جزء من الشركة	2011-12-19	\N	\N	\N	\N	SAR	قامت الشركة بطرح 7.2 مليون سهم من أسهمها للاكتتاب العام	2025-12-25 15:06:41.530655
5638	2110	توزيع أرباح نقدية	2011-12-18	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 7 يونيو 2011 على توزيع الدفعة الثانية عن عام 2010 بواقع 0.375 ريال للسهم.	2025-12-25 15:06:41.530896
5639	8130	زيادة رأس مال - إصدار حقوق أولوية	2011-12-18	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى  166666670 ريال من خلال إصدار أسهم حقوق أولوية بواقع 2 سهم لكل  3 أسهم  	2025-12-25 15:06:41.531142
5640	7010	زيادة حصة الشركة فى شركة تابعة	2011-12-14	\N	\N	\N	\N	SAR	قامت الشركة بزيادة حصتها في شركة الخليج للإعلام الرقمى إلى 71%	2025-12-25 15:06:41.531387
5641	4210	بيع شركة تابعة	2011-12-14	\N	\N	\N	\N	SAR	قامت الشركة ببيع كامل حصتها في شركة الخليج للإعلام الرقمي القابضة\r\n	2025-12-25 15:06:41.531636
5642	2140	زيادة حصة الشركة فى شركة تابعة	2011-12-07	\N	\N	\N	\N	SAR	قامت الشركة بزيادة حصتها في شركة الأحساء للصناعات الغذائية إلى 100% 	2025-12-25 15:06:41.53188
5643	6060	بيع شركة تابعة	2011-12-07	\N	\N	\N	\N	SAR	قامت الشركة ببيع كامل حصتها في شركة الإحساء للصناعات الغذائية\r\n	2025-12-25 15:06:41.532157
5644	4310	تأسيس شركة	2011-12-06	\N	\N	\N	\N	SAR	  قامت الشركة بتأسيس شركة منشآت المعرفة الإقتصادية بنسبة استحواذ 99% 	2025-12-25 15:06:41.532404
5645	4310	تأسيس شركة	2011-12-06	\N	\N	\N	\N	SAR	  قامت الشركة بتأسيس شركة مشاريع المعرفة الإقتصادية بنسبة استحواذ 99% 	2025-12-25 15:06:41.532657
5646	1214	توزيع أرباح نقدية	2011-12-05	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن التسعة أشهر من عام 2011  بواقع 3.5 ريال من رأس المال 	2025-12-25 15:06:41.532906
5647	7010	توزيع أرباح نقدية	2011-11-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثالث من عام 2011 بواقع 0.50 ريال	2025-12-25 15:06:41.533153
5648	2050	توزيع أرباح نقدية	2011-11-02	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثالث من عام 2011 بواقع 0.25 ريال من رأس المال 	2025-12-25 15:06:41.533397
5649	4190	توزيع أرباح نقدية	2011-11-01	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثالث من عام 2011 بواقع 3.4 ريال للسهم من رأس المال 	2025-12-25 15:06:41.533647
5650	4020	توزيع أرباح نقدية	2011-10-29	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 5% من رأس المال 	2025-12-25 15:06:41.533896
5651	1301	توزيع أرباح نقدية	2011-10-26	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية بواقع 0.75 ريال للسهم \r\n	2025-12-25 15:06:41.534138
5652	3030	تأسيس شركة	2011-10-23	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شركة " جروب العالمية للاسمنت" بنسبة استحواذ 40%\r\n\r\n\r\n	2025-12-25 15:06:41.534381
5653	1320	توزيع أرباح نقدية	2011-10-22	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بمقدار 0.75 ريال  لكل سهم 	2025-12-25 15:06:41.534623
5654	4090	توزيع أرباح نقدية	2011-10-18	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية بقيمة 0.25 ريال	2025-12-25 15:06:41.534869
5655	3001	إدراج الشركة	2011-10-16	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من 16 أكتوبر 2011.\r\n	2025-12-25 15:06:41.535121
5656	4280	توزيع أرباح نقدية	2011-10-12	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثالث من عام 2011 بنسبة 1.25% من رأس المال بواقع 0.125 ريال للسهم \r\n\r\n\r\n	2025-12-25 15:06:41.535376
5657	3001	بيع جزء من الشركة	2011-10-08	\N	\N	\N	\N	SAR	قامت الشركة بطرح 48.95 مليون سهم من أسهمها للاكتتاب العام	2025-12-25 15:06:41.535621
5658	4070	توزيع أرباح نقدية	2011-10-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 8-8-2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 1.5 ريال للسهم 	2025-12-25 15:06:41.535872
5659	4090	توزيع أرباح نقدية	2011-09-20	\N	\N	\N	\N	SAR	طبقا لقرار مجلس الإدارة تقرر توزيع 5 % أرباحا نقدية عن النصف الأول من عام 2011.	2025-12-25 15:06:41.536119
5660	4010	توزيع أرباح نقدية	2011-09-14	\N	\N	\N	\N	SAR	وافق مجلس الإدارة في اجتماعه المنعقد في 8-8-2011 على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:41.536362
5661	4100	توزيع أرباح نقدية	2011-08-24	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 17/8/2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 1.5 ريال للسهم 	2025-12-25 15:06:41.546015
5662	1301	إدراج الشركة	2011-08-21	\N	\N	\N	\N	SAR	يبدأ اعتباراً من يوم الأحد 21 / 09 / 1432 هـ الموافق 21 / 08 / 2011 م إدراج و بدء تداول أسهم شركة إتحاد مصانع الأسلاك ضمن قطاع التشييد والبناء بالرمز 1301 	2025-12-25 15:06:41.54631
5663	2240	توزيع أرباح نقدية	2011-08-21	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 7.5% من رأس المال بواقع 0.75ريال للسهم.	2025-12-25 15:06:41.546564
5666	6002	توزيع أرباح نقدية	2011-08-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 1/8/2011  على توزيع أرباح نقدية عن النصف الأول من عام 2011  بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:41.547352
5667	1330	توزيع أرباح نقدية	2011-08-15	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 10% من رأس المال بواقع 1 ريال للسهم.\r\n	2025-12-25 15:06:41.547696
5668	4190	توزيع أرباح نقدية	2011-08-15	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثاني من عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم 	2025-12-25 15:06:41.548029
5669	7020	توزيع أرباح نقدية	2011-08-14	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 12.5% من رأس المال بواقع 1.25 ريال للسهم.	2025-12-25 15:06:41.548343
5670	7010	توزيع أرباح نقدية	2011-08-10	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثاني من عام 2011 بنسبة 5% من رأس المال بواقع 0.5 ريال للسهم \r\n\r\n\r\n\r\n	2025-12-25 15:06:41.548656
5671	7040	تخفيض رأس مال - بتخفيض عدد الأسهم	2011-08-08	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 6-8-2011 على تخفيض رأس المال إلى 400 مليون ريال ليصبح عدد أسهم الشركة 40 مليون سهم.	2025-12-25 15:06:41.54898
5672	2050	توزيع أرباح نقدية	2011-08-08	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثاني من عام 2011 بنسبة 2.5% من رأس المال بواقع 0.25 ريال للسهم \r\n\r\n	2025-12-25 15:06:41.549456
5673	3090	توزيع أرباح نقدية	2011-08-08	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 9% من رأس المال بواقع 0.90 ريال للسهم.	2025-12-25 15:06:41.549794
5674	2010	توزيع أرباح نقدية	2011-08-06	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم.\r\n\r\n	2025-12-25 15:06:41.550183
5675	6002	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-08-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 01/08/2011 على زيادة رأس المال إلى 300 مليون ريال من خلال توزيع أسهم منحة بواقع سهم واحد لكل  9 أسهم.\r\n	2025-12-25 15:06:41.550564
5676	2330	توزيع أرباح نقدية	2011-08-01	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 10% من رأس المال بواقع 1 ريال للسهم.\r\n\r\n\r\n\r\n	2025-12-25 15:06:41.550911
5677	3010	توزيع أرباح نقدية	2011-07-31	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:41.551147
5678	2250	تأسيس شركة	2011-07-31	\N	\N	\N	\N	SAR	تعلن المجموعة السعودية للإستثمار الصناعي وشريكتها شركة شيفرون فيليبس العربية عن تأسيس شركة جديدة بمسمى "شركة البتروكيماويات التحويلية"، بمدينة الجبيل وبرأس مال 150 مليون ريال، مملوكة مناصفة بين الشريكين 	2025-12-25 15:06:41.551412
5679	2020	توزيع أرباح نقدية	2011-07-27	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بواقع 6 ريال للسهم \r\n	2025-12-25 15:06:41.551641
5680	1010	توزيع أرباح نقدية	2011-07-25	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 5.5% من رأس المال بواقع 0.55 ريال للسهم.	2025-12-25 15:06:41.552162
5681	1120	توزيع أرباح نقدية	2011-07-25	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 12.5% من رأس المال بواقع 1.25 ريال للسهم.	2025-12-25 15:06:41.552401
5682	2360	توزيع أرباح نقدية	2011-07-25	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم 	2025-12-25 15:06:41.552635
5683	3050	توزيع أرباح نقدية	2011-07-23	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 27.5% من رأس المال بواقع 2.75 ريال للسهم 	2025-12-25 15:06:41.552869
5684	8190	توزيع أرباح نقدية	2011-07-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 26 يونيو2011 على توزيع أرباح نقدية بنسبة 10% من رأس المال بواقع 1 ريال للسهم	2025-12-25 15:06:41.553091
5685	2270	توزيع أرباح نقدية	2011-07-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 28 يونيو 2011 على توزيع أرباح نقدية بنسبة 30% من رأس المال بواقع 3 ريال للسهم.	2025-12-25 15:06:41.553316
5686	3040	توزيع أرباح نقدية	2011-07-20	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 22.5% من رأس المال بواقع 2.25ريال للسهم \r\n\r\n	2025-12-25 15:06:41.553539
5687	3030	توزيع أرباح نقدية	2011-07-20	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم\r\n\r\n	2025-12-25 15:06:41.553761
5688	4240	تأسيس شركة	2011-07-17	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شركة رتيل جروب امريكا	2025-12-25 15:06:41.561552
5689	3020	توزيع أرباح نقدية	2011-07-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 20% من رأس المال بواقع 2 ريال للسهم 	2025-12-25 15:06:41.561809
5690	1050	توزيع أرباح نقدية	2011-07-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 7% من رأس المال بواقع 0.70 ريال للسهم 	2025-12-25 15:06:41.562058
5691	4280	توزيع أرباح نقدية	2011-07-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثاني من عام 2011 بنسبة 1.25% من رأس المال بواقع 0.125ريال للسهم 	2025-12-25 15:06:41.562313
5692	2310	اصدار صكوك	2011-07-16	\N	\N	\N	\N	SAR	قامت الشركة باصدار صكوك بقيمة 1800 مليون ريال.	2025-12-25 15:06:41.562552
5693	6090	بيع شركة تابعة	2011-07-15	\N	\N	\N	\N	SAR	قامت الشركة ببيع كامل حصتها في شركة سيلوندا اليونانية	2025-12-25 15:06:41.562792
5694	6090	بيع شركة تابعة	2011-07-15	\N	\N	\N	\N	SAR	قامت الشركة ببيع كامل حصتها في شركة انترفيش اليونانية	2025-12-25 15:06:41.563125
5695	2110	توزيع أرباح نقدية	2011-07-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 7 يونيو 2011 على توزيع الدفعة الأولى عن عام 2010 بنسبة 3.75% من رأس المال بواقع 0.375 ريال للسهم.\r\n\r\n\r\n	2025-12-25 15:06:41.563378
5696	1090	توزيع أرباح نقدية	2011-07-09	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2011 بنسبة 8% من رأس المال بواقع 0.80 ريال للسهم.	2025-12-25 15:06:41.56363
5697	4250	زيادة رأس مال - إصدار حقوق أولوية	2011-07-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 28 مايو 2011على زيادة رأس المال إلى 9.294 مليار ريال من خلال إصدار أسهم حقوق أولوية بواقع 1 سهم لكل  2.602 سهم بقيمة 10 ريال للسهم.\r\n\r\n\r\n	2025-12-25 15:06:41.563885
5698	7050	إدراج الشركة	2011-06-28	\N	\N	\N	\N	SAR	إدراج وبدء التداول على أسهم الشركة اعتباراً من 28 يونيو 2011 .\r\n	2025-12-25 15:06:41.564135
5699	1310	توزيع أرباح نقدية	2011-06-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 31 مايو 2011 على توزيع أرباح نقدية بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم.	2025-12-25 15:06:41.564391
5700	4020	بيع جزء من شركة تابعة	2011-06-11	\N	\N	\N	\N	SAR	قامت الشركة بتخفيض حصتها في شركة دار التمليك إلى 9.34%	2025-12-25 15:06:41.564638
5701	8030	توزيع أرباح نقدية	2011-06-06	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 8 مايو 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة (12.5%) من رأس المال بمقدار 1.25 ريال لكل سهم	2025-12-25 15:06:42.263946
5702	7050	بيع جزء من الشركة	2011-06-04	\N	\N	\N	\N	SAR	وافقت الهيئة على طرح 35% من أسهم الشركة للإكتتاب العام تساوي 35 مليون سهم.\r\n\r\n\r\n\r\n\r\n	2025-12-25 15:06:42.264641
5703	1330	توزيع أرباح نقدية	2011-05-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 11 مايو 2011 على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:42.265186
5704	2230	توزيع أرباح نقدية	2011-05-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 15 مايو 2011 على توزيع أرباح نقدية عن الربع الرابع من عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم 	2025-12-25 15:06:42.265643
5705	2340	توزيع أرباح نقدية	2011-05-24	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 25 أبريل 2011 على توزيع أرباح نقدية عن الربع الرابع من عام 2010 بواقع ريال واحد للسهم.\r\n	2025-12-25 15:06:42.266063
5706	1212	توزيع أرباح نقدية	2011-05-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 30 ابريل 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم \r\n\r\n\r\n\r\n	2025-12-25 15:06:42.266479
5707	1310	استحواذ على شركة	2011-05-21	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 100% من أسهم شركة النخبة الخليجية للمقاولات بقيمة 46 مليون ريال	2025-12-25 15:06:42.267023
5708	4080	توزيع أرباح نقدية	2011-05-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 27 ابريل 2011 على توزيع أرباح نقدية بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم	2025-12-25 15:06:42.267415
5709	3090	توزيع أرباح نقدية	2011-05-18	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 24 أبريل 2011 على توزيع أرباح نقدية عن النصف الثاني من عام 2010 بنسبة4.5% من رأس المال (أو من القيمة الاسمية) بواقع0.45 ريال للسهم.	2025-12-25 15:06:42.267774
5710	4260	توزيع أرباح نقدية	2011-05-17	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18 ابريل 2011 على توزيع أرباح نقدية بنسبة 22.5% من رأس المال بواقع (2.25) ريال للسهم.	2025-12-25 15:06:42.268105
5711	2320	زيادة رأس مال - اكتتاب خاص	2011-05-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في  14 مايو 2011 على زيادة رأس المال إلى 426.3 مليون ريال بغرض الاستحواذ على نسبة 5% من شركة البابطين لبلانك\r\n	2025-12-25 15:06:42.268427
5712	7010	توزيع أرباح نقدية	2011-05-11	\N	\N	\N	\N	SAR	وافق مجلس الإدارة المنعقد فى 27 ابريل 2011 على توزيع أرباح نقدية عن الربع الأول من عام 2011 بنسبة 5% من رأس المال بواقع 0.50 ريال للسهم \r\n\r\n	2025-12-25 15:06:42.268748
5713	4190	توزيع أرباح نقدية	2011-05-11	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الأول من عام 2011بنسبة 27% من رأس المال بواقع 2.7ريال للسهم \r\n\r\n\r\n	2025-12-25 15:06:42.269063
5714	6040	توزيع أرباح نقدية	2011-05-11	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 12 أبريل 2011 على توزيع ارباح للمساهمين بنسبة (5%) من رأس المال عن عام 2010 بمعدل (0.50) ريال للسهم الواحد.	2025-12-25 15:06:42.269379
5715	2050	توزيع أرباح نقدية	2011-05-10	\N	\N	\N	\N	SAR	وافق مجلس الإدارة المنعقد في 18 ابريل 2011 على توزيع أرباح نقدية عن الربع الأول من عام 2011 بنسبة 2.5% 	2025-12-25 15:06:42.269691
5716	4090	توزيع أرباح نقدية	2011-05-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 19 ابريل 2011 على توزيع ارباح نقدية عن عام 2010 بنسبة 7% من رأس المال بواقع (0.70) ريال للسهم.\r\n	2025-12-25 15:06:42.270014
5717	4150	توزيع أرباح نقدية	2011-05-08	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 19 أبريل 2011 على توزيع ارباح نقدية بنسبة (10%) من رأس المال عن عام 2010 بمعدل (1) ريال للسهم .\r\n\r\n	2025-12-25 15:06:42.280804
5718	2010	توزيع أرباح نقدية	2011-05-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 23 ابريل 2011 على توزيع أرباح نقدية عن النصف الثاني من عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم.	2025-12-25 15:06:42.281204
6456	4040	تجزئة أسهم	2006-03-30	\N	\N	\N	\N	SAR	اعلنت الشركة السعودية للنقل الجماعي عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.388022
5719	4210	توزيع أرباح نقدية	2011-05-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18 ابريل 2011 على توزيع أرباح عام 2010م ببنسبة (10%) من رأس المال بواقع (1) ريال للسهم.	2025-12-25 15:06:42.281586
5720	2070	توزيع أرباح نقدية	2011-05-04	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 16 أبريل 2011 على توزيع ارباح للمساهمين بنسبة (15%) من رأس المال عن عام 2010 بمعدل (1.5) ريال للسهم الواحد.	2025-12-25 15:06:42.282044
5721	4230	توزيع أرباح نقدية	2011-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 18 ابريل 2011 على توزيع أرباح نقدية بنسبة 10% من رأس المال بواقع (1) ريال للسهم.	2025-12-25 15:06:42.282387
5722	2030	توزيع أرباح نقدية	2011-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 30/3/2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.50 ريال للسهم \r\n	2025-12-25 15:06:42.282703
5723	2250	توزيع أرباح نقدية	2011-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 23 أبريل 2011 على توزيع أرباح نقدية بنسبة 5% من رأس المال بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:42.283023
5724	4270	توزيع أرباح نقدية	2011-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 3 ابريل 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 5% من رأس المال بواقع 0.5 ريال للسهم	2025-12-25 15:06:42.283356
5725	2150	توزيع أرباح نقدية	2011-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 9 أبريل 2011 على توزيع ارباح للمساهمين بنسبة (12.5%) من رأس المال عن عام 2010 بمعدل (1,25) ريال للسهم الواحد.	2025-12-25 15:06:42.283703
5726	2090	توزيع أرباح نقدية	2011-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 30 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم 	2025-12-25 15:06:42.284011
5727	5110	توزيع أرباح نقدية	2011-04-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 4 أبريل 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 7% من رأس المال (أو من القيمة الاسمية) بواقع 0.7 ريال للسهم 	2025-12-25 15:06:42.284334
5728	2080	توزيع أرباح نقدية	2011-04-27	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 28 مارس 2011 على توزيع أرباح نقدية بنسبة 7% من رأس المال بواقع 0.7 ريال للسهم.\r\n	2025-12-25 15:06:42.284649
5729	6002	توزيع أرباح نقدية	2011-04-27	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 17 ابريل 2011 على توزيع أرباح نقدية عن النصف الثاني من عام 2010 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم	2025-12-25 15:06:42.284945
5730	1310	تأسيس شركة	2011-04-26	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شركة "ثري دبليو نتوركس ام ام جي المحدودة" بالشراكة مع شركة  ثري دبليو نيتوركس\r\n\r\n\r\n	2025-12-25 15:06:42.285254
5731	1210	توزيع أرباح نقدية	2011-04-24	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 05/04/2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:42.285562
5732	2320	توزيع أرباح نقدية	2011-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 31 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم	2025-12-25 15:06:42.285863
5733	2180	توزيع أرباح نقدية	2011-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 30 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم	2025-12-25 15:06:42.28622
5734	4040	توزيع أرباح نقدية	2011-04-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 3 ابريل 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 5% من رأس المال بواقع 0.50 ريال للسهم	2025-12-25 15:06:42.286587
5735	2240	توزيع أرباح نقدية	2011-04-19	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 4 ابريل 2011 على توزيع أرباح نقدية عن النصف الثاني من العام 2010 بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم	2025-12-25 15:06:42.286959
5736	2060	توزيع أرباح نقدية	2011-04-19	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 4 ابريل 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:42.287316
5737	3010	توزيع أرباح نقدية	2011-04-17	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 3 ابريل 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:42.287671
5738	4020	توزيع أرباح نقدية	2011-04-17	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 31 ديسمبر 2010 على توزيع أرباح نقدية عن عام 2010 بنسبة 12.5% من رأس المال بواقع 1.25 ريال للسهم 	2025-12-25 15:06:42.288031
5739	4002	توزيع أرباح نقدية	2011-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 28 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم 	2025-12-25 15:06:42.288385
5740	6001	توزيع أرباح نقدية	2011-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 26 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم 	2025-12-25 15:06:42.28874
5741	7010	توزيع أرباح نقدية	2011-04-13	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية عن الربع الرابع من العام 2010 بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم 	2025-12-25 15:06:42.289114
5742	4030	توزيع أرباح نقدية	2011-04-13	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 29 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم	2025-12-25 15:06:42.289498
5743	1213	توزيع أرباح نقدية	2011-04-13	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 27 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم	2025-12-25 15:06:42.289876
5744	4001	توزيع أرباح نقدية	2011-04-12	\N	\N	\N	\N	SAR	وافقت الجمعية المنعقدة في 28 مارس 2011 على توزيع الأرباح عن العام 2010م بنسبة 30% وبواقع (3) ريال للسهم الواحد.	2025-12-25 15:06:42.290863
5745	2280	توزيع أرباح نقدية	2011-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 3 ابريل 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 22.5% من رأس المال بواقع 2.25 ريال للسهم \r\n	2025-12-25 15:06:42.291155
5746	4010	توزيع أرباح نقدية	2011-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 26 مارس 2011 على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:42.291448
5747	2300	توزيع أرباح نقدية	2011-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 26 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 15% من رأس المال بواقع 1.50 ريال للسهم 	2025-12-25 15:06:42.291758
5748	2360	توزيع أرباح نقدية	2011-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 29 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 30% من رأس المال بواقع 3 ريال للسهم 	2025-12-25 15:06:42.292057
5749	2330	توزيع أرباح نقدية	2011-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:42.2923
5750	3040	توزيع أرباح نقدية	2011-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة فى 25 مارس 2010 على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة %27.5 من رأس المال بواقع 2.75 ريال للسهم \r\n	2025-12-25 15:06:42.29254
5751	1050	توزيع أرباح نقدية	2011-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 27 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم 	2025-12-25 15:06:42.292778
5752	4280	توزيع أرباح نقدية	2011-04-09	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الأول من عام 2011 بنسبة 1.25% من رأس المال بواقع 0.125ريال للسهم 	2025-12-25 15:06:42.293024
5753	1080	توزيع أرباح نقدية	2011-04-06	\N	\N	\N	\N	SAR	وافقت الجمعية العادية المنعقدة في 27 مارس 2011  على توزيع أرباح عن عام 2010م على المُساهمين بنسبة 10% من قيمة السهم الاسميَّة للسهم الواحد.	2025-12-25 15:06:42.293261
5754	3080	توزيع أرباح نقدية	2011-04-06	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 27 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 35% من رأس المال بواقع 3.50 ريال للسهم 	2025-12-25 15:06:42.293483
5755	4200	توزيع أرباح نقدية	2011-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 12 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:42.293774
5756	2060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 4 ابريل 2011 على زيادة رأس المال إلى 5,574,284,710 ريال من خلال توزيع أسهم منحة بواقع سهم لكل  10 أسهم\r\n	2025-12-25 15:06:42.294066
5757	2040	توزيع أرباح نقدية	2011-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 21 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 35% من رأس المال بواقع 3.5 ريال للسهم 	2025-12-25 15:06:42.294363
5758	2020	توزيع أرباح نقدية	2011-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة 60% من رأس المال (أو من القيمة الاسمية) بواقع 6 ريال للسهم \r\n	2025-12-25 15:06:42.29465
5759	2050	توزيع أرباح نقدية	2011-04-04	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الرابع من عام 2010 بنسبة 2.5% من رأس المال بواقع 0.25 ريال للسهم \r\n	2025-12-25 15:06:42.294932
5760	3060	توزيع أرباح نقدية	2011-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 11 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:42.295224
5761	3030	توزيع أرباح نقدية	2011-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 23 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 40% من رأس المال بواقع 4 ريال للسهم \r\n	2025-12-25 15:06:42.295517
5762	8010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-04-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 30 مارس 2011 على زيادة رأس المال إلى 750 مليون ريال من خلال توزيع أسهم منحة بواقع سهم لكل سهمين\r\n	2025-12-25 15:06:42.29581
5763	6070	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-03-31	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 11 مارس 2011 على زيادة رأس المال إلى 250 مليون ريال من خلال توزيع أسهم منحة بواقع سهم لكل  4 أسهم\r\n	2025-12-25 15:06:42.296139
5764	4070	زيادة حصة الشركة فى شركة تابعة	2011-03-30	\N	\N	\N	\N	SAR	قامت الشركة بزيادة حصتها في شركة أد أرت ميديان إلى 75%\r\n	2025-12-25 15:06:42.296457
5765	4240	توزيع أرباح نقدية	2011-03-29	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 5 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 25% من رأس المال بواقع 2.5 ريال للسهم \r\n	2025-12-25 15:06:42.296783
5766	1020	اصدار صكوك	2011-03-29	\N	\N	\N	\N	SAR	قامت الشركة باصدار صكوك بقيمة مليار ريال بعائد 1.7% نصف سنوي \r\n	2025-12-25 15:06:42.297247
5767	1080	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-03-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 27 مارس 2011 على زيادة رأس المال إلى 8500 مليون ريال من خلال توزيع أسهم منحة بواقع 4 أسهم لكل  13 سهم	2025-12-25 15:06:42.297578
5768	1010	توزيع أرباح نقدية	2011-03-27	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 14 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 7% من رأس المال بواقع 0.7 ريال للسهم \r\n	2025-12-25 15:06:42.297884
5769	1030	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-03-27	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 26 مارس 2011 على زيادة رأس المال إلى 5500 مليون ريال من خلال توزيع أسهم منحة بواقع سهم لكل 4.5 سهم\r\n	2025-12-25 15:06:42.298111
5770	6070	توزيع أرباح نقدية	2011-03-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 11 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:42.298395
5771	1060	توزيع أرباح نقدية	2011-03-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 15 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 6.8% من رأس المال بواقع 0.68 ريال للسهم \r\n	2025-12-25 15:06:42.306639
5772	1320	توزيع أرباح نقدية	2011-03-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 7 مارس 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 10% من رأس المال بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:42.306925
5773	3050	توزيع أرباح نقدية	2011-03-19	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 10 مارس 2011 على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة 25% من رأس المال بواقع 2.5 ريال للسهم \r\n	2025-12-25 15:06:42.307238
5774	2310	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2011-03-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 15 مارس 2011 على زيادة رأس المال إلى 3666 مليون ريال من خلال توزيع أسهم منحة بواقع سهم لكل  10 أسهم\r\n	2025-12-25 15:06:42.307504
5775	1120	توزيع أرباح نقدية	2011-03-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 7 مارس 2011 على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:42.307787
5776	7020	توزيع أرباح نقدية	2011-03-13	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 26 فبراير 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:42.30806
5777	3020	توزيع أرباح نقدية	2011-03-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 27 فبراير 2011 على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة 20% من رأس المال بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:42.30836
5778	2160	توزيع أرباح نقدية	2011-03-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 27 فبراير 2011 على توزيع أرباح نقدية عن عام 2010 بنسبة 15% من رأس المال بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:42.308626
5779	4190	توزيع أرباح نقدية	2011-02-28	\N	\N	\N	\N	SAR	اقر مجلـس الإدارة في إجتماعه توزيـع ( 80 ) مليون ريال لمساهمي الشركة ، بواقع 2 ريال للسهم الواحد ، وذلك كأرباح ربع سنوية من أرباح شركة جرير عن الربع الرابع من العام المالي 2010م.\r\nوأن أحقية هذه الأرباح ستكون للمساهمين المسجلين بسجلات مساهمي الشركة بنهاية تداول يوم الثلاثاء الموافق 15/02/2011م وستبدأ الشركة في صرف الأرباح اعتباراً من يوم الإثنين الموافق 28/02/2011م .	2025-12-25 15:06:42.308891
5780	1090	توزيع أرباح نقدية	2011-02-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية المنعقدة في 8 فبراير 2011 على توزيع أرباح نقدية عن النصف الثانى من عام 2010 بنسبة 7.5% من رأس المال بواقع 0.75 ريال للسهم \r\n	2025-12-25 15:06:42.309161
5781	4050	توزيع أرباح نقدية	2011-01-04	\N	\N	\N	\N	SAR	أقر مجلس إدارة الشركة توزيع أرباح نقدية عن فترة التسعة أشهر المنتهية في 30/09/2010م بواقع (0,5) ريال عن السهم الواحد وبإجمالي مبلغ (22,500,000) ريال أي بنسبة 5% من رأس المال .	2025-12-25 15:06:42.30944
5782	2200	شراء نسبة من شركة	2011-01-01	\N	\N	\N	\N	SAR	شراء كامل حصة شركة يادونج انتي كروشن انترناشيونال المحدودة ( بريطانية الجنسية) البالغة 50% في الشركة العربية يادونج للتغليف المحدودة بقيمة بلغت 9.6 مليون ريال سعوي لاغير لتصبح نسبة ملكية الشركة العربية للأنابيب 100% في الشركة العربية يادونج للتغليف المحدودة	2025-12-25 15:06:42.309727
5783	2340	توزيع أرباح نقدية	2010-12-18	\N	\N	\N	\N	SAR	قرر مجلس إدارة الشركة  توزيع أرباح أولية عن فترة التسعة أشهر المنتهية في 30/09/2010م وتوزيع أرباح من رصيد الأرباح المبقاة على السادة مساهمي الشركة وذلك بإجماليٍ بَلغَ (121.875) مليون ريال سعودي بواقع (1.5) ريال للسهم الواحد وتعادل هذه الأرباح الموزعة ما نسبته (15%) من القيمة الاسمية.	2025-12-25 15:06:42.310015
5784	3091	تأسيس شركة	2010-12-14	\N	\N	\N	\N	SAR	أعلنت الشركةعن تأسيس شركة إستثمارات الجوف، شركة ذات مسؤولية محدودة ، بتاريخ 8/1/1432هـ الموافق 14/12/2010م، وتملكها بالكامل برأس مال قدرة (230) مليون مئتان وثلاثون مليون ريال تمت تغطيته بالكامل ، وتتلخص نشاطاتها في تجارة الجملة والتجزئة في الإسمنت ومشتقاته وإقامة مصانع الخرسانة الجاهزة ومصانع الإسمنت ومشتقاتها .	2025-12-25 15:06:42.310329
5785	2280	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2010-12-06	\N	\N	\N	\N	SAR	وافق مجلس إدارة الشركة على زيادة رأس مال الشركة من مبلغ (1,150) مليون ريال سعودي إلى مبلغ (2,300) مليون ريال سعودي بنسبة زيادة قدرها 100% ليرتفع عدد أسهم الشركة من (115) مليون سهم إلى (230) مليون سهم وذلك بمنح سهم واحد مجاني مقابل كل سهم 	2025-12-25 15:06:42.310663
5786	1330	توزيع أرباح نقدية	2010-12-05	\N	\N	\N	\N	SAR	تعلن شركة أبناء عبد المحسن الخضرى عن أنه سوف يتم توزيع الأرباح عن النصف الأول من العام المالي 2010م بمقدار 1,30 ريال للسهم، عن طريق بنك الرياض على السادة المساهمين المسجلين بسجلات تداول بنهاية تداول يوم 29/11/2010م	2025-12-25 15:06:42.310881
5808	2330	توزيع أرباح نقدية	2010-07-31	\N	\N	\N	\N	SAR	وافق مجلس الأدارة على توزيع أرباح نقدية عن النصف الأول من عام 2010 بواقع 75 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة بنهاية تداول يوم الأربعاء 30/6/2010م	2025-12-25 15:06:43.165722
5787	1214	توزيع أرباح نقدية	2010-12-04	\N	\N	\N	\N	SAR	قرر مجلس إدارة شركة الحسن غازي إبراهيم شاكر في اجتماعه المنعقد يوم الأربعاء 04/12/1431هـ الموافق 10/11/2010م توزيع أرباح نقدية عن فترة التسعة أشهر المنتهية في 30/09/2010م وتوزيع أرباح من رصيد الأرباح المبقاة على السادة مساهمي الشركة وذلك بمبلغ إجماليٍ وقدره 105 مليون ريال سعودي (مائة وخمسة مليون) بواقع 3 ريال (ثلاثة) للسهم الواحد	2025-12-25 15:06:42.311097
5788	2230	توزيع أرباح نقدية	2010-11-30	\N	\N	\N	\N	SAR	أقر مجلس إدارة الشركة الكيميائية السعودية في إجتماع اليوم الثلاثاء 25/11/1431هـ الموافق 2/11/2010م ، توزيع أرباح عن الربع الثالث المنتهي في 30/9/2010م مبلغ 94.860.000ريال ، بواقع 1.5 ريال عن السهم وستكون أحقية الأرباح للمساهمين المسجلين بسجلات مساهمي الشركة بنهاية تداول يوم الأثنين 2/12/1431هـ الموافق 8/11/2010م ، وستبدأ الشركة في صرف الأرباح إعتباراً من يوم الثلاثاء 24 ذو الحجة 1431هـ الموافق 30 نوفمبر 2010	2025-12-25 15:06:42.311356
5789	2160	بيع شركة تابعة	2010-11-28	\N	\N	\N	\N	SAR	قامت أميانتيت ببيع حصصها في شركة مصنع دبي للأنابيب (ذ.م.م).(22,5% من رأس المال) بقيمة 30 مليون درهم أماراتي.	2025-12-25 15:06:42.311579
5790	7010	توزيع أرباح نقدية	2010-11-24	\N	\N	\N	\N	SAR	أقر مجلس إدارة شركة الاتصالات السعوديـة اليوم الثلاثاء 11/11/1431هـ الموافق 19/10/2010م توزيع أرباح أولية مقدارها ( 1,500 ) مليون ريال عن الربع الثالث من العام المالي 2010م بواقــع ( 0,75 ) ريال عن كل سهم ، وتعادل هذه الأرباح الموزعة ما نسبته ( 7,5 % ) من القيمة الاسمية للسهم	2025-12-25 15:06:42.311795
5791	4190	توزيع أرباح نقدية	2010-11-07	\N	\N	\N	\N	SAR	وافق مجلس ادارة الشركة على توزيـع ارباح بقيمة 2 ريال للسهم الواحد ، وذلك كأرباح للربع الثالث من العام 2010.	2025-12-25 15:06:42.31199
5792	2050	توزيع أرباح نقدية	2010-11-02	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية على المساهمين وقدرها 125 مليون ريال عن الربع الثالث من العام المالي 2010(أي بواقع (0.25 ريال) للسهم الواحد.	2025-12-25 15:06:42.312179
5793	1330	بيع جزء من الشركة	2010-10-20	\N	\N	\N	\N	SAR	وافقت الهيئة على طرح 30% من أسهم الشركة للإكتتاب العام 	2025-12-25 15:06:42.3124
5794	1212	بيع شركة تابعة	2010-09-29	\N	\N	\N	\N	SAR	وافقت الجمعية العامة للشركة على بيع الشركة العربية للاغطية والوسائد بقيمة 99 مليون ريال.	2025-12-25 15:06:42.314946
5795	1320	توزيع أرباح نقدية	2010-09-06	\N	\N	\N	\N	SAR	قررت الشركة صرف أرباح عن النصف الأول لعام 2010م بواقع (50) هللة للسهم الواحد بإجمالي مبلغ وقدره (25.500.000) ريال	2025-12-25 15:06:42.315138
5796	4010	توزيع أرباح نقدية	2010-09-05	\N	\N	\N	\N	SAR	أقرت الشركة توزيع أرباح نقدية عن النصف الأول من عام 2010 بواقع 50 هللة لكل سهم.	2025-12-25 15:06:42.315315
5797	8040	تغيير اسم الشركة	2010-09-01	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية الفرنسية للتأمين التعاوني عن إنتهاء إجراءات تعديل إسمها التجاري ليصبح (شركة أليانز السعودي الفرنسي للتأمين التعاوني ) وذلك بموجب السجل التجاري المعدل والمصدر يوم 01/9/2010م	2025-12-25 15:06:42.315518
5798	4100	توزيع أرباح نقدية	2010-08-24	\N	\N	\N	\N	SAR	اقرت الشركة الشركة صرف الأرباح عن عام 1431هـ اعتباراً من يوم الثلاثاء 14/09/1431هـ الموافق 24/08/2010م بواقع (1.5) ريال للسهم الواحد.	2025-12-25 15:06:42.315704
5799	4190	توزيع أرباح نقدية	2010-08-18	\N	\N	\N	\N	SAR	وافق مجلس ادارة الشركة على توزيـع ارباح بقيمة 1.55 ريال للسهم الواحد ، وذلك كأرباح للربع الثانى من العام 2010.	2025-12-25 15:06:42.315903
5800	3090	توزيع أرباح نقدية	2010-08-17	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الأول بواقع 0.90 ريال للسهم الواحد للمساهمين المقيدين بالسجلات الرسمية للشركة بنهاية تداول يوم الأربعاء بتاريخ 25/07/1431هـ الموافق 07/07/2010م	2025-12-25 15:06:42.316079
5801	3040	توزيع أرباح نقدية	2010-08-14	\N	\N	\N	\N	SAR	أقر مجلس ادارة شركة أسمنت القصيم توزيع مبلغ 202,5 مليون ريال بواقع 2,25 ريال للسهم الواحد كأرباح نصف سنوية عن النصف الأول من عام 2010م وبنسبة 22,50% من رأس المال المدفوع.	2025-12-25 15:06:43.163964
5802	2240	توزيع أرباح نقدية	2010-08-14	\N	\N	\N	\N	SAR	أقر مجلس إدارة شركة الزامل للاستثمار الصناعي (الزامل للصناعة) توزيع أرباح نصف سنوية تبلغ (45) مليون ريال سعودي عن النصف الأول من العام 2010م وذلك بواقــع (0.75) ريال عن كل سهم، وتمثل الأرباح ما نسبته (7.5%) من رأسمال الشركة.	2025-12-25 15:06:43.164415
5803	7010	توزيع أرباح نقدية	2010-08-11	\N	\N	\N	\N	SAR	أقر مجلس إدارة اتصالات السعوديـة توزيع أرباح مقدارها 1,500 مليون ريال عن الربع الثاني من العام المالي 2010م بواقــع 0,75 ريال عن كل سهم ، وتعادل هذه الأرباح الموزعة ما نسبته 7,5 % من القيمة الاسمية.	2025-12-25 15:06:43.16466
5804	6002	توزيع أرباح نقدية	2010-08-10	\N	\N	\N	\N	SAR	اقرت الشركة توزيع ارباح نصف سنوية عن النصف الأول من العام 2010 بواقع 1.5 ريال للسهم الواحد.	2025-12-25 15:06:43.164886
5805	2010	توزيع أرباح نقدية	2010-08-07	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الأول من عام 2010 بواقع 1.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم انعقاد الجمعية فى 26 يوليو2010	2025-12-25 15:06:43.1651
5806	3091	بيع جزء من الشركة	2010-08-07	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 65 مليون سهم تمثِّل 50% من إجمالي أسهم الشركة.	2025-12-25 15:06:43.16529
5807	1090	توزيع أرباح نقدية	2010-08-04	\N	\N	\N	\N	SAR	اقر مجلس الادارة توزيع أرباح مرحلية نصف سنوية لعام 2010م قدرها 875 مـليـون ريـال بواقع (0.90) ريال للسهم الواحد .	2025-12-25 15:06:43.165512
5809	3020	توزيع أرباح نقدية	2010-07-31	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2010 بواقع 2 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة نهـاية يـوم الاحد 06-08-1431هـ الموافق 18-07-2010	2025-12-25 15:06:43.165912
5810	2050	توزيع أرباح نقدية	2010-07-28	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع أرباح نقدية بواقع 25 هللة للسهم الواحد	2025-12-25 15:06:43.167222
5811	1010	توزيع أرباح نقدية	2010-07-24	\N	\N	\N	\N	SAR	وافق مجلس ادارة البنك على توزيع ارباح نقدية نصف سنوية للنصف الأول من العام 2010 بنحو 60 هللة لكل سهم بنهـــاية تداول يـوم 12-7-2010 م.	2025-12-25 15:06:43.167473
5812	3050	توزيع أرباح نقدية	2010-07-24	\N	\N	\N	\N	SAR	اقر مجلس الادارة بتوزيع ارباح على المساهمين عن النصف الأول لعام 2010م بقيمة 280 مليون ريال بواقع 2 ريال للسهم الواحد , و بأحقية لحاملي السهم بنهاية تداول يوم الأحد 6/8/1431هـ الموافق 18/7/2010م.	2025-12-25 15:06:43.167687
5813	2020	توزيع أرباح نقدية	2010-07-21	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية عن النصف الأول من عام 2010 بنسبة 60% من رأس المال (أو من القيمة الاسمية) بواقع  6 ريال للسهم \r\n	2025-12-25 15:06:43.167907
5814	1120	توزيع أرباح نقدية	2010-07-19	\N	\N	\N	\N	SAR	أقر مجلس الإدارة توزيع مبلغ 2,250 مليون ريال أرباحا على المساهمين عن النصف الأول من العام الجاري بواقع 1.50 ريال لكل سهم بعد خصم الزكاة، بنسبة 15%من القيمة الاسمية للسهم.	2025-12-25 15:06:43.168092
5815	4300	توزيع أرباح نقدية	2010-07-12	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية للعام 2009 بوقع واحد ريال للسهم الواحد وذلك للمساهمين المقيدين بسجلات الشركة لدى مركز إيداع الأوراق المالية بنهاية تداول يوم إنعقاد الجمعية.	2025-12-25 15:06:43.168275
5816	2270	توزيع أرباح نقدية	2010-07-12	\N	\N	\N	\N	SAR	قرر مجلس الإدارة توزيع أرباح عن فترة الربع الرباع من 2009 بقيمة إجمالية قدرها 48.750.000 ريال بواقع 1.5 ريال لكل سهم	2025-12-25 15:06:43.168479
5817	1310	توزيع أرباح نقدية	2010-07-03	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 0.75 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم انعقاد الجمعية العامة العادية في 29/05/2010	2025-12-25 15:06:43.168663
5818	2130	بيع شركة تابعة	2010-06-30	\N	\N	\N	\N	SAR	أنهت الشركة بيع محفظتها الإستثمارية والمتمثلة في عدد 3.210 مليون سهم من أسهمها التأسيسية في شركة ينبع الوطنية للبتروكيماويات (ينساب) بمبلغ (133.6) مليون ريال، بالإضافة الى نقل ملكية عدد 800 ألف سهم من أسهمها في شركة ينبع الوطنية للبتروكيماويات (ينساب) إلى محفظة جمعية البر بجدة.	2025-12-25 15:06:43.168851
5819	4150	توزيع أرباح نقدية	2010-06-22	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية للشركة على صرف أرباح لمساهميها عن النصف الثاني للعام المالي 2009م بواقع (50) هللة للسهم الواحد.	2025-12-25 15:06:43.170086
5820	2030	توزيع أرباح نقدية	2010-06-15	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 50 هللة لكل سهم وبإجمالي مبلغ (7.500.000)	2025-12-25 15:06:43.170463
5821	4310	بيع جزء من الشركة	2010-06-12	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 102 مليون سهم 30.06% من إجمالي رأسمال الشركة.	2025-12-25 15:06:43.170763
5822	2250	توزيع أرباح نقدية	2010-06-01	\N	\N	\N	\N	SAR	أقرت الجمعية العامة العادية المنعقدة يوم السبت 22/5/2010م توزيع ارباح نقدية على المساهمين بواقع نصف ريال للسهم الواحد وبإجمالي مبلغ قدره 225 مليون ريال.	2025-12-25 15:06:43.170972
5823	2230	توزيع أرباح نقدية	2010-05-30	\N	\N	\N	\N	SAR	اقرت عمومية الشركة توزيع أرباح عن الربع الرابع من العام المالي 2009م بواقع 1,50 ريال للسهم.	2025-12-25 15:06:43.171173
5824	4240	توزيع أرباح نقدية	2010-05-30	\N	\N	\N	\N	SAR	اقرت عمومية الشركة توزيع ارباح نقدية على مساهميها بواقع 2 ريال للسهم الواحد للمساهمين المسجلين بنهاية تداول يوم الاربعاء الموافق 21/4/2010 ، والمقرر بداية صرفها اعتباراً من يوم الأحد 30/05/2010م الموافق 16/06/1431هـ.	2025-12-25 15:06:43.171377
5825	4080	توزيع أرباح نقدية	2010-05-29	\N	\N	\N	\N	SAR	اقرت عمومية الشركة توزيع أرباح نقدية عن عام 2009 بواقع 0.75 ريال لكل سهم بقيمة اجمالية 94.791.667 ريال للمساهمين المسجلين في الأربعاء 21/05/1431هـ الموافق 05/05/2010م.	2025-12-25 15:06:43.171577
5826	2150	توزيع أرباح نقدية	2010-05-26	\N	\N	\N	\N	SAR	اقرت عمومية الشركة توزيع أرباح السنة المالية المنتهية بتاريخ 31/12/2009 م بواقع (0.5) نصف ريال لكل سهم اعتبارا من يوم الاربعاء 12/6/1431هـ الموافق26/5/2010 م.	2025-12-25 15:06:43.171774
5827	2370	زيادة حصة الشركة فى شركة تابعة	2010-05-25	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على رفع حصة الشركة في مسك-فوجيكورا من 46% الى 57.5% عن طريق شراء حصة الشريك الياباني مقابل 19 مليون ريال سعودي وتناسب مع بقية الشركاء.	2025-12-25 15:06:43.171969
5828	2110	توزيع أرباح نقدية	2010-05-24	\N	\N	\N	\N	SAR	أقرت عمومية الشركة توزيع أرباح نقدية عن عام 2009 بواقع 75 هللة ( 0.75 ريال ) لكل سهم إعتباراً من يوم الإثنين 10/06/1431هـ الموافق 24/05/2010.	2025-12-25 15:06:43.172163
5829	6040	توزيع أرباح نقدية	2010-05-23	\N	\N	\N	\N	SAR	أقرت الجمعية توزيع ارباحها السنوية لعام 2009 على مساهميها بواقع 0.5 ريال (نصف ريال ) للسهم الواحد.	2025-12-25 15:06:43.172355
5830	3030	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2010-05-22	\N	\N	\N	\N	SAR	إضافة أسهم المنحة الخاصة للشركة اليوم وذلك على أساس سهم واحد مجاني مقابل كل سهمين مملوكة للمقيدين في سجلات الشركة كما في نهاية تداول يوم الثلاثاء 4/06/1431هـ الموافق 18/05/2010 م.	2025-12-25 15:06:43.172536
5831	2220	توزيع أرباح نقدية	2010-05-22	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 50 هللة لكل سهم قائم تمثل (5%) من القيمة الأسمية	2025-12-25 15:06:43.172717
5832	2160	توزيع أرباح نقدية	2010-05-22	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع ريال واحد لكل سهم وهى تمثل 10% من رأس المال المدفوع	2025-12-25 15:06:43.172938
5833	5110	اصدار صكوك	2010-05-22	\N	\N	\N	\N	SAR	قامت الشركة باصدارها الثالث للصكوك وقد تم تحديد سعر الصكوك عند معدل 95 نقطة زيادة عن المعدل الرئيس.	2025-12-25 15:06:43.173145
5834	4230	توزيع أرباح نقدية	2010-05-18	\N	\N	\N	\N	SAR	اقرت الشركة توزيع أرباحا على المساهمين بواقع (2) ريال، بنسبة 20% من رأس المال عن السنة المالية المنتهية في 31/12/2009.	2025-12-25 15:06:43.173345
5835	4090	توزيع أرباح نقدية	2010-05-16	\N	\N	\N	\N	SAR	اقرت الشركة بتوزيع ارباح نقدية ربع سنوية عن الربع الأول من 2010 بواقع ( 0.30 ريال ) ثلاثين هللة للسهم الواحد.	2025-12-25 15:06:43.173534
5836	1214	بيع جزء من الشركة	2010-05-15	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 10.5 ملايين سهم تمثِّل 30% من إجمالي أسهم الشركة،	2025-12-25 15:06:43.173837
5837	2150	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2010-05-15	\N	\N	\N	\N	SAR	وافقت الجمعية على رفع رأس مال الشركة من 250 مليون ريال(25 مليون سهم) إلى 300مليون ريال (30مليون سهم)وذلك بإصدار 5 ملايين سهم بقيمة 50مليون ريال عن طريق منح سهم واحد مجاني مقابل كل خمسة أسهم قائمة	2025-12-25 15:06:43.174167
5838	4210	توزيع أرباح نقدية	2010-05-15	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 0.5 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم انعقاد الجمعية العامة.	2025-12-25 15:06:43.174485
5839	4020	توزيع أرباح نقدية	2010-05-15	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 0.75 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم الجمعية العامة.	2025-12-25 15:06:43.174793
5840	4190	توزيع أرباح نقدية	2010-05-12	\N	\N	\N	\N	SAR	وافق مجلس ادارة الشركة على توزيـع ارباح ( 92 ) مليون ريال لمساهمي الشركة ، بواقع 2,3 ريال للسهم الواحد ، وذلك كأرباح ربع سنوية من أرباح شركة جرير عن الربع الأول من العام المالي 2010م.	2025-12-25 15:06:43.17513
5841	7010	توزيع أرباح نقدية	2010-05-12	\N	\N	\N	\N	SAR	أقرت الشركة توزيع أرباح أولية مقدارها ( 1,500 ) مليون ريال عن الربع الأول من العام المالي 2010م بواقــع ( 0,75 ) ريال عن كل سهم ، وتعادل هذه الأرباح الموزعة ما نسبته ( 7,5 % ) من القيمة الاسمية للسهم.	2025-12-25 15:06:43.175497
5842	2060	توزيع أرباح نقدية	2010-05-12	\N	\N	\N	\N	SAR	اقرت الشركة بتوزيع أرباح على المساهمين لعام 2009م بواقع (75 هلله للسهم).	2025-12-25 15:06:43.175946
5843	4260	توزيع أرباح نقدية	2010-05-11	\N	\N	\N	\N	SAR	اقرات الشركة توزيع ارباح عن العام 2009 بواقع 20% من القيمة الاسمية للسهم بما يعادل 2 ريال للسهم الواحد.	2025-12-25 15:06:43.176282
5844	2070	توزيع أرباح نقدية	2010-05-05	\N	\N	\N	\N	SAR	اقرت الشركة بتوزيع (1,50) فقط ريال ونصف للسهم الواحد عن نتائج اعمال العام المالي 2009.	2025-12-25 15:06:43.176607
5845	3090	توزيع أرباح نقدية	2010-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 0.50 ريال للسهم الواحد للمساهمين المقيدين بالسجلات الرسمية للشركة بنهاية تداول يوم انعقاد الجمعية والتي تم انعقادها يوم الأحد 04/04/2010	2025-12-25 15:06:43.177125
5846	5110	توزيع أرباح نقدية	2010-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 70 هللة لكل سهم علماً أن أحقية الأرباح للمساهمين المالكين لأسهم الشركة بنهاية تداول يوم الاثنين 20/4/1431هـ الموافق 5/4/2010	2025-12-25 15:06:43.177454
5847	8030	توزيع أرباح نقدية	2010-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 7.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.75 ريال للسهم 	2025-12-25 15:06:43.177729
5848	1210	توزيع أرباح نقدية	2010-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع ريال لكل سهم علماً بأن أحقية الأرباح ستكون للمساهمين المقيدين في سجلات السوق المالية السعودية ( تداول ) يوم انعقاد الجمعية العامة العادية المنعقدة في يوم الأربعاء 14/04/2010	2025-12-25 15:06:43.177976
5849	2300	توزيع أرباح نقدية	2010-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 1.25 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة بنهايـة تداول يــوم انعقاد الجمعية العامة والتي انعقدت بمقر الشركة يوم الثلاثاء 21/04/1431هـ الموافق06/04/2010م	2025-12-25 15:06:43.178216
5850	6002	توزيع أرباح نقدية	2010-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العام للشركة على توزيع ارباح نقدية عن الربع الرابع من العام 2009 بواقع 0.75 ريال للسهم الواحد للمساهمين المقيدين بالسجلات الرسمية للشركة بنهاية تداول يوم انعقاد الجمعية العامة غير العادية والتي تم انعقادها يوم الاثنين 12/04/2010	2025-12-25 15:06:43.178463
5851	2080	توزيع أرباح نقدية	2010-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.50 ريال للسهم \r\n	2025-12-25 15:06:43.178715
5852	2060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2010-05-01	\N	\N	\N	\N	SAR	تم إضافة أسهم المنحة الخاصة لشركة التصنيع الوطنية (التصنيع) اليوم السبت 17/5/1431هـ الموافق 1/5/2010م، وذلك على أساس سهم واحد مجاني مقابل كل عشرة أسهم	2025-12-25 15:06:43.178952
5853	2010	توزيع أرباح نقدية	2010-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن العام 2009 بواقع 1.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم انعقاد الجمعية	2025-12-25 15:06:43.179202
5854	8040	زيادة رأس مال - إصدار حقوق أولوية	2010-05-01	\N	\N	\N	\N	SAR	ضاعفت الشركة رأسمالها بنسبة 100% من 100 مليون ريال الى 200 مليون ريال عن طريق اكتتاب المساهمين في اسهم حقوق أولوية بقيمة 12.5 ريال للسهم.	2025-12-25 15:06:43.179512
5855	2090	توزيع أرباح نقدية	2010-04-29	\N	\N	\N	\N	SAR	اقرت الشركة توزيع أرباح نقدية بواقع 2.5 ريال للسهم أي 25% من رأس المال.	2025-12-25 15:06:43.179752
5856	4001	توزيع أرباح نقدية	2010-04-28	\N	\N	\N	\N	SAR	وافق مجلس إدارة الشركة على توزيع الأرباح للعام 2009م بنسبة 25% من رأس المال بواقع (2.5) ريال للسهم الواحد وستكون أحقية الأرباح لملاك السهم كما في نهاية تداول يوم انعقاد الجمعية.	2025-12-25 15:06:43.179996
5857	4090	توزيع أرباح نقدية	2010-04-27	\N	\N	\N	\N	SAR	اقرت الشركة بتوزيع ارباح نقدية عن الربع الرابع من 2009 بواقع ( 0.30 ) ثلاثين هللة للسهم الواحد إعتباراً من يوم الثلاثاء 13/05/1431هـ الموافق 27/04/2010م.	2025-12-25 15:06:43.180261
5858	2050	توزيع أرباح نقدية	2010-04-27	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع أرباح نقدية بواقع 50 هللة للسهم الواحد	2025-12-25 15:06:43.180548
5859	6001	توزيع أرباح نقدية	2010-04-26	\N	\N	\N	\N	SAR	اقرت الشركة بتوزيع أرباح بواقع 1 ريال لكل سهم وبإجمالي قدره 28,571,430 ريال ما يمثل نسبته 10% من رأس المال وذلك للمساهمين المسجلين بسجلات السوق المالية السعودية (تداول) يوم 10/4/2010م.	2025-12-25 15:06:43.18079
5860	2280	توزيع أرباح نقدية	2010-04-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة لشركة المراعي على توصية مجلس الإدارة بتوزيع الأرباح للسنة المالية المنتهية في 31/12/2009م بواقع أربعة (4) ريال للسهم الواحد، بإجمالي قدره 460 مليون ريال.	2025-12-25 15:06:43.181027
5861	2050	توزيع أرباح نقدية	2010-04-26	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع أرباح نقدية بواقع 25 هللة للسهم الواحد	2025-12-25 15:06:43.181273
5862	2340	توزيع أرباح نقدية	2010-04-26	\N	\N	\N	\N	SAR	وافقت الشركة على توزيع بأن أرباح سنوية للعام المالي2009م بواقع (3.5) ريال للسهم الواحد سيتم توزيعها ابتداءً من يــوم الإثنين 12/05/1431هـ ( حسب تقويم أم القرى) الموافق 26/04/2010م.	2025-12-25 15:06:43.181514
5863	4002	توزيع أرباح نقدية	2010-04-25	\N	\N	\N	\N	SAR	وافقت الشركة على صرف الارباح النقدية عن النصف الثاني من العام 2009 اعتبارا من يوم الاحد 11/5/1431هـ الموافق 25/4/2010 م وفقا لقرار الجمعية العامة العادية بواقع (1) ريال واحد لكل سهم باجمالي قيمة 25 مليون ريال.	2025-12-25 15:06:43.181756
5864	7010	توزيع أرباح نقدية	2010-04-21	\N	\N	\N	\N	SAR	وافقت الشركة على على اقتراح مجلس الإدارة بتوزيع أرباح عن الربع الرابع من العام المالي 2009م بمقدار (75) هللة للسهم باحقية لمالك السهم بتاريخ 11/4/2010م.	2025-12-25 15:06:43.182002
5865	1212	توزيع أرباح نقدية	2010-04-21	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح على المساهمين بواقع ( 1,25 لكل سهم ) وبنسبة 12,5 % من رأس مال الشركة للسادة المساهمين المسجلين بسجلات تداول نهاية يوم انعقاد الجمعية.	2025-12-25 15:06:43.182241
5866	2240	توزيع أرباح نقدية	2010-04-21	\N	\N	\N	\N	SAR	وافق عمومية الشركة على اقتراح مجلس الإدارة بتوزيع أرباح نقدية بواقع (1.5) ريال للسهم الواحد أي بنسبة 15% من رأس المال ـ قبل زيادة رأس المال ـ و بأحقية لمالكي الأسهم بنهاية تداول يوم انعقاد الجمعية بتاريخ 31 مارس 2010.	2025-12-25 15:06:43.18248
5867	2320	توزيع أرباح نقدية	2010-04-20	\N	\N	\N	\N	SAR	وافقت الشركة على توزيع ارباح على مساهميها بواقع 1.5 ريال للعام 2009 بما يعادل 15% من القيمة الاسمية للسهم و تكون احقية الأرباح للمساهمين المقيدين بنهاية تداول يوم 29/03/2010م.	2025-12-25 15:06:43.182725
5868	4010	توزيع أرباح نقدية	2010-04-19	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الثاني من عام 2009 بواقع 90 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 4/4/2010م.	2025-12-25 15:06:43.182964
5869	8310	بيع جزء من الشركة	2010-04-17	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 12.8 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة البالغ 320 مليون ريال بما يمثل 40% من أسهم الشركة.	2025-12-25 15:06:43.183202
5870	2310	توزيع أرباح نقدية	2010-04-12	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع ريال واحد للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 27 مارس 2010.	2025-12-25 15:06:43.184042
5871	3040	توزيع أرباح نقدية	2010-04-12	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الثاني من عام 2009 بواقع 3 ريالات لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 24 مارس 2010.	2025-12-25 15:06:43.184282
5872	4030	توزيع أرباح نقدية	2010-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع (1) ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 3 أبريل 2010.	2025-12-25 15:06:43.184524
5873	3080	توزيع أرباح نقدية	2010-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 3 ريالات للسهم الواحد بنسبة (30%) من القيمة الإسمية للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 29 مارس 2010.	2025-12-25 15:06:43.184763
5895	1120	توزيع أرباح نقدية	2010-03-06	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الثانى من عام 2009 بواقع 1.50 ريال لكل سهم بنسبة 15% من القيمة الاسمية للسهم.	2025-12-25 15:06:43.190436
5874	8300	بيع جزء من الشركة	2010-04-10	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 3 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة بقيمة اسمية 10 ريال بما يمثل 30% من أسهم الشركة.	2025-12-25 15:06:43.185005
5875	7020	توزيع أرباح نقدية	2010-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 1.25 ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم انعقاد الجمعية العامة العادية في 17/03/2010م.	2025-12-25 15:06:43.185315
5876	4200	توزيع أرباح نقدية	2010-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 1.5 ريال للسهم الواحد.	2025-12-25 15:06:43.185545
5877	8290	بيع جزء من الشركة	2010-04-10	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 22.2 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة بقيمة اسمية 10 ريال بما يمثل 40% من أسهم الشركة.	2025-12-25 15:06:43.18575
5878	3030	توزيع أرباح نقدية	2010-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع الأرباح لعام 2009 بنسبة 35% من رأس المال المدفوع أي بواقع 3.5 ريال لكل سهم، وكانت أحقية صرف الأرباح لمالكي الأسهم في الشركة كما في نهاية تداول يوم انعقاد الجمعية بتاريخ 22 مارس 2010.	2025-12-25 15:06:43.185967
5879	2040	توزيع أرباح نقدية	2010-04-06	\N	\N	\N	\N	SAR	وافقت الجمعية العادية على توزيع أرباح نقدية على المساهمين بما يعادل 30% من رأس المال المدفوع بواقع 3 ريال للسهم الواحد وكانت أحقيتها للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم 22 مارس 2010.	2025-12-25 15:06:43.186172
5880	3010	توزيع أرباح نقدية	2010-04-04	\N	\N	\N	\N	SAR	وافق الجمعية العادية على توزيع أرباح نقدية عن النصف الثاني من عام 2009 بواقع (25 هللة) لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 21 مارس 2010.	2025-12-25 15:06:43.186375
5881	1080	توزيع أرباح نقدية	2010-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية العادية على توزيع أرباح عن عام 2009 بواقع (1) ريال للسهم الواحد ( وتمثل 10% من قيمة السهم الاسميَّة ) وذلك للمساهمين المقيدين في سجلات البنك بنهايَّة تداول يوم انعقاد الجمعية بتاريخ 21 مارس 2010.	2025-12-25 15:06:43.186598
5882	2240	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2010-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية غير العادية على اقتراح مجلس الإدارة بزيادة رأس المال من (450) مليون ريال إلى (600) مليون ريال وبنسبة زيادة قدرها 33% ليرتفع عدد الأسهم من (45) مليون سهم إلى (60) مليون سهم عادي وذلك عن طريق منح (1) سهم مجاني لكل (3) أسهم مملوكة للمساهمين المقيدون في سجل المساهمين بنهاية تداول يوم انعقاد الجمعية العمومية غير العادية بتاريخ 31 مارس.	2025-12-25 15:06:43.186828
5883	2360	توزيع أرباح نقدية	2010-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية لعام 2009 بواقع 2.25 ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 15 مارس 2010	2025-12-25 15:06:43.187034
5884	2020	توزيع أرباح نقدية	2010-04-01	\N	\N	\N	\N	SAR	وافقت الجمعية العادية على توزيع أرباح نقدية عن النصف الثاني من عام 2009بواقع 7 ريالات لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 20 مارس 2010.	2025-12-25 15:06:43.187245
5885	8010	توزيع أرباح نقدية	2010-03-31	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 40% من رأس المال (أو من القيمة الاسمية) بواقع 4 ريال للسهم \r\n	2025-12-25 15:06:43.187477
5886	2370	توزيع أرباح نقدية	2010-03-31	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية للشركة فى 22 مارس على توزيع أرباح أرباح نقدية بواقع (1) ريال للسهم الواحد بإجمالي مبلغ وقدره 40 مليون ريال.	2025-12-25 15:06:43.187694
5887	1320	توزيع أرباح نقدية	2010-03-30	\N	\N	\N	\N	SAR	أقرت الجمعية العامة العادية الثالثة توزيع أرباح عن عام 2009 بواقع 2 ريال للسهم الواحد بإجمالي مبلغ وقدره 102 مليون ريال.	2025-12-25 15:06:43.187904
5888	2330	توزيع أرباح نقدية	2010-03-29	\N	\N	\N	\N	SAR	وافق مجلس الأدارة على توزيع أرباح نقدية عن النصف الثانى من عام 2009 بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة بنهاية تداول يوم إنعقاد الجمعية بتاريخ 9/3/2010م.	2025-12-25 15:06:43.188107
5889	3060	توزيع أرباح نقدية	2010-03-20	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على صرف الأرباح المقترحة لعـام 2009 م بواقع 3 ريال للسهم وبنسبة 30 % من رأس المال المدفوع	2025-12-25 15:06:43.188313
5890	1050	توزيع أرباح نقدية	2010-03-20	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع ريال واحد لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم الأحد 21/3/1431هـ الموافق 7/3/2010م	2025-12-25 15:06:43.188515
5891	3050	توزيع أرباح نقدية	2010-03-20	\N	\N	\N	\N	SAR	أقر مجلس الإدارة توزيع أرباح نقدية عن النصف الثانى من عام 2009 بواقع 2.5 ريال لكل سهم.	2025-12-25 15:06:43.188727
5892	3020	توزيع أرباح نقدية	2010-03-13	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الثانى من عام 2009 بواقع 2 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة بنهاية يوم انعقاد الجمعية العامة.	2025-12-25 15:06:43.18895
5893	1010	توزيع أرباح نقدية	2010-03-10	\N	\N	\N	\N	SAR	وافقت الجمعية العادية على اقتراح مجلس الإدارة بتوزيع أرباح نقدية عن النصف الثانى من عام 2009 وذلك بواقع 70هللة لكل سهم.	2025-12-25 15:06:43.189173
5894	6070	توزيع أرباح نقدية	2010-03-10	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2009 بواقع 2 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 3 مارس 2010.	2025-12-25 15:06:43.189418
5896	1090	توزيع أرباح نقدية	2010-02-28	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع ربح وقدرة خمس وسبعون هللة للسهم إضافة إلى المبلغ الذي تم توزيعه عن النصف الأول من السنة وقدرة 90 هلله للسهم الواحد بحيث يصبح إجمالي الربح 1.65 ريال	2025-12-25 15:06:43.190754
5897	4190	توزيع أرباح نقدية	2010-02-21	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية ربع سنوية من عام 2009 بواقع 2.3 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم الأحد 14/02/2010م.	2025-12-25 15:06:43.191947
5898	3020	شراء نسبة من شركة	2010-02-21	\N	\N	\N	\N	SAR	قامت الشركة بشراء 20% الشركة اليمنية السعودية بحصة تصل إلى 20 مليون دولار (75 مليون ريال سعودي) من رأس المال وسيتم تمويل حصة شركة اسمنت اليمامة السعودية من التدفقات النقدية المتولدة من نشاط أعمالها.	2025-12-25 15:06:43.192218
5899	1213	بيع جزء من الشركة	2010-02-17	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 9 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 300 مليون ريال بقيمة اسمية 10 ريال بما يمثل 30% من أسهم الشركة.	2025-12-25 15:06:43.200377
5900	4280	تخفيض رأس مال - بتخفيض عدد الأسهم	2010-02-13	\N	\N	\N	\N	SAR	وافقت الجمعية غير العادية على تخفيض راس مال الشركة من63 مليار ريال الى 37.05 مليار ريال وبالتالي تخفيض عدد أسهم الشركة(6,300,000,000) سهم الى (3,705,882,300) سهم. بمعدل تخفيض سهم واحد لكل 1,7 سهم، وذلك لإطفاء خسائر الشركة	2025-12-25 15:06:43.200642
5901	2270	توزيع أرباح نقدية	2010-02-07	\N	\N	\N	\N	SAR	قرر مجلس الإدارة توزيع أرباح إستثنائية عن فترة التسعة أشهر المنتهية في 31/12/2009م قدرها 48.75 مليون ريال والتي تمثل 15% من إجمالي رأسمال الشركة، بواقع (1.5 ريال) للسهم الواحد.	2025-12-25 15:06:43.967316
5902	6002	بيع جزء من الشركة	2010-01-27	\N	\N	\N	\N	SAR	تمت إضافة أسهم الاكتتاب فى محافظ المكتتبين وذلك حسب الأسهم المخصصة لكل مكتتب حيث قامت الشركة بطرح 8.1 مليون سهم للاكتتاب العام تمثل (30%) من أسهم الشركة.	2025-12-25 15:06:43.968282
5903	2070	زيادة رأس مال - إصدار حقوق أولوية	2010-01-23	\N	\N	\N	\N	SAR	وافقت الجمعية غير العادية للشركة على زيادة رأس المال من 600 مليون ريال الى 784.3 مليون ريال وذلك عن طريق أسهم حقوق الأولوية، وتم إيداع الأسهم بتاريخ 23/1/2010م.	2025-12-25 15:06:43.969136
5904	1040	اصدار صكوك	2010-01-23	\N	\N	\N	\N	SAR	أصدر البنك الإصدار الثاني من الصكوك بفئة 100,000 ريال بقيمة 725 مليون ريال وتم إضافتها اليوم السبت الموافق 23/1/2010 فى المحاظ الأستثمارية .	2025-12-25 15:06:43.969553
5905	2230	توزيع أرباح نقدية	2010-01-09	\N	\N	\N	\N	SAR	قامت شركة الكيميائية السعودية بتوزيع أرباح عن الربع الثالث من العام 2009 بمبلغ (158,100,000ريال) لمساهمي الشركة بواقع (2.50ريال للسهم الواحد).	2025-12-25 15:06:43.969922
5906	2180	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2010-01-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية غير العادية على زيادة رأس مال الشركة إلى 115 مليون ريال وذلك عن طريق منح أسهم مجانية بواقع سهم لكل 1.4864 سهم	2025-12-25 15:06:43.970237
5907	1212	استحواذ على شركة	2009-11-24	\N	\N	\N	\N	SAR	قامت الشركة بالإستحواذ على 51% من شركة التنمية لصناعة الحديد وذلك بشراء جزء من حصة شركة المسيرة الدولية وهي الشريك الرئيسي في الشركة بمبلغ 225 مليون ريال	2025-12-25 15:06:43.970565
5908	1320	زيادة حصة الشركة فى شركة تابعة	2009-11-23	\N	\N	\N	\N	SAR	قامت الشركة برفع حصتها في مشروع مصنع الأقطار الكبيرة (الشركة العالمية للأنابيب المحدودة) من 25% إلى 35%.	2025-12-25 15:06:43.970857
5909	3040	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-11-21	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال الشركة من 450 مليون ريال الى 900 مليون ريال وذلك بمنح سهم واحد مجاني مقابل كل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 16 نوفمبر 2009.	2025-12-25 15:06:43.971203
5910	7010	توزيع أرباح نقدية	2009-11-11	\N	\N	\N	\N	SAR	وافق مجلس الادارة على توزيع أرباح نقدية عن الربع الثالث من عام 2009 بواقع 75 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 28 أكتوبر 2009	2025-12-25 15:06:43.971488
5911	4190	توزيع أرباح نقدية	2009-11-10	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الثالث من عام 2009 بواقع 1.7 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 3 نوفمبر 2009	2025-12-25 15:06:43.971853
5912	7040	تغيير السنة المالية	2009-11-02	\N	\N	\N	\N	SAR	وافقت الجمعية على غير العادية على تغيير السنة المالية للشركة لتبدأ من أول شهر أبريل وتنتهي في 31 مارس من السنة الميلادية التالية على أن تبدأ السنة المالية الأولى بعد التأسيس من تاريخ القرار الوزاري الصادر بالموافقة على اعلان التأسيس وتنتهي في 31 مارس 2010 .	2025-12-25 15:06:43.978198
5913	2050	توزيع أرباح نقدية	2009-11-01	\N	\N	\N	\N	SAR	قام مجلس إدارة مجموعة صافولا اليوم بصرف الارباح الموزعة على المساهمين وقدرها 125 مليون ريال عن الربع الثالث من العام المالي 2009م (أي بواقع (0.25 ريال) للسهم الواحد.	2025-12-25 15:06:43.978603
5914	8270	بيع جزء من الشركة	2009-10-31	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 5.2 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 130 مليون ريال بما يمثل 40% من أسهم الشركة.	2025-12-25 15:06:43.978928
5935	2330	تغيير اسم الشركة	2009-08-05	\N	\N	\N	\N	SAR	قامت الشركة بتغيير اسمها من (شركة البولي بروبلين المتقدمة سابقاً ) إلى ( الشركة المتقدمة للبتروكيماويات) .	2025-12-25 15:06:44.002303
5915	8260	بيع جزء من الشركة	2009-10-31	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 8 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 200 مليون ريال بما يمثل 40% من أسهم الشركة.	2025-12-25 15:06:43.979264
5916	8280	بيع جزء من الشركة	2009-10-31	\N	\N	\N	\N	SAR	أعلنت الشركة عن بيع 30% من أسهمها عن طريق  طرح 6 مليون سهم للاكتتاب العام 	2025-12-25 15:06:43.996047
5917	4090	توزيع أرباح نقدية	2009-10-20	\N	\N	\N	\N	SAR	وافق مجلس الادارة على توزيع أرباح نقدية عن الربع الثالث من عام 2009 بواقع 30 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 سبتمبر 2009.	2025-12-25 15:06:43.99646
5918	2280	زيادة رأس مال - اكتتاب خاص	2009-10-17	\N	\N	\N	\N	SAR	وافقت الجمعية غير العادية للشركة على زيادة رأس المال من 1090 مليون ريال إلى 1150 مليون ريال بغرض الاستحواذ على كامل أسهم شركة هادكو	2025-12-25 15:06:43.996783
5919	2280	استحواذ على شركة	2009-10-15	\N	\N	\N	\N	SAR	وافقت الجمعية غير العادية للشركة على الاستحواذ على 100% من أسهم شركة حائل للتنمية الزراعية "هادكو" وذلك عن طريق زيادة رأس مال الشركة إلى 1150 مليون ريال	2025-12-25 15:06:43.997107
5920	4070	توزيع أرباح نقدية	2009-10-06	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن العام 2008/2009 بواقع 1.2 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 26 أغسطس 2009.	2025-12-25 15:06:43.99749
5921	2280	استحواذ على شركة	2009-09-30	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على 100% من أسهم الشركة الدولية لمشروعات التصنيع الزراعي بيتي في جمهورية مصر العربية وبلغت قيمة الصفقة 645 مليون جنيه مصري (430 مليون ريال سعودي تقريباً).	2025-12-25 15:06:43.997855
5922	2260	زيادة رأس مال - إصدار حقوق أولوية	2009-09-17	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال الشركة من 1.87 مليار ريال إلى 2.92 مليار ريال، بزيادة نسبتها 56.02%،عن طريق أسهم حقوق أولوية بقيمة 1.05 مليار ريال، وذلك لمساهمي الشركة المقيدين بسجلاتها حتى نهاية تداول يوم 22 أغسطس2009.	2025-12-25 15:06:43.998168
5923	4010	توزيع أرباح نقدية	2009-09-13	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 60 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 26 أغسطس 2009.	2025-12-25 15:06:43.998486
5924	8080	زيادة رأس مال - إصدار حقوق أولوية	2009-09-07	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال الشركة من 100 مليون ريال إلى 340 مليون ريال أى بنسبة زيادة(240% ) وذلك عن طريق أسهم حقوق أولوية بمعدل 2.4 سهم مقابل كل سهم يملكه أى من المساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 8 أغسطس 2009	2025-12-25 15:06:43.998823
5925	4002	بيع جزء من الشركة	2009-08-29	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 7.5 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 250 مليون ريال بما يمثل 30% من أسهم الشركة.	2025-12-25 15:06:43.99918
5926	3040	توزيع أرباح نقدية	2009-08-22	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 3 ريالات لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 29 يوليو 2009.	2025-12-25 15:06:43.999477
5927	1210	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-08-22	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال الشركة من 220 مليون ريال إلى 275 مليون ريال وذلك عن طريق توزيع أسهم منحة بواقع 1 سهم لكل 4 أسهم للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 18 أغسطس 2009.	2025-12-25 15:06:43.999786
5928	3010	توزيع أرباح نقدية	2009-08-22	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 1 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 29 يوليو 2009.	2025-12-25 15:06:44.000105
5929	4190	توزيع أرباح نقدية	2009-08-18	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثانى من عام 2009 بواقع 1.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 11 أغسطس 2009.	2025-12-25 15:06:44.000426
5930	4100	توزيع أرباح نقدية	2009-08-18	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 12 أغسطس 2009	2025-12-25 15:06:44.000749
5931	7010	توزيع أرباح نقدية	2009-08-12	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الثانى لعام 2009 بواقع 0.75 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 29 يوليو 2009.	2025-12-25 15:06:44.001045
5932	2330	توزيع أرباح نقدية	2009-08-11	\N	\N	\N	\N	SAR	وافق مجلس الأدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 25 يوليو 2009.	2025-12-25 15:06:44.00137
5933	4150	توزيع أرباح نقدية	2009-08-09	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 25 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 5 يوليو 2009	2025-12-25 15:06:44.001683
5934	2160	تأسيس شركة	2009-08-05	\N	\N	\N	\N	SAR	أنتهت الشركة من تأسيس "شركة أميانتيت البحرين القابضة المحدودة" براسمال قدرة 1 مليون دينار بحريني اي ما يعادل 10 مليون ريال سعودي، تبلغ نسبة ملكية أميانتيت المباشرة وغير المباشرة 100%.	2025-12-25 15:06:44.002004
5936	3020	توزيع أرباح نقدية	2009-08-03	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 1 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 20 يوليو 2009.	2025-12-25 15:06:44.004544
5937	2110	استحواذ على شركة	2009-08-02	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على نسبة 79% من أسهم شركة اليمسان التركية بمبلغ وقدره 123.75 مليون ريال سعودي\r\n	2025-12-25 15:06:44.016565
5938	2050	توزيع أرباح نقدية	2009-08-02	\N	\N	\N	\N	SAR	وافق مجلس الأدارة على توزيع أرباح نقدية عن الربع الثانى من عام 2009 بواقع 25 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 22 يوليو 2009.	2025-12-25 15:06:44.016948
5939	6001	توزيع أرباح نقدية	2009-08-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة للشركة على توزيع أرباح نصف سنوية للمساهمين من الأرباح المبقاة في الشركة وذلك بواقع 0.75 ريال للسهم الواحد لمساهمي الشركة المسجلين بسجلات السوق المالية السعودية (تداول) يوم 15/07/2009.	2025-12-25 15:06:44.017286
5940	3090	توزيع أرباح نقدية	2009-08-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة للشركة على صرف أرباح عن النصف الأول من العام 2009 اعتبارا من اليوم وذلك بواقع 75هللة للسهم الواحد حسب أحقية الأرباح للمساهمين المقيدين بالسجلات الرسمية للشركة لدى السوق المالية( تداول) بنهاية تداول يوم الأربعاء 22/07/1430هـ الموافق 15/07/2009م.	2025-12-25 15:06:44.017641
5941	1060	توزيع أرباح نقدية	2009-07-27	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 83 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 20 يوليو 2009.	2025-12-25 15:06:44.017977
5942	1120	توزيع أرباح نقدية	2009-07-26	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 1.25 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 يوليو 2009.	2025-12-25 15:06:44.018308
5943	2020	توزيع أرباح نقدية	2009-07-25	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009م بواقع 5 ريالات لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 15 يوليو 2009.	2025-12-25 15:06:44.018646
5944	1090	توزيع أرباح نقدية	2009-07-22	\N	\N	\N	\N	SAR	أقر مجلس إدارتها توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 90 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 11 يوليو 2009.	2025-12-25 15:06:44.018955
5945	1210	توزيع أرباح نقدية	2009-07-21	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 30 يونيو 2009.	2025-12-25 15:06:44.019287
5946	4090	توزيع أرباح نقدية	2009-07-21	\N	\N	\N	\N	SAR	أقر مجلس الإدارة على توزيع أرباح نقدية عن الربع الثانى من عام 2009 بواقع 30 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 يونيو 2009.	2025-12-25 15:06:44.01961
5947	3050	توزيع أرباح نقدية	2009-07-21	\N	\N	\N	\N	SAR	أقر مجلس الإدارة توزيع أرباح نقدية عن النصف الأول من عام 2009 بواقع 2.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 13 يوليو 2009.	2025-12-25 15:06:44.019919
5948	1010	توزيع أرباح نقدية	2009-07-20	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2009 وذلك بواقع 60 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 12 يوليو 2009.	2025-12-25 15:06:44.020236
5949	1320	بيع جزء من الشركة	2009-07-18	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 16 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة بما يمثل 31.4% من أسهم الشركة.	2025-12-25 15:06:44.020602
5950	4300	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-07-11	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أسهم منحة بواقع سهم مقابل كل سهمين ليزيد أسهم الشركة بذلك من 720 مليون سهم إلى 1080 مليون سهم وكانت أحقية الأسهم للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 7 يوليو 2009.	2025-12-25 15:06:44.020925
5951	5110	اصدار صكوك	2009-07-07	\N	\N	\N	\N	SAR	قامت الشركة باصدارها الثاني للصكوك بقيمة إجمالية بلغت 7 مليارات ريال وبسعر عائد على الصكوك عند معدل 160 نقطة أساس زيادة عن المعدل الرئيسي	2025-12-25 15:06:44.021248
5952	4150	توزيع أرباح نقدية	2009-06-22	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 31 مارس 2009.	2025-12-25 15:06:44.021557
5953	2310	بيع جزء من الشركة	2009-06-22	\N	\N	\N	\N	SAR	قامت الشركة ببيع 11% من أسهم كل من الشركة العالمية للأسيتيل والشركة العالمية لخلات الفينيل، وبقيمة إجمالية قدرها مائتين وأربعون (240) مليون ريال سعودي.	2025-12-25 15:06:44.021854
5954	1310	توزيع أرباح نقدية	2009-06-16	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 26 مايو 2009.	2025-12-25 15:06:44.022156
5955	4190	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-06-06	\N	\N	\N	\N	SAR	وافقت الجمعية على زيـادة رأس مـال الشـركة من 300 مليون ريال الى 400 مليون ريال وذلك بمنح سهم واحد مجاني لكل ثلاثة أسهم ليرتفع عدد أسهم الشركة من ( 30 ) مليون سهم الى ( 40 ) مليون سهم.	2025-12-25 15:06:44.022475
5956	2280	بيع شركة تابعة	2009-06-06	\N	\N	\N	\N	SAR	قامت الشركة بنقل ملكية أسهمها في "شركة طيبة للإستثمار" والبالغة 75% بقيمة التكلفة إلى ملكية "الشركة العالمية للألبان والعصائر" والتي تمتلك شركة المراعي 48% من أسهمها.	2025-12-25 15:06:44.022809
5957	1310	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-05-30	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أسهم منحة بواقع سهم لكل 4 أسهم مما أدى إلى زيادة رأس مال الشركة من 100 مليون سهم إلى 125 مليون سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 26 مايو 2009	2025-12-25 15:06:44.046444
5958	2120	توزيع أرباح نقدية	2009-05-26	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 5 مايو 2009	2025-12-25 15:06:44.046968
5959	8220	بيع جزء من الشركة	2009-05-23	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 8 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 200 مليون ريال بما يمثل 40% من أسهم الشركة.	2025-12-25 15:06:44.047273
5960	4190	توزيع أرباح نقدية	2009-05-20	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الأول لعام 2009 بواقع 2.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 13 مايو 2009.	2025-12-25 15:06:44.053135
5961	4230	توزيع أرباح نقدية	2009-05-20	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 3.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 25 أبريل 2009.	2025-12-25 15:06:44.054231
5962	4001	توزيع أرباح نقدية	2009-05-20	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 27 أبريل 2009.	2025-12-25 15:06:44.054991
5963	7010	توزيع أرباح نقدية	2009-05-20	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن الربع الأول لعام 2009 بواقع 0.75 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 29 أبريل 2009.	2025-12-25 15:06:44.055935
5964	4260	توزيع أرباح نقدية	2009-05-18	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1.75 ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 أبريل 2009.	2025-12-25 15:06:44.057605
5965	2220	توزيع أرباح نقدية	2009-05-17	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم 26 أبريل 2009.	2025-12-25 15:06:44.058687
5966	2110	توزيع أرباح نقدية	2009-05-17	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 75 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 16 أبريل 2009.	2025-12-25 15:06:44.059431
5967	4300	اصدار صكوك	2009-05-16	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على الإصدار الثالث للصكوك إسلامية للشركة بقيمة 750 مليون ريال سعودى يبلغ أجلها 5 سنوات تستحق في 2014م.	2025-12-25 15:06:44.060853
5968	8250	بيع جزء من الشركة	2009-05-16	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 8 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 200 مليون ريال بما يمثل 40% من أسهم الشركة.	2025-12-25 15:06:44.062064
5969	8240	بيع جزء من الشركة	2009-05-16	\N	\N	\N	\N	SAR	تمت إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 4 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 100 مليون ريال بما يمثل 40% من أسهم الشركة.	2025-12-25 15:06:44.063332
5970	8230	بيع جزء من الشركة	2009-05-16	\N	\N	\N	\N	SAR	تم إضافة أسهم الاكتتاب فى محافظ المكتتبين حيث كانت الهيئة قد وافقت على طرح 6 مليون سهم للاكتتاب العام من إجمالى رأس مال الشركة الذى يبلغ 200 مليون ريال بما يمثل 30% من أسهم الشركة.	2025-12-25 15:06:44.064544
5971	2160	توزيع أرباح نقدية	2009-05-16	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 19 أبريل 2009.	2025-12-25 15:06:44.065682
5972	2030	توزيع أرباح نقدية	2009-05-11	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 18 أبريل 2009	2025-12-25 15:06:44.066728
5973	2150	توزيع أرباح نقدية	2009-05-11	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 20 أبريل 2009	2025-12-25 15:06:44.067397
5974	2070	توزيع أرباح نقدية	2009-05-05	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بوقع واحد ونصف ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة وحملة شهادات الأسهم في نهاية تداول يوم الأربعاء 19/4/1430هـ الموافق 15/4/2009م	2025-12-25 15:06:44.067844
5975	2090	توزيع أرباح نقدية	2009-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 2.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 1 أبريل 2009	2025-12-25 15:06:44.068433
5976	2220	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية غير العادية على توزيع أسهم منحة بواقع سهم لكل أربعة أسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 26 أبريل 2009 مما ترتب عليه زيادة رأس المال من 204.45 مليون ريال إلى 255.56 مليون ريال.	2025-12-25 15:06:44.068906
5977	4020	توزيع أرباح نقدية	2009-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 8 أبريل 2009.	2025-12-25 15:06:44.069429
5978	6040	توزيع أرباح نقدية	2009-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:44.070315
5979	2050	توزيع أرباح نقدية	2009-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الأول من عام 2009 بواقع 25 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تدالول يوم 18 أبريل 2009.	2025-12-25 15:06:44.07144
5980	4090	توزيع أرباح نقدية	2009-04-29	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الأول من عام 2009 بواقع 30هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 31 مارس 2009.	2025-12-25 15:06:44.072428
5981	4080	توزيع أرباح نقدية	2009-04-29	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 8 أبريل 2009.	2025-12-25 15:06:44.072918
5982	1212	توزيع أرباح نقدية	2009-04-29	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 12 أبريل 2009.	2025-12-25 15:06:44.073392
5983	5110	توزيع أرباح نقدية	2009-04-28	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 70 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 6 أبريل 2009.	2025-12-25 15:06:44.073739
5984	4090	توزيع أرباح نقدية	2009-04-28	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الرابع من عام 2008 بواقع 20 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 7 أبريل 2009	2025-12-25 15:06:44.074216
5985	2320	توزيع أرباح نقدية	2009-04-27	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 31 مارس 2009.	2025-12-25 15:06:44.076625
5986	4040	توزيع أرباح نقدية	2009-04-26	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 50 هللة لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 5 أبريل 2009.	2025-12-25 15:06:44.077212
5987	6010	توزيع أرباح نقدية	2009-04-25	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن عام 2008 بواقع 75 هلله لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 18 أبريل 2009.	2025-12-25 15:06:44.0779
5988	3040	توزيع أرباح نقدية	2009-04-25	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الثانى من عام 2008 بواقع 5 ريالات لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 8 أبريل 2009.	2025-12-25 15:06:44.078508
5989	2010	توزيع أرباح نقدية	2009-04-25	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الثانى من عام 2008 بواقع 1.25 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 11 أبريل 2009.	2025-12-25 15:06:44.07937
5990	2050	توزيع أرباح نقدية	2009-04-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 2.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.25 ريال للسهم \r\n	2025-12-25 15:06:44.080443
5991	1020	توزيع أرباح نقدية	2009-04-25	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 50 هلله لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 أبريل 2009.	2025-12-25 15:06:44.081391
5992	2370	توزيع أرباح نقدية	2009-04-22	\N	\N	\N	\N	SAR	قامت شركة الشرق الأوسط للكابلات المتخصصة (مسك) بصرف الأرباح التي أقرت توزيعها الجمعية العامة العادية المنعقدة مساء الثلاثاء 4/4/1430هـ الموافق 31/3/2009م وذلك بواقع 1.2 ريال للسهم اليوم 26/4/1430هـ الموافق 22/4/2009م عن طريق بنك ساب بجميع فروعه.	2025-12-25 15:06:44.081978
5993	7010	توزيع أرباح نقدية	2009-04-22	\N	\N	\N	\N	SAR	قامت شركة الاتصالات السعودية بتوزيع أرباح عن الربع الرابع من العام المالي 2008م بمقدار (75 هللة) للسهم كانت أحقيتها للمساهمين المقيدين في سجلات (تداول) بنهاية تداول يوم انعقاد الجمعية العامة .	2025-12-25 15:06:44.082937
5994	2240	توزيع أرباح نقدية	2009-04-21	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 1.5 ريال لكل سهم ذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 31 مارس 2009.	2025-12-25 15:06:44.083674
5995	2300	توزيع أرباح نقدية	2009-04-20	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع ريال واحد لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 2 أبريل 2009.	2025-12-25 15:06:44.084432
5996	4140	توزيع أرباح نقدية	2009-04-20	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع ريال واحد لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 23 مارس 2009.	2025-12-25 15:06:44.085034
5997	2160	زيادة حصة الشركة فى شركة تابعة	2009-04-19	\N	\N	\N	\N	SAR	قامت الشركة بتوقيع عقد شراء حصص شريك الأقلية في الشركة العربية السعودية لصناعة أنابيب حديد الدكتايل المحدودة (ساديب) والبالغة نسبتها 5% من رأس المال بقيمة 11 مليون ريال.	2025-12-25 15:06:44.085733
5998	2310	توزيع أرباح نقدية	2009-04-18	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع ريال واحد للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 4 أبريل 2009.	2025-12-25 15:06:44.086396
5999	1050	توزيع أرباح نقدية	2009-04-18	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع ريال واحد لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 6 أبريل 2009.	2025-12-25 15:06:44.087304
6000	6090	توزيع أرباح نقدية	2009-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 50 هلله لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 23 مارس 2009.	2025-12-25 15:06:44.087914
6001	7020	توزيع أرباح نقدية	2009-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 75 هلله للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 21 مارس 2009.	2025-12-25 15:06:44.834123
6002	4210	توزيع أرباح نقدية	2009-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 2 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 25 مارس 2009	2025-12-25 15:06:44.835363
6003	4270	توزيع أرباح نقدية	2009-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1.5 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 24 مارس 2009.	2025-12-25 15:06:44.835889
6004	4030	توزيع أرباح نقدية	2009-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1.5 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 مارس 2009.	2025-12-25 15:06:44.836238
6005	4200	توزيع أرباح نقدية	2009-04-13	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008م بواقع (1.5) ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 14 مارس 2009.	2025-12-25 15:06:44.836682
6006	4010	توزيع أرباح نقدية	2009-04-13	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008م بواقع 1.2 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 مارس 2009.	2025-12-25 15:06:44.836991
6007	2080	توزيع أرباح نقدية	2009-04-12	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع 1.5 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 25 مارس 2009.	2025-12-25 15:06:44.837293
6008	2060	توزيع أرباح نقدية	2009-04-12	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2008 بواقع ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 28 مارس 2009 .	2025-12-25 15:06:44.837574
6009	1050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية غير العادية على توزيع أسهم منحة بواقع سهمين مقابل كل سبعة أسهم لمساهمين الشركة حتى نهاية تداول يوم 6 أبريل 2009 مما ترتب عليه زيادة رأسمال البنك من 5.625.000.000 ريال إلى 7.232.143.000 ريال.	2025-12-25 15:06:44.838284
6010	2360	توزيع أرباح نقدية	2009-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 22.5% من رأس المال (أو من القيمة الاسمية) بواقع 2.25 ريال للسهم \r\n	2025-12-25 15:06:44.886935
6011	2050	زيادة حصة الشركة فى شركة تابعة	2009-04-08	\N	\N	\N	\N	SAR	أتمت المجموعة جميع الإجراءات القانونية المتعلقة بصفقة شراء حصة 5% إضافية في رأسمال شركة صافولا للأغذية وبذلك تكون شركة صافولا قد رفعت ملكيتها في رأسمال الشركة من 85% إلى 90% هذا وقد بلغت قيمة الصفقة 167 مليون ريال تم تمويلها ذاتياً.	2025-12-25 15:06:44.890787
6012	6001	توزيع أرباح نقدية	2009-04-08	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع (1.5) ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 29 مارس 2009.	2025-12-25 15:06:44.891335
6013	2280	توزيع أرباح نقدية	2009-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح للسنة المالية المنتهية في 31/12/2008م بمعدل 3.50 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 23 مارس 2009	2025-12-25 15:06:44.891717
6014	3080	توزيع أرباح نقدية	2009-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 3 ريالات للسهم الواحد بنسبة (30?) من القيمة الإسمية للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 مارس 2009.	2025-12-25 15:06:44.892037
6015	1040	توزيع أرباح نقدية	2009-04-06	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية على المساهمين بواقع (0.75) ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 24 مارس 2009.	2025-12-25 15:06:44.892746
6016	3010	توزيع أرباح نقدية	2009-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الثانى من عام 2008 بواقع 2 ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 22 مارس 2009.	2025-12-25 15:06:44.894827
6017	2040	توزيع أرباح نقدية	2009-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية على المساهمين بما يعادل 25% من رأس المال المدفوع بواقع ريالين ونصف للسهم الواحد كانت أحقيتها للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 22 مارس 2009.	2025-12-25 15:06:44.895421
6018	2320	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس المال من 270مليون ريال الى 405 مليون ريال وذلك عن طريق منح ( سهم ) مجانى مقابل كل ( سهمين ) يملكها المساهمون بنهاية يوم انعقاد الجمعية الموافق 31 مارس 2008.	2025-12-25 15:06:44.895974
6019	1080	توزيع أرباح نقدية	2009-04-04	\N	\N	\N	\N	SAR	توزيع أرباح عام 2008م بواقع (1) ريال للسهم الواحد ( وتمثل 10% من قيمة السهم الاسميَّة ) وفقاً لتلك التوصيَّة التي قررت الجمعيَّة منحها للمُساهمين القائمين في سجلات البنك بنهايَّة تداول يوم 22/3/2009م.	2025-12-25 15:06:44.896593
6020	3030	توزيع أرباح نقدية	2009-04-04	\N	\N	\N	\N	SAR	توزيع الأرباح لعام 2008م بنسبة 35% من رأس المال المدفوع أي بواقع 3.5 ريال لكل سهم على ان تكون احقيه صرف هذه الأرباح لمالكي الأسهم في الشركة كما في نهاية تداول يوم انعقاد الجمعية على ان يبدأ صرف الأرباح بتاريخ 8 ربيع الثاني1430هجرية الموافق 04/4/2009 .	2025-12-25 15:06:44.897283
6021	2020	توزيع أرباح نقدية	2009-04-01	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الثانى من عام 2008 بواقع 7 ريالات لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 23 مارس 2009.	2025-12-25 15:06:44.897866
6022	1040	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-03-28	\N	\N	\N	\N	SAR	تم إضافة أسهم المنحة الخاصة للبنك السعودي الهولندي اليوم السبت 1/4/1430هـ الموافق 28/3/2009م، وذلك على أساس سهم لكل أربعة أسهم قائمة لملاك أسهم الشركة كما في نهاية تداول يوم الثلاثاء 27/3/1430هـ الموافق 24/3/2009	2025-12-25 15:06:44.898225
6023	3060	توزيع أرباح نقدية	2009-03-28	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح نقدية بواقع 4 ريال للسهم	2025-12-25 15:06:44.89852
6024	8010	توزيع أرباح نقدية	2009-03-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع أرباح نقدية بواقع 2 ريال للسهم الواحد وبإجمالى قدره 100 مليون ريال مليون ريال وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 10 مارس 2009 وتوزع الأرباح عن طريق التحويل للحساب.	2025-12-25 15:06:44.898856
6025	3020	توزيع أرباح نقدية	2009-03-23	\N	\N	\N	\N	SAR	الموافقة على اقتراح مجلس الإدارة بشأن توزيع الأرباح لعام 2008 م بواقع ( 2 ) ريال للسهم الواحد وسيكون الصرف بإذن الله يوم الاثنين 23 مارس 2009م الموافق 26 ربيع الاول 1430هـ علماً بأن أحقية الأرباح عن عام 2008م بعد موافقة الجمعية العمومية للمساهمين المسجلين في سجل مساهمي الشركة (مـــــالكي الأسهم ) في نهاية تداول يوم انعقاد الجمعية العمومية في 09/ مارس/ 2009م	2025-12-25 15:06:44.899229
6026	4190	توزيع أرباح نقدية	2009-03-23	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع ارباح عن النصف السنوى الثانى من العام المالى 2008 بمقدار (4.5) ريال للسهم الواحد بالإضافه الى ما تم توزيعه عن النصف السنوى الاول من العام 2008 البالغ (4.5) ريال للسهم بحيث يصبح إجمالى الربح الموزع عن العام المالى 2008م (9) ريال للسهم الواحد بنسبة 90? من رأس مال الشـركة	2025-12-25 15:06:44.899601
6027	3050	توزيع أرباح نقدية	2009-03-14	\N	\N	\N	\N	SAR	تعلن شركة أسمنت المنطقة الجنوبية عن توزيع الأرباح عن عام 2008م حسب اقتراح مجلس الإدارة بنسبة 50 % على رأس المال المدفوع بواقع (5) ريالات للسهم الواحد والتي سبق صرف (3) ثلاثة ريالات منها في النصف الأول من العام ويتم صرف (2) ريال للسهم الواحد عن النصف الثاني	2025-12-25 15:06:44.899894
6028	4210	استحواذ على شركة	2009-03-14	\N	\N	\N	\N	SAR	يسر المجموعة السعودية للأبحاث والتسويق الإعلان بأنه تم توقيع اتفاقية الاستحواذ على مجموعة "مكتبة الجامعة" بصفقه بلغت قيمتها 40 مليون ريال سعودي ، لتصبح مملوكة 100% من قبل المجموعة .	2025-12-25 15:06:44.900144
6029	1010	توزيع أرباح نقدية	2009-03-11	\N	\N	\N	\N	SAR	أقرت الجمعية العامة لبنك الرياض توصية مجلس الإدارة بتوزيع (1050) مليون ريال أرباحاً على المساهمين عن النصف الثاني لعام 2008 ، وذلك بواقع 70 هللة للسهم الواحد ، بالإضافة إلى ما سبق توزيعه في النصف الأول من عام 2008 وقدره (1050) مليون ريال بواقع 70 هللة للسهم الواحد ، وبذلك أصبح إجمالي ما اعتمد توزيعه (1.40) ريالا للسهم أي بنسبة 14% من القيمة الأسمية للسهم عن عام 2008. علماً بأن استحقاق الأرباح للنصف الثاني لعام 2008 هو بنهاية تداول يوم انعقاد الجمعية ، و هذه الأرباح سيتم توزيعها ابتداءً من يوم الأربعاء 1430.03.14 الموافق 2009.03.11. التفاصيل	2025-12-25 15:06:44.90045
6030	1060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2009-03-11	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على زيادة رأس مال البنك من 6 مليار ريال إلى 7.5 مليار ريال وذلك عن طريق رسملة الأرباح المبقاة وإصدار أسهم مجانية بواقع سهم لكل أربعه اسهم	2025-12-25 15:06:44.900743
6031	1090	توزيع أرباح نقدية	2009-03-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن النصف الثانى من عام 2008 بنسبة 7.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.75 ريال للسهم \r\n	2025-12-25 15:06:44.936302
6032	1120	توزيع أرباح نقدية	2009-03-02	\N	\N	\N	\N	SAR	توزيع الأرباح عن النصف الثاني من عام 2008م بواقع 1.75 ريال لكل سهم بنسبة 17.5% من القيمة الاسمية للسهم والأرباح سيتم إيداعها في حسابات المساهمين المربوطة في المحافظ الاستثمارية الموجودة فيها الأسهم يوم الاثنين 5 ربيع الأول 1430هـ الموافق 02 مارس 2009	2025-12-25 15:06:44.94635
6033	2280	شراء نسبة من شركة	2009-01-31	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على 75% من شركة طيبة للاستثمار والصناعات الغذائية المتطورة، بقيمة 54.8 مليون دينار أردني أو ما يعادل 290 مليون ريال سعودي.	2025-12-25 15:06:44.948685
6034	2280	تأسيس شركة	2009-01-28	\N	\N	\N	\N	SAR	تم تأسيس شركة "المراعى للاستثمار القابضة المحدودة د.م.م." كشركة قابضة للقيام بعمليات الإستحواذ خارج المملكة العربية السعودية.	2025-12-25 15:06:44.950289
6035	2030	توزيع أرباح نقدية	2009-01-12	\N	\N	\N	\N	SAR	قررت الشركة توزيع أرباح نقدية على المساهمين بواقع ريال واحد لكل سهم وذلك عن طريق بنك الرياض ، حيث سيتم تحويل مبالغ أرباح المساهمين مباشرة إلى حساباتهم الجارية المربوطة بالمحافظ الاستثمارية لدى البنوك.	2025-12-25 15:06:44.953496
6036	2140	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-12-13	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة من 428.75 مليون ريال إلى 490 مليون ريال بنسبة زيادة 14.29% وذلك بمنح سهم مجاني مقابل كل سبعة أسهم يملكها المساهمون المقيدون بسجل المساهمين بنهاية تداول يوم 1 ديسمبر 2008.	2025-12-25 15:06:44.95696
6037	6020	استحواذ على شركة	2008-12-13	\N	\N	\N	\N	SAR	قامت الشركة بشراء مجموعة البندرية بالكامل بمبلغ وقدره (153.575.405) ريال سعودي وتشمل الصفقة على الكيانات التالية (شركة مروج المزرعة للتسويق، شركة لبون للانتاج الغذائي، مصنع البان البندرية، ومشروع عبدالله الصغير الزراعي) وسوف يتم تمويل الصفقة ذاتيا على أقساط لمدة 4 سنوات.	2025-12-25 15:06:44.959224
6038	2030	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-12-13	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة من 60 مليون ريال إلى 150 ريال بنسبة 150% وذلك عن طريق منح سهم ونصف السهم مجاني مقابل كل سهم قائم يملكها المساهمين المقيدين بسجلات الشركة حتى نهاية يوم تداول 30 نوفمبر 2008.	2025-12-25 15:06:44.959995
6039	2030	تغيير السنة المالية	2008-12-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على تعديل السنة المالية للشركة والتي كانت تبدأ من أول مايو وتنتهي في 30 ابريل من العام الميلادي التالي لتبدأ من أول يناير وتنتهي في 31 ديسمبر من نفس العام.	2025-12-25 15:06:44.961453
6040	4240	توزيع أرباح نقدية	2008-11-26	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 17.5% من رأس المال (أو من القيمة الاسمية) بواقع 1.75 ريال للسهم \r\n	2025-12-25 15:06:44.962514
6041	7020	زيادة رأس مال - إصدار حقوق أولوية	2008-11-22	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة من 5 مليار ريال إلى 7 مليار ريال عن طريق طرح أسهم حقوق أولوية بقيمة 2 مليار ريال يقتصر الاكتتاب فيها على مساهمي الشركة حتى نهاية يوم تداول 19 أكتوبر 2008	2025-12-25 15:06:44.963053
6042	2050	توزيع أرباح نقدية	2008-11-15	\N	\N	\N	\N	SAR	وافق مجلس الادارة على توزيع أرباح نقدية عن الربع الثالث لعام 2008 بواقع 0.25 ريال للسهم الواحد وذلك للكساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 1 نوفمبر 2008.	2025-12-25 15:06:44.963612
6043	7010	توزيع أرباح نقدية	2008-11-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن الربع الثالث من عام 2008 بواقع ريال لكل سهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 29 أكتوبر 2008.	2025-12-25 15:06:44.964921
6044	2240	تأسيس شركة	2008-11-08	\N	\N	\N	\N	SAR	المشاركة فى تأسيس "شركة الزامل نيودلهي لمشاريع البنية التحتية المحدودة" برأس المال يبلغ 75 مليون ريال سعودي (20 مليون دولار أمريكي)، وتمثل حصة شركة الزامل بها51%.	2025-12-25 15:06:44.966306
6045	4270	استحواذ على شركة	2008-11-05	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على "شركة مصنع العون للملصقات التجارية والأغلفة البلاستيكية" بالكامل وتبلغ قيمة الاستحواذ 90 مليون ريال سعودي لا تتضمن المصاريف ذات العلاقة بالاستحواذ.	2025-12-25 15:06:44.967133
6046	3060	شراء نسبة من شركة	2008-11-05	\N	\N	\N	\N	SAR	المشاركة فى تأسيس "الشركة السعودية الإماراتية للمنتجات الخرسانية المحدودة" بنسبة 25% من رأس المال البالغ 24.000.000ريال.	2025-12-25 15:06:44.968204
6047	7020	استحواذ على شركة	2008-11-03	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على "شركة شبكة زاجل الدولية للاتصالات" (شركة ذات مسئولية محدودة) مرخص لها بتقديم خدمات الإنترنت في المملكة العربية السعودية وذلك من خلال شراء 96% من الحصص في الشركة بقيمة 80 مليون ريال سعودي.	2025-12-25 15:06:44.968795
6048	4070	توزيع أرباح نقدية	2008-11-01	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن توزيع أرباح عن العام المالي 2007/2008 بواقع واحد ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 22 سبتمبر 2008.	2025-12-25 15:06:44.969235
6049	4100	توزيع أرباح نقدية	2008-11-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 12% من رأس المال (أو من القيمة الاسمية) بواقع 1.2 ريال للسهم \r\n	2025-12-25 15:06:44.969657
6050	4090	توزيع أرباح نقدية	2008-10-29	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الثالث من عام 2008 بواقع 30 هلله للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 سبتمبر 2008.	2025-12-25 15:06:44.970127
6051	7010	شراء نسبة من شركة	2008-10-27	\N	\N	\N	\N	SAR	عقدت الشركة اتفاقية مع المجموعة السعودية للأبحاث والتسويق ومجموعة استرو الماليزية، لتأسيس "شركة تقديم خدمات المحتوى " برأس مال 280 مليون ريال وتمتلك المجموعة نسبة 51% تم تمويلها ذاتياً.	2025-12-25 15:06:44.970778
6052	4210	شراء نسبة من شركة	2008-10-27	\N	\N	\N	\N	SAR	عقدت الشركة اتفاقية مع شركة الاتصالات السعودية ومجموعة استرو الماليزية، لتأسيس "شركة تقديم خدمات المحتوى " برأس مال 280 مليون ريال وتمتلك المجموعة نسبة 20% تم تمويلها ذاتياً.	2025-12-25 15:06:44.971401
6053	4300	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-10-18	\N	\N	\N	\N	SAR	زيادة رأسمال الشركة من 5.4 مليار ريال إلى 7.2 مليار ريال بنسبة 33.33% وذلك بإصدار عدد (180) مليون سهم إضافي وذلك بمنح سهم واحد مجاني مقابل كل ثلاثة أسهم يملكها المساهمون وكانت أحقيتها للمساهمين المقيدين بسجلات الشركة حتى نهاية تداول يوم 13 أكتوبر 2008.	2025-12-25 15:06:44.972035
6054	2010	تأسيس شركة	2008-10-14	\N	\N	\N	\N	SAR	تأسيس "شركة سابك كابيتال المحدودة"مملوكة لشركة سابك بالكامل في هولندا برأسمال يبلغ 18,000 يورو (ثمانية عشر ألف يورو).	2025-12-25 15:06:44.979033
6055	4190	توزيع أرباح نقدية	2008-09-21	\N	\N	\N	\N	SAR	موافقة مجلس الادارة على توزيع ارباح نقدية عن النصف الاول لعام 2008 بواقع 4.5 ريال لكل سهم باجمالي 135 مليون ريال وذلك للمساهمين المقيدين في سجلات الشركة حتى نهاية تداول 10 سبتمبر 2008	2025-12-25 15:06:44.97982
6056	2190	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-09-20	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة من 400 مليون ريال إلى 680 مليون ريال بزيادة نسبتها تقارب (70%) عن طريق طرح أسهم حقوق أولية يقتصر الاكتتاب فيها خلال فترة الإكتتاب على مساهمي الشركة حتى نهاية تداول يوم 24 أغسطس 2008.	2025-12-25 15:06:44.980255
6057	4020	تأسيس شركة	2008-09-15	\N	\N	\N	\N	SAR	الشركة دخلت كشريك مؤسس في "شركة اسمنت حائل" شركة مساهمة تحت التأسيس بحصة في راس مالها تبلغ 60 مليون ريال سعودي بما نسبتة (5%) من مجموع رأس المال المقترح للشركة البالغ 1200 مليون ريال.	2025-12-25 15:06:44.980586
6058	2160	بيع جزء من الشركة	2008-09-13	\N	\N	\N	\N	SAR	بيع 50% من حصصها في شركة شونج كوينج بولي كوم العالمية cpic الصينية مقابل 169 مليون ريال	2025-12-25 15:06:44.980988
6059	3040	توزيع أرباح نقدية	2008-08-30	\N	\N	\N	\N	SAR	وافق مجلس الأدارة على توزيع أرباح نصف سنوية عن عام 2008 بواقع 3 ريال لكل سهم وبإجمالى 135 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 13 أغسطس 2008.	2025-12-25 15:06:44.981623
6060	1030	بيع جزء من الشركة	2008-08-25	\N	\N	\N	\N	SAR	قام البنك ببيع 25% من "شركة صائب بي ان بي باريبا لإدارة الأصول" لمجموعة بي ان بي باريبا لإدارة الأصول وبهذا تصبح حصة البنك بعد الإستحواذ 55% من رأس مال الشركة.	2025-12-25 15:06:44.982039
6061	2210	زيادة رأس مال - إصدار حقوق أولوية	2008-08-23	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال الشركة من 520.2 مليون ريال إلى 1285.200 مليون ريال من خلال طرح أسهم حقوق أولوية يقتصر الاكتتاب فيها على مساهمين الشركة حتى نهاية تداول يوم 26 يوليو 2008.	2025-12-25 15:06:44.982434
6062	2050	توزيع أرباح نقدية	2008-08-16	\N	\N	\N	\N	SAR	وافق مجلس الادارة على توزيع أرباح نقدية عن الربع الثانى لعام 2008 بواقع 0.25 ريال للسهم الواحد وذلك للكساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 23 يوليو 2008.	2025-12-25 15:06:44.982853
6063	3010	توزيع أرباح نقدية	2008-08-16	\N	\N	\N	\N	SAR	توزيع أرباح نقدية عن النصف الأول من عام 2008 بواقع 1 ريال للسهم وبما يمثل 10% من رأس المال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 6 أغسطس 2008.	2025-12-25 15:06:44.983166
6064	7010	توزيع أرباح نقدية	2008-08-13	\N	\N	\N	\N	SAR	وافق مجلس الأدارة على توزيع أرباح نقدية عن الربع الثانى من عام 2008 بواقع 1 ريال لكل سهم وبإجمالى قدره 2000 مليون ريال كانت أحقيتها لمساهمى الشركة حتى نهاية تداول يوم 30 يوليو 2008.	2025-12-25 15:06:44.983487
6065	3020	تأسيس شركة	2008-08-05	\N	\N	\N	\N	SAR	تأسيس "شركة اسمنت حائل" برأس مال 1200 مليون ريال ويبلغ نصيب الشركة فيها 5% بما يعادل 60 مليون ريال تم دفع مبلغ 15 مليون ريال تمثل جزء من حصتها وسيتم تمويل حصة اسمنت اليمامة من التدفقات النقدية المتولدة من نشاط أعمالها.	2025-12-25 15:06:44.98384
6066	4180	شراء نسبة من شركة	2008-08-05	\N	\N	\N	\N	SAR	استحواذت الشركة على 5% من رأسمال "شركة النساجون الشرقيون المصرية" حيث قامت بشراء 3.73 مليون سهماً من رأس مالها البالغ 74.60 مليون سهم بمبلغ 153 مليون جنيهاً مصرياً (حوالي 105 مليون ريال سعودي).	2025-12-25 15:06:44.984332
6067	2010	توزيع أرباح نقدية	2008-08-04	\N	\N	\N	\N	SAR	وافقت مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2008 بواقع 1.75 ريال للسهم بإجمالى 5250 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم	2025-12-25 15:06:44.984759
6068	2370	توزيع أرباح نقدية	2008-08-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن عام 2007 بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:44.985148
6069	3090	توزيع أرباح نقدية	2008-08-03	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على توزيع أرباح نقدية عن النصف الأول من عام 2008م بواقع 1.5ريال للسهم الواحد وكانت أحقيتها لمساهمى الشركة حتى نهاية تداول يوم 16 يوليو 2008.	2025-12-25 15:06:44.985556
6070	4140	تأسيس شركة	2008-08-02	\N	\N	\N	\N	SAR	  قامت الشركة بتأسيس شركة المخازن والخدمات المساندة بنسبة استحواذ 3.85% بما يعادل مليون سهم بقيمة 11 مليون ريال 	2025-12-25 15:06:44.985854
6071	2130	تأسيس شركة	2008-08-02	\N	\N	\N	\N	SAR	تأسيس شركة المخازن والخدمات المساندة برأس مال 260 مليون ريال ويبلغ نصيب الشركة فيها 1.92% بما يعادل 500 ألف سهم بقيمة 5 مليون ريال تم تمويليها بالكامل ذاتيا.	2025-12-25 15:06:44.986075
6072	4270	بيع شركة تابعة	2008-07-30	\N	\N	\N	\N	SAR	بيع الحصص المملوكة للشركة والبالغة نسبتها 40% من رأس مال الشركة المتحدة للطباعة والنشر المتحدة بقيمة بلغت 115 مليون درهم إماراتي ما يعادل 117.3 مليون ريال سعودي تقريباً.	2025-12-25 15:06:44.986258
6073	2270	توزيع أرباح نقدية	2008-07-30	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن عام 2007 بواقع 1.5 ريال للسهم بإجمالى قدره 48.750 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 13 يوليو 2008	2025-12-25 15:06:44.986433
6074	1060	توزيع أرباح نقدية	2008-07-30	\N	\N	\N	\N	SAR	قرر مجلس الأدارة توزيع أرباح نقدية عن النصف الأول من عام 2008 بواقع 0.96 ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 23 يوليو 2008.	2025-12-25 15:06:44.986607
6075	4090	توزيع أرباح نقدية	2008-07-30	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الثانى من عام 2008 بواقع 30 هلله للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 يونيو 2008.	2025-12-25 15:06:44.986779
6076	2020	توزيع أرباح نقدية	2008-07-27	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن النصف الأول من عام 2008 بواقع 6 ريال للسهم وبإجمالى قدره 1500 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 13 يوليو 2008.	2025-12-25 15:06:44.986984
6077	3050	توزيع أرباح نقدية	2008-07-26	\N	\N	\N	\N	SAR	قرر مجلس إدارة الشركة أرباح مرحلية نصف سنوية عن عام 2008م بواقع توزيع مبلغ ثلاثة ريال للسهم الواحد بإجمالى 420 مليون ريال بنسبة 30 % من رأس المال المدفوع وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 16 يوليو 2008.	2025-12-25 15:06:44.987153
6078	4240	توزيع أرباح نقدية	2008-07-22	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 1.75 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية يوم تداول 17 يونيو 2008.	2025-12-25 15:06:45.002441
6079	2310	توزيع أرباح نقدية	2008-07-20	\N	\N	\N	\N	SAR	توزيع أرباح نقدية عن عام 2008 بواقع ريال واحد لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 5 يوليو 2008.	2025-12-25 15:06:45.002872
6080	2370	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-07-19	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة بنسبـة 25% مـن 320 مليون ريال إلـى 400 مليون ريال وذلك بمنح سهم مجاني واحد مقابل كل أربعة أسهم يملكها المساهمون المقيدون بسجل الشركة بنهاية تداول يوم 16 يوليو 2008.	2025-12-25 15:06:45.003142
6081	1010	توزيع أرباح نقدية	2008-07-15	\N	\N	\N	\N	SAR	قرر مجلس الإدارة توزيع أرباح نقدية نصف سنوية لعام 2008 بواقع 70 هلله للسهم وبإجمالى قدره 1050 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 يونيو 2008.	2025-12-25 15:06:45.00338
6082	1090	توزيع أرباح نقدية	2008-07-12	\N	\N	\N	\N	SAR	توزيع أرباح مرحلية نصف سنوية لعام 2008م وبواقع 0.9 ريال للسهم وبإجمالى 875 مليون ريال كانت أحقيتها للمسهامين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 يونيو 2008	2025-12-25 15:06:45.003659
6083	1120	توزيع أرباح نقدية	2008-07-12	\N	\N	\N	\N	SAR	توزيع أرباح نقدية عن النصف الأول من عام 2008 بواقع 1.25 ريال لكل سهم بإجمالى قدره 1875 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 يونيو 2006.	2025-12-25 15:06:45.003909
6084	4020	تأسيس شركة	2008-06-22	\N	\N	\N	\N	SAR	تأسيس "شركة دار التمليك للتمويل الإسكاني" برأسمال مليار ريال يبلغ نصيب الشركة العقارية منه 10% يتركز نشاط الشركة الجديدة على تقديم برامج تمويلية إسكانية متوافقة مع الشريعة الإسلامية.	2025-12-25 15:06:45.00416
6085	2060	زيادة رأس مال - إصدار حقوق أولوية	2008-06-22	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة من 3.495 مليار ريال إلى 4.606 مليار ريال عن طريق طرح أسهم حقوق أولوية بمعدل سهم لكل 3.146 سهم وبسعر طرح للسهم الواحد 18ريال ويقتصر الاكتتاب فيها على مساهمين الشركة حتى نهاية يوم تداول 26 مايو 2008	2025-12-25 15:06:45.004392
6086	2060	توزيع أرباح نقدية	2008-06-22	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح عن عام 2007 بواقع واحد ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 26 مايو 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.004632
6087	6070	توزيع أرباح نقدية	2008-06-21	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع نصف ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 4 مايو 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.004847
6088	4280	استحواذ على شركة	2008-06-18	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على 100% من شركة أبراج ناس المحدودة التي تمتلك 30% من أسهم الشركة الوطنية لخدمات السفر (ناس) وبالتالي تزيد حصة شركة المملكة فى الشركة الوطنية لخدمات السفر إلى 37% بإستثمار إجمالي قدره 2,23 مليار ريال (594 مليون دولار).	2025-12-25 15:06:45.005127
6089	2070	زيادة حصة الشركة فى شركة تابعة	2008-06-14	\N	\N	\N	\N	SAR	اكتتبت الشركة فى 5.830 مليون سهم من أسهم حقوق أولوية في شركة التصنيع الوطنية بمبلغ اجمالي قدره 104.941 مليون ريال لتزيد بذلك عدد الأسهم المملوكة للشركة من شركة التصنيع إلى 24.171 مليون سهم بنسبة قدرها 5.25% من رأس مالها.	2025-12-25 15:06:45.005376
6090	4947	توزيع أرباح نقدية	2008-06-11	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع نصف ريال للسهم الواحد وبإجمالى قدره 15 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 6 مايو 2008.	2025-12-25 15:06:45.005588
6091	1010	زيادة رأس مال - إصدار حقوق أولوية	2008-06-07	\N	\N	\N	\N	SAR	زيادة رأس مال البنك من 6250 مليون ريال إلى 15000 مليون ريال بزيادة قدرها 140 % بواقع 1.4 سهم لكل سهم ، وذلك عن طريق طرح أسهم الزيادة بعدد 875 مليون سهم للاكتتاب فيها بالأولوية من قبل المساهمين المسجلين بمركز الإيداع تداول بنهاية تداول يوم 12 مايو 2008، وذلك بسعر إجمالي ( 15 ) ريالاً للســهم الواحــد.	2025-12-25 15:06:45.005829
6092	2250	توزيع أرباح نقدية	2008-06-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:45.006085
6199	4947	توزيع أرباح نقدية	2007-09-15	\N	\N	\N	\N	SAR	أقرت الجمعية العمومية للشركة صرف الأرباح المقررة عن العام المالي 2006م بإجمالي 15 مليون ريال للمساهمين المسجلين بواقع نصف ريال للسهم	2025-12-25 15:06:45.890986
6093	6040	توزيع أرباح نقدية	2008-06-04	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع نصف ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 8 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.006315
6094	2080	توزيع أرباح نقدية	2008-06-04	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع 1.5 ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 4 مايو 2008 .	2025-12-25 15:06:45.045211
6095	6090	توزيع أرباح نقدية	2008-05-31	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 0.5 ريال أى بنسبة 5% من رأس المال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 13 مايوم 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.045552
6096	4090	تأسيس شركة	2008-05-28	\N	\N	\N	\N	SAR	  قامت الشركة بتأسيس شركة الذراع المكين الصناعية بنسبة استحواذ 95% برأس مال قدره مليار ريال	2025-12-25 15:06:45.045841
6097	4080	توزيع أرباح نقدية	2008-05-27	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 أبريل 2008 تم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.046198
6098	1140	تأسيس شركة	2008-05-25	\N	\N	\N	\N	SAR	تأسيس "شركة البلاد للإستثمار" شركة ذات مسئولية محدودة للقيام بأنشطة الاستثمار وإدارة الأصول وحفظ الأوراق المالية.	2025-12-25 15:06:45.04659
6099	2110	توزيع أرباح نقدية	2008-05-18	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع 75 هلله للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 9 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.046866
6100	4260	توزيع أرباح نقدية	2008-05-18	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع 1.5 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.047234
6101	4020	توزيع أرباح نقدية	2008-05-18	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 21 أبريل 2008وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.830909
6102	4230	توزيع أرباح نقدية	2008-05-17	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع 2 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 أبريل 2008 وتم توزيعها عن طريق التحويل لحساب	2025-12-25 15:06:45.831387
6103	2340	توزيع أرباح نقدية	2008-05-17	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع 1.5 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 أبريل 2008 وتم توزيعها عن طريق التحويل لحساب.	2025-12-25 15:06:45.831638
6104	2050	توزيع أرباح نقدية	2008-05-15	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن الربع الأول للعام 2008م بإجمالي مبلغ قدره 125مليون ريال وذلك بواقع 0.25 ريال للسهم الواحد، وذلك للمساهمين المسجلين بسجلات الشركة بمركز تداول بنهاية تداول يوم30 أبريل 2008م، وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.831864
6105	7010	توزيع أرباح نقدية	2008-05-14	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الأول من عام 2008 بواقع ريال واحد لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 أبريل 2008.	2025-12-25 15:06:45.83205
6106	2220	توزيع أرباح نقدية	2008-05-12	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع ريال واحد لكل سهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 12 أبريل 2008.	2025-12-25 15:06:45.832227
6107	4040	توزيع أرباح نقدية	2008-05-12	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع نصف ريال لسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 20 أبريل 2008.	2025-12-25 15:06:45.832478
6108	2240	توزيع أرباح نقدية	2008-05-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:45.832681
6109	5110	توزيع أرباح نقدية	2008-05-11	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع 70 هلله للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.832918
6110	4210	شراء نسبة من شركة	2008-05-10	\N	\N	\N	\N	SAR	عقدت الشركة اتفاقية مع مؤسسة البريد السعودي وشركة يوسف بن محمد حميد الدين وشركاه لتأسيس "شركة شاهر" برأس مال 100 مليون ريال وتمتلك المجموعة نسبة 19.6% تم تمويلها ذاتياً.	2025-12-25 15:06:45.833146
6111	4010	توزيع أرباح نقدية	2008-05-10	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بةاق ريال واحد لكل سهم أى ما يعادل 10% من رأس المال وذلك لمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول 28 أبريل 2008.	2025-12-25 15:06:45.833372
6112	4180	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-05-10	\N	\N	\N	\N	SAR	أعلنت الشركة عن توزيع أسهم منحة بواقع سهم لكل 3.3479 سهم قائمة لملاك أسهم الشركة لزيادة رأس مال الشركة من 385 مليون ريال (38.5 مليون سهماً) إلى 500 مليون ريال (50 مليون سهماً).	2025-12-25 15:06:45.83355
6200	7010	شراء نسبة من شركة	2007-09-12	\N	\N	\N	\N	SAR	قامت الشركة بشراء 25% من شركة ماكسيس\r\n	2025-12-25 15:06:45.891234
6113	4300	توزيع أرباح نقدية	2008-05-10	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية للعام 2007 بوقع 3 ريال للسهم الواحد وذلك لمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 19 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.83373
6114	4180	تأسيس شركة	2008-05-07	\N	\N	\N	\N	SAR	أسست المجموعة شركة مدماك الخليجية للاستثمار العقاري برأس مال بلغ 100 مليون ريال مدفوع بالكامل- لتكون الذراع الاستثماري للمجموعة في مجال الاستثمار العقاري.	2025-12-25 15:06:45.834668
6115	4180	تأسيس شركة	2008-05-07	\N	\N	\N	\N	SAR	أسست المجموعة شركة صدوق للاستثمارات القابضة برأس مال بلغ 100 مليون ريال مدفوع بالكامل- لتكون بذلك الذراع الاستثماري للمجموعة.	2025-12-25 15:06:45.83487
6116	2070	توزيع أرباح نقدية	2008-05-05	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بوقع واحد ونصف ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 5 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.835042
6117	2240	شراء نسبة من شركة	2008-05-04	\N	\N	\N	\N	SAR	قامت الشركة بشراء 50% من شركة منتجات هدسون الشرق الأوسط المحدودة بإجمالى قدره 75 مليون ريال وهى إحدى القطاعات التابعة لشركة منتجات هدسون العالميةالمتخصصة في تصنيع أجهزة المبادلات الحرارية المُبردة بالهواء.	2025-12-25 15:06:45.835212
6118	3090	توزيع أرباح نقدية	2008-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2007 بواقع 2.5 ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 23 أبريل 2008.	2025-12-25 15:06:45.835383
6119	1060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-05-03	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال البنك من 3.750 مليار ريال إلى 6 مليار ريال عن طريق رسملة الأرباح المبقاة وإصدار أسهم مجانية بواقع ثلاثة اسهم لكل خمسة.	2025-12-25 15:06:45.835556
6120	2090	توزيع أرباح نقدية	2008-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 2.5 ريال لكل سهم اى 25% من رأس المال للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 1 أبريل 2008.	2025-12-25 15:06:45.835736
6121	4090	توزيع أرباح نقدية	2008-04-30	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الأول من عام 2008 بوقع 70 هللة للسهم الواحد وبإجمالى قدره 105 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 3 مارس 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.835958
6122	4090	توزيع أرباح نقدية	2008-04-30	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن الربع الرابع من عام 2007 بوقع 30 هللة للسهم الواحد وبإجمالى قدره 45.000.000 ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 8 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.836297
6123	7010	شراء نسبة من شركة	2008-04-29	\N	\N	\N	\N	SAR	قامت الشركة بشراء 35% من شركة أوجيه للاتصالات بمبلغ قدرة 9.6 مليار ريال سعودي، وتم تمويل صفقة الاستحواذ عن طريق التمويل بالمرابحة مع ثلاثة بنوك وهي البنك الأهلي التجاري، بنك الرياض، مجموعة سامبا المالية.	2025-12-25 15:06:45.836496
6124	1020	توزيع أرباح نقدية	2008-04-29	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدبة بواقع نصف ريال للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 16 أبريل 2008وتم توزيع الأرباح عن طريق التحويل للحساب.	2025-12-25 15:06:45.836671
6125	4150	توزيع أرباح نقدية	2008-04-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن عام 2007 بواقع نصف ريال للسهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تدالول يوم 8 أبريل 2008 وسيتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.836844
6126	7020	توزيع أرباح نقدية	2008-04-26	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:45.837025
6127	6010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال الشركة بنسبة 50% من 400 مليون الى 600 مليون ريال بمنح سهم مقابل كل سهمين أي بزيادة عدد الأسهم من40 مليون سهم إلى60 مليون سهم	2025-12-25 15:06:45.837211
6128	2300	توزيع أرباح نقدية	2008-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدة عن عام 2007 بوقع 0.75 للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 12 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب	2025-12-25 15:06:45.837465
6129	2150	توزيع أرباح نقدية	2008-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع ريال لكل سهم بنسبة 10% من رأس المال وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 9 أبريل 2008 وتم توزيعها عن طريق التحويل للحساب	2025-12-25 15:06:45.838973
6130	4270	توزيع أرباح نقدية	2008-04-22	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن النصف الثاني من عام 2007 بواقع 1 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 25 مارس 2008 وتم توزيعها عن طريق التحويل للحساب	2025-12-25 15:06:45.839262
6131	4030	توزيع أرباح نقدية	2008-04-20	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع ريال واحد للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 7 أبريل 2008 وسيتم توزيعها عن طريق التحويل للحساب.	2025-12-25 15:06:45.839499
6132	2340	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-04-20	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال الشركة من 650.000.000 ريال إلى 812.500.000 ريال (أي بزيادة قدرها 25%) وذلك عن طريق منح (سهم ) مجاني لكل أربعة أسهم.	2025-12-25 15:06:45.839708
6133	2320	توزيع أرباح نقدية	2008-04-19	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بواقع 2 ريال للسهم الواحد أى بما يعادل 20 % من رأس المال المدفوع وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 31 مارس 2008 وذلك عن طريق التحويل للحساب.	2025-12-25 15:06:45.853014
6134	2300	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-04-19	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على زيادة رأسمال الشركة من240مليون ريال إلى300مليون ريال بنسبة زيادة قدرها 25%وبذلك تزيد عدد أسهم الشركة من24مليون سهم إلى30مليون سهم وذلك عن طريق منح سهم مجاني عن كل4 أسهم.	2025-12-25 15:06:45.853442
6135	1020	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-04-19	\N	\N	\N	\N	SAR	وافقت الجمعية على زيادة رأس مال البنك من 2250مليون ريال (225 مليون سهم) إلى 3000 مليون ريال (300 مليون سهم) بزيادة 750 مليون ريال (75 مليون سهم) بنسبة زيادة (33.33%) وذلك بمنح سهم مجاني مقابل كل ثلاثة أسهم	2025-12-25 15:06:45.853715
6136	2200	توزيع أرباح نقدية	2008-04-16	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بواقع 1.5 ريال للسهم الواحد أي بنسبة 15% من رأس المال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 5 أبريل 2008	2025-12-25 15:06:45.854028
6137	4210	توزيع أرباح نقدية	2008-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح بمبلغ (240) مليون ريال عن عام 2007م بما يعادل(30%) من رأس المال أي بواقع (3) ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 26 مارس 2008 وتم توزيعها عن طريق التحويل للحساب	2025-12-25 15:06:45.860038
6138	2050	توزيع أرباح نقدية	2008-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن الربع الرابع لعام 2007 بواقع 0.25 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 25 مارس 2008 وتم توزيعها عن طريق التحويل للحساب	2025-12-25 15:06:45.86053
6139	2020	توزيع أرباح نقدية	2008-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن الربع الثانى من عام 2007 بواقع 2 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 7 أبريل 2008 عن طريق التحويل للحساب.	2025-12-25 15:06:45.860897
6140	4180	زيادة حصة الشركة فى شركة تابعة	2008-04-14	\N	\N	\N	\N	SAR	تعلن الشركة عن زيادة حصتها من 20% إلى 80% فى "شركة تجارة السلع الكمالية الثمينة المحدودة" بقيمة إجمالية تبلغ 4 مليون ريال من رأس مال الشركة التابعة والبالغ 5 مليون ريال وتعمل شركة تجارة السلع الكمالية فى مجال بيع وشراء المعادن الثمينة والأحجار الكريمة والمجوهرات والإكسسوارات والتحف والأدوات المنزلية ومستلزمات الديكو.	2025-12-25 15:06:45.861144
6141	2010	توزيع أرباح نقدية	2008-04-12	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن النصف الثانى لعام 2007 بواقع 2 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 29 مارس 2008 وذلك عن طريق التحويل للحساب	2025-12-25 15:06:45.861396
6142	1050	توزيع أرباح نقدية	2008-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بواقع 10 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 30 مارس 2008 وتوزع الأرباح عن طريق التحويل للحساب.	2025-12-25 15:06:45.861653
6143	7010	توزيع أرباح نقدية	2008-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بواقع 1.25 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 26 مارس 2008 وتوزع الأرباح عن طريق التحويل للحساب.	2025-12-25 15:06:45.861877
6144	8010	توزيع أرباح نقدية	2008-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بواقع 10 ريال للسهم الواحد وبإجمالى قدره 500 مليون ريال وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 11 مارس 2008 وتوزع الأرباح عن طريق التحويل للحساب.	2025-12-25 15:06:45.862087
6145	2360	توزيع أرباح نقدية	2008-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بواقع 2 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 22 مارس 2008 وتوزع الأرباح عن طريق التحويل للحساب.	2025-12-25 15:06:45.862385
6146	3080	توزيع أرباح نقدية	2008-04-08	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع أرباح نقدية بواقع 6 ريالات للسهم أى بنسبة (60?) من القيمة الاسمية للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 30 ديسمبر 2008	2025-12-25 15:06:45.862672
6147	2020	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-04-08	\N	\N	\N	\N	SAR	وافقة الجمعية العامة غير العادية على زيادة رأس مال الشركة من ( 2000 ) مليون ريال الى ( 2500 ) مليون ريال وذلك بزيادة في عدد الاسهم من (200) مليون سهم إلى(250) مليون سهم بنسبة تغير 25% وذلك بمنح سهم مجاني إلى كل مالك أربعة أسهم للمساهمين المالكين للأسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 7 أبريل 2008.	2025-12-25 15:06:45.862896
6220	1060	توزيع أرباح نقدية	2007-07-18	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على توزيع الأرباح عن النصف الأول من العام المالي 2007م بمقدار 1.53 ريال للسهم	2025-12-25 15:06:46.659092
6148	2220	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-04-08	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على زيادة رأسمال الشركة من (163.561.250) ريال إلى (204.451.560) ريال بنسبة قدرها (25%) وذلك بمنح سهم واحد مجاني لكل أربعة أسهم ليرتفع عدد الأسهم من (16.356.125) سهم إلى (20.445.156) ســهـم.	2025-12-25 15:06:45.86313
6149	2240	شراء نسبة من شركة	2008-04-08	\N	\N	\N	\N	SAR	قامت الشركة بشراء نسبة 50% من رأسمال مصنع الربيعة والنصار للمباني الخرسانية الجاهزة (رانكو للخرسانة) الواقع في ضواحي مدينة الرياض، ويُنتج المصنع الوحدات السكنية والمدارس والمٌُجمعات التجارية والمصانع والجسور والأسوار ومستلزمات الطرق وغيرها من المنتجات الخرسانية.	2025-12-25 15:06:45.86347
6150	4200	توزيع أرباح نقدية	2008-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:45.863707
6151	2280	توزيع أرباح نقدية	2008-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على توزيع أرباح لعام 2007بواقع 2.5 ريال لسهم الواحد وبإجمالي قدره (200)مليون ريال وذلك للمساهمين المسجلين فى سجلات الشركة بنهاية يوم تداول 24 مارس 2008 وذلك عن طريق التحويل للحساب.	2025-12-25 15:06:45.863945
6152	1060	توزيع أرباح نقدية	2008-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع أرباح عن النصف الثاني من عام 2007م بمقدار 2.22 ريالا للسهم	2025-12-25 15:06:45.864203
6153	3020	توزيع أرباح نقدية	2008-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقديةبنسبة 30% من رأس المال (أو من القيمة الاسمية) بواقع 3 ريال للسهم \r\n	2025-12-25 15:06:45.86444
6154	3060	توزيع أرباح نقدية	2008-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 50% من رأس المال (أو من القيمة الاسمية) بواقع 5 ريال للسهم \r\n	2025-12-25 15:06:45.864689
6155	3050	توزيع أرباح نقدية	2008-04-05	\N	\N	\N	\N	SAR	قرر مجلس الإدارة توزيع أرباح مرحلية نصف سنوية عن النصف الثانى من عام 2007 بواقع 2.5 ريال للسهم الواحد كانت أحقيتها للمساهمين المسجلين بسجلات الشركة حتى نهاية تداول يوم 27 مارس 2008.	2025-12-25 15:06:45.865089
6156	3030	توزيع أرباح نقدية	2008-04-05	\N	\N	\N	\N	SAR	الموافقة على إقتراح مجلس الإدارة بشأن توزيع الأرباح لعام 2007م بنسبة 50% من رأس المال المدفوع أي بواقع 5 ريال لكل سهم على ان تكون احقيه صرف هذه الأرباح لمالكي الأسهم في الشركة كما في نهاية تداول يوم انعقاد الجمعية	2025-12-25 15:06:45.865382
6157	2040	توزيع أرباح نقدية	2008-04-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 25% من رأس المال (أو من القيمة الاسمية) بواقع 2.5 ريال للسهم \r\n	2025-12-25 15:06:45.865673
6158	2180	توزيع أرباح نقدية	2008-04-01	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 5% من رأس المال بواقع 0.5 ريال للسهم \r\n	2025-12-25 15:06:45.866005
6159	2010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-03-30	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على زيادة رأس المال من (25) مليار ريال (2.5) مليار سهم إلى (30) مليار ريال (3) مليار سهم بنسبة زيادة (20%) وذلك بمنح سهم واحد مجاني مقابل كل خمسة أسهم مملوكة.	2025-12-25 15:06:45.873312
6160	2340	شراء نسبة من شركة	2008-03-30	\N	\N	\N	\N	SAR	وافق مجلس إدارة الشركة في اجتماعه المنعقد يوم الأحد 22/3/1429هـ الموافق 30/3/2008م الموافقة على الدخول كشريك مؤسس في شركة كابلات البحر الأحمر بعدد 10 مليون سهم بقيمة إجمالية قدرها ( 100 مليون ريال ) وهو ما يمثل 27% من إجمالى أسهم الشركة البالغة 37 مليون سهم بقيمة اسمية 10 ريالات للسهم الواحد، ويهدف المؤسسون بالشركة إلى تأسيس شركة على مستوى عالمي مختصة في صناعة الكابلات. .	2025-12-25 15:06:45.873725
6161	3040	توزيع أرباح نقدية	2008-03-29	\N	\N	\N	\N	SAR	توزيع أرباح نقدية عن النصف الثانى من عام 2007 بواقع 4 ريال لكل سهم وبإجمالى قدره 180 مليون ريال وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 12 مارس 2008.	2025-12-25 15:06:45.874141
6162	2050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-03-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية المنعقدة فى 25 مارس 2008 على زيادة رأسمال الشركة من 3750 مليون ريال إلى 5000 مليون ريال وذلك عن طريق منح سهم مجاني مقابل كل ثلاثة أسهم مملوكة ليرتفع بذلك عدد أسهم الشركة من 375 مليون سهماً إلى 500 مليون سهم .	2025-12-25 15:06:45.8745
6163	2250	زيادة رأس مال - إصدار حقوق أولوية	2008-03-22	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية المنعقدة بتاريخ 27/1/1429هـ الموافق 5/2/2008م على زيادة رأس المال من (2,250,000,000) (225 مليون سهم)، إلى (4,500,000,000) (450 مليون سهم)، بنسبة زيادة قدرها 100%، وذلك عن طريق طرح سهم بقيمة (10) عشرة ريالات وبدون علاوة إصدار، لاكتتاب حقوق أولوية، لكل سهم يملكه المساهمون المقيدون بسجل الأسهم.	2025-12-25 15:06:45.874748
6164	1080	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-03-22	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية الثامنة عشر المنعقدة بتاريخ 16/3/2008 على زيادة رأسمال البنك من 4550 مليون ريال إلى 6500 مليون ريال بمنح ثلاثة اسهم مجانية لكل سبعة اسهم أي بنسبة 43%	2025-12-25 15:06:45.874988
6165	1090	توزيع أرباح نقدية	2008-03-19	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية   بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:45.875261
6221	2160	بيع شركة تابعة	2007-07-18	\N	\N	\N	\N	SAR	تم بيع 70% من حصص الشركة في مصـــنعي البرازيل والارجنتين المذكور وقد بلغت قيمة الصفقة 33,750 مليون ريال سعودي	2025-12-25 15:06:46.659394
6166	1030	بيع جزء من شركة تابعة	2008-03-19	\N	\N	\N	\N	SAR	وقع البنك بتاريخ 18/03/2008إتفاق شراكة إستراتيجية يقضي بقيام بي ان بي باريبا بشراء حصة تمثل 25% من شركة صائب لإدارة الأصول التابعة للبنك والتي سيتم تعديل اسمها ليصبح شركة صائب بي ان بي باريبا لإدارة الأصول والتي تم تأسيسها مؤخراً وتم إنتقال أعمال البنك المتعلقة بإدارة الأصول من صناديق إستثمار ومحافظ إستثمارية إليها.	2025-12-25 15:06:45.875484
6167	7020	استحواذ على شركة	2008-03-18	\N	\N	\N	\N	SAR	وافقت هيئة الإتصالات وتقنية المعلومات بتاريخ 8/3/1429هـ الموافق 16/3/2008م للشركة على شراء 99% من حصص الشركاء في شركة بيانات الأولى لخدمات الشبكات والمرخص لها بتقديم خدمات المعطيات في المملكة العربية السعودية وذلك بقيمة مليار وخمسمائة مليون ريال سعودي	2025-12-25 15:06:45.876194
6168	4200	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-03-18	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية الأولى على زيادة رأس مال الشركة من (200) مليون ريال إلى (250) مليون ريال ليرتفع عدد أسهم الشركة من (20) مليون سهم إلى (25) مليون سهم وذلك بمنح سهم واحد مجاني لكل أربعة أسهم عن طريق التحويل من الأرباح المبقاة	2025-12-25 15:06:45.876427
6169	2030	زيادة حصة الشركة فى شركة تابعة	2008-03-17	\N	\N	\N	\N	SAR	حصلت الشركة على أسهم اكتتاب حقوق الأولوية في زيادة رأس مال شركة المجموعة السعودية للاستثمار الصناعي بنسبة سهم لكل سهم، ليصبح حصة الشركة في رأس مال شركة المجموعة السعودية للاستثمار الصناعي عدد (15194480 سهم) بنسبه (3.37%)	2025-12-25 15:06:45.876647
6170	4190	توزيع أرباح نقدية	2008-03-17	\N	\N	\N	\N	SAR	توزيع أرباح نقدية عن النصف الأولى من عام 2007 بواقع 4 ريال لكل سهم وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 10 مارس 2008.	2025-12-25 15:06:45.876869
6171	3010	توزيع أرباح نقدية	2008-03-12	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الخمسين المنعقدة فى 20/2/1429هـ الموافق 27/2/2008م على 240 مليون ريال بواقع 3 ريال للسهم عن 80 مليون سهم عن النصف الثانى من عام 2007	2025-12-25 15:06:45.87711
6172	1030	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-03-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية المنعقدة فى 01/03/429هـ الموافق 09/ 03/2008م على زيادة رأس مال البنك البالغ 3,910,160,000 ريال (عدد الأسهم 391,016,000 سهم) الى 4,500,000,000 ريال سعودي (450,000,000 سهم) بنسبة 15%، وذلك بتحويل جزء من حساب الأرباح المبقاة وإصدار عدد 58,984,000 سهم مجاني وتوزيعها على أساس سهم لكل 6,63 سهم قائم على حملة أسهم	2025-12-25 15:06:45.877845
6173	1010	توزيع أرباح نقدية	2008-03-05	\N	\N	\N	\N	SAR	قرر مجلس الادارة توزيع (1000) مليون ريال بواقع (1.60) ريال للسهم الواحد وذلك كأرباح مرحلية نصف سنوية من أرباح البنك عن عام 2007م وتكون أحقية هذه الإرباح للمساهمين المسجلين بسجلات مساهمي البنك بنهاية يوم 25 فبراير 2008	2025-12-25 15:06:45.87808
6174	1090	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-03-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية  على زيادة رأس المال إلى 9000000000 ريال من خلال توزيع أسهم منحة بواقع سهم لكل  2 سهم	2025-12-25 15:06:45.878562
6175	1120	توزيع أرباح نقدية	2008-03-02	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية العشرون التي عقدت الأحد 17 صفر 1429هـ الموافق 24 فبراير 2008م على توزيع الأرباح عن النصف الثاني من عام 2007م بواقع نصف ريال لكل سهم قائم من غير أسهم المنحة بنسبة 5% من القيمة الأسمية للسهم	2025-12-25 15:06:45.878815
6176	6090	شراء نسبة من شركة	2008-03-01	\N	\N	\N	\N	SAR	قامت الشركة بشراء 11.53% من رأس مال شركة فجورد مارين التركية وهى متخصصة في مجال إنتاج الأسماك والأصبعيات وتمتلك مزارع ومفارخ بتركيا وتسوق منتجاتها داخل تركيا والسوق الأوربية	2025-12-25 15:06:45.87905
6177	4010	زيادة رأس مال - إصدار حقوق أولوية	2008-02-25	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة من (500,000,000) ريال إلى (690,060,970) ريال ليرتفع عدد الأسهم من (50.000.000) إلى (69.006.097) سهم بزيادة (19.006.097) سهم.	2025-12-25 15:06:45.879354
6178	1120	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2008-02-24	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية الثامنة بتاريخ 17 صفر 1429هـ الموافق 24 فبراير 2008م على زيادة رأس المال من 13.500 مليون ريال(1,350 مليون سهم) إلى 15.000 مليون ريال (1,500 مليون سهم) وذلك بإصدار 150 مليون سهم بنسبة زيادة قدرها 11.1% وذلك بمنح سهم مجاني لكل تسعة أسهم قائمه عن طريق تحـويل مبــــلغ وقـــــدرة 1.50 مليون ريال من بند الإرباح المبقاة	2025-12-25 15:06:45.87989
6179	2310	زيادة رأس مال - إصدار حقوق أولوية	2008-02-18	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية السادسة والتي انعقدت فى 20/01/1429هـ الموافق 29/01/2008م على زيادة رأسمال سبكيم من خلال طرح أسهم حقوق أولوية بقيمة 2 مليار ريال سعودي بسعر طرح للسهم الواحد 15 ريال (10 ريال قيمة أسمية 5 ريال علاوة إصدار) وعدد الأسهم المطروحة للاكتتاب 133.333.333 سهم بمعدل 2 سهم لكل 3 سهم، ليكون عدد أسهم الشركة بعد الزيادة 333.333.333 سهم بدلاً من 200.000.000 سهم.	2025-12-25 15:06:45.881014
6180	4300	اصدار صكوك	2008-02-13	\N	\N	\N	\N	SAR	إدراجت الشركة إصدارها الثاني من الصكوك الإسلامية بقيمة مليار دولار ، والتي تم إصدارها منتصف العام الماضي، في السوق البحرينية للأوراق المالية (BSE) لتكون بذلك أول وأكبر صكوكا إسلامية سعودية تدرج في السوق البحرينية بعد نجاح الإدراج في بورصتي دبي DIFX ولبوان الدولية للأوراق المالية(LFX ) في كوالالمبور بماليزيا.	2025-12-25 15:06:45.885262
6401	3050	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	تجزئة الأسهم بواقع خمسة أسهم لكل سهم وبذلك أصبح عدد الأسهم 140 مليون سهم .	2025-12-25 15:06:48.364301
6181	2240	شراء نسبة من شركة	2008-02-05	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شراكة استراتيجية جديدة مع شركة أدفانتك كويلز المحدودة الهندية. وتبلغ حصة الشركة فيها 30 في المائة بقيمة إجمالية بلغت حوالي 59 مليون ريال سعودي (600 مليون روبية هندية). وقد تم توقيع الاتفاقية بين الطرفين في 5 فبراير 2008. وتعد شركة أدفانتك كويلز إحدى الشركات القليلة التي تقوم بتشغيل مصنع متكامل لأجهزة التكييف، بدءً من إنتاج أنظمة الحقن البلاستيكية إلى مرحلة التجميع النهائية. وتبلغ الطاقة الإنتاجية لمصنع أدفانتك كويلز حوالي 1.2 مليون وحدة سنوياً. كما تقوم بإنتاج مكيفات بأسماء تجارية عالمية ضمن برنامج مصنعي المعدات الأصلية (OEM).	2025-12-25 15:06:45.885613
6182	3010	زيادة رأس مال - إصدار حقوق أولوية	2008-01-19	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غيرالعادية الرابعة المنعقدة فى 4/12/2007م على زيادة رأس المال من خلال طرح أسهم حقوق أولوية بقيمة 500 مليون ريال بسعر طرح للسهم الواحد 50 ريال (10 ريال قيمة أسمية 40 ريال علاوة إصدار) وعدد الأسهم المطروحة للاكتتاب 10 مليون سهم بمعدل سهم لكل 6 أسهم مملوكة في تاريخ الأحقية لتكون عدد أسهم الشركة بعد الزيادة 80 مليون سهماً بدلاً من 70 مليون سهماً	2025-12-25 15:06:45.886331
6183	2230	شراء نسبة من شركة	2008-01-17	\N	\N	\N	\N	SAR	قامت الشركة بشراء 20% من حصص ملكية شركــــــة Explo Track بولاية فلاديلفيا الأمريكية ( رأس مال الشركة سبعة مليون وخمسمائة الف دولار امريكي) وهذه الشركة متخصصة في الأنظمة الألكترونية المتقدمة لمتابعة نقل وتخزين جميع أنواع المتفجرات المدنية والعسكرية والمواد الخام الرئيسية لصناعة المتفجرات.	2025-12-25 15:06:45.886607
6184	2050	زيادة حصة الشركة فى شركة تابعة	2008-01-01	\N	\N	\N	\N	SAR	قامت الشركة بشراء حصة إضافية بقيمة 51.7 مليون ريال تمثل 25% من رأسمال شركة "نيومارينا" الكائنة في الإسكندرية بجمهورية مصر العربية وهي شركة متخصصة في مجال الصناعات البلاستيكية وأنظمة التغليف لتضيفها إلى النسبة المملوكة حاليا والبالغة 70% و التي تم الاستحواذ عليها خلال عام 2006م، لتصل الحصة الإجمالية إلى 95%	2025-12-25 15:06:45.886828
6185	2050	توزيع أرباح نقدية	2007-12-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 2.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.25 ريال للسهم \r\n	2025-12-25 15:06:45.887071
6186	3010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-12-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 700000000 ريال من خلال توزيع أسهم منحة بواقع سهم لكل  6 أسهم\r\n	2025-12-25 15:06:45.887326
6187	4190	توزيع أرباح نقدية	2007-11-28	\N	\N	\N	\N	SAR	أقر مجلـس الإدارة توزيع أرباح نصف سنويه بواقع ( 4 ) أربع ريالات للسهم الواحد تعادل ما نسبته 40% من القيمة الأسمية للسهم بمبلغ 120 مليون ريال	2025-12-25 15:06:45.887713
6188	4100	توزيع أرباح نقدية	2007-11-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 12% من رأس المال (أو من القيمة الاسمية) بواقع 1.2 ريال للسهم \r\n	2025-12-25 15:06:45.888021
6189	7010	شراء نسبة من شركة	2007-11-27	\N	\N	\N	\N	SAR	الفوز بحصة تبلغ 26% من رخصة الاتصالات الثالثة في الكويت	2025-12-25 15:06:45.888297
6190	4070	توزيع أرباح نقدية	2007-11-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقديةبنسبة 7.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.75 ريال للسهم \r\n	2025-12-25 15:06:45.888548
6191	4240	توزيع أرباح نقدية	2007-11-19	\N	\N	\N	\N	SAR	توزيع أرباح عن الفترة المنتهية فى 30/9/2007 بواقع (واحد ريال للسهم )عن طريق إيداعها آلياً في الحسابات الاستثمارية المرتبطة بمحافظ المساهمين لدى جميع البنوك.	2025-12-25 15:06:45.888828
6192	2130	استحواذ على شركة	2007-11-14	\N	\N	\N	\N	SAR	وقعت الشركة مساء يوم الاربعاء 14نوفمبر 2007م اتفاقية الاستحواذ على كامل اصول وممتلكات شركة إيتاب الدولية مقابل إصدار38.430.000 سهم جديد من أسهم شركة صدق لصالح الشركاء المالكين لشركة إيتاب الدولية بقيمة قدرها 11.25ريال للسهم	2025-12-25 15:06:45.889172
6193	7010	توزيع أرباح نقدية	2007-11-12	\N	\N	\N	\N	SAR	أقر مجلس إدارة الشركـة في اجتماعه المنعقـد يوم الاثنين 10/10/1428هـ الموافق 22/10/2007م توزيع أرباح أولية مقدارها ( 2,500 ) مليون ريال عن الربع الثالث من العام المالي 2007م بواقــع ( 1,25 ) ريال عن كل سهم.	2025-12-25 15:06:45.889475
6194	2130	بيع شركة تابعة	2007-11-11	\N	\N	\N	\N	SAR	قامت الشركة ببيع كامل حصتها في شركة صدق للصاج المدهون\r\n	2025-12-25 15:06:45.889741
6195	4090	توزيع أرباح نقدية	2007-10-31	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية بواقع 60 هللة للسهم الواحد وذلك للمساهمين المسجلين فى سجلات اشركة حتى نهاية تداول يوم 30 سبتمبر 2007 عن طريق التسليم الشخصى.	2025-12-25 15:06:45.88996
6196	2080	شراء نسبة من شركة	2007-10-01	\N	\N	\N	\N	SAR	قامت الشركة بشراء حصص بعض الشركاء بالمصنع السعودي لإسطوانات الغاز بنسبة 7.56% من رأس المال، وبذلك ترفع حصة الشركة برأسمال المصنع إلى 37.56%.	2025-12-25 15:06:45.890215
6197	2270	بيع شركة تابعة	2007-09-30	\N	\N	\N	\N	SAR	قامت الشركة ببيع ما نسبته 100% من ملكيتها فى شركة سدافكو للأغذية والمشروبات- مصر	2025-12-25 15:06:45.890479
6198	4061	تخفيض رأس مال - بتخفيض عدد الأسهم	2007-09-18	\N	\N	\N	\N	SAR	قررت الجمعية العامة غير العادية المنعقدة فى 18/9/2007 تخفيض رأس مال الشركة من (1200) مليون ريال الى (109) مليون ريال بنسبة تغير في رأس المال (90.83%). وبالتالي تخفيض عدد الأسهم من (120) مليون سهم إلى (10.9) مليون سهم بنسبة تخفيض تساوي سهما واحدا لكل 11 سهما تقريبا	2025-12-25 15:06:45.890743
6201	2050	شراء نسبة من شركة	2007-09-08	\N	\N	\N	\N	SAR	قامت الشركة بشراء 10.6 مليون سهماً من أسهم شركة تعمير الأردنية لقاء ثمن مقداره 22.8 مليون دينار أردني (ما يعادل نحو 120 مليون ريال سعودي). والشركة تعمل في مجال التطوير العقاري برأسمال مقداره 300 مليون دولار (ما يعادل نحو 1.225مليار ريال).	2025-12-25 15:06:46.651976
6202	6090	شراء نسبة من شركة	2007-08-14	\N	\N	\N	\N	SAR	تملكت الشركة عدد (536.100 سهم) والتي تمثل نسبة 5% من أسهم شركة إنترفش وهى متخصصة في مجال استزراع الأسماك البحرية بواسطة الأقفاص العائمة وإنتاج الأصبعيات وأعلاف الأسماك وتسويق منتجاتها في اليونان والدول الأوربية الأخرى وذلك بقيمة ( 3.418.660 ريال).	2025-12-25 15:06:46.653018
6203	7010	توزيع أرباح نقدية	2007-08-11	\N	\N	\N	\N	SAR	أقر مجلس الإدارة توزيع أرباح أولية مقدارها ( 2500 ) مليون ريال عن الربع الثاني من العام المالي 2007م بواقــع ( 1.25 ) ريال عن كل سهم.	2025-12-25 15:06:46.653333
6204	1040	توزيع أرباح نقدية	2007-08-08	\N	\N	\N	\N	SAR	قرر مجلس الادارة توزيع أرباح نقدية بواقع 71 هللة للسهم الواحد عن النصف الأول من السنة المالية 2007م وتكون أحقية الأرباح للمساهمين المسجلين كما في نهاية تداول يوم الأربعاء 11 رجب 1428هـ الموافق 25 يوليو 2007م	2025-12-25 15:06:46.653597
6205	2010	توزيع أرباح نقدية	2007-08-06	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع أرباح النصف الأول من العام المالي 2007م بواقع (1) ريال للسهم الواحد وتكون أحقية الأرباح للمساهمين المقيدين بالسجلات الرسمية للشركة بنهاية تداول يوم الأثنين 9/7/1428هـ (حسب تقويم أم القرى) الموافق 23/7/2007م	2025-12-25 15:06:46.653844
6206	3040	تأسيس شركة	2007-08-06	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس "شركة الصناعات الأسمنتية المحدودة" وهى شركة ذات مسؤولية محدودة برأسمال قدره 500 ألف ريال ومركزها الرئيسى مدينة بريدة بغرض إنتاج الخرسانة الجاهزة والبحص والبلوك والمنتجات الأسمنتية.	2025-12-25 15:06:46.65409
6207	2270	توزيع أرباح نقدية	2007-08-06	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 1 ريال للسهم \r\n	2025-12-25 15:06:46.654357
6208	8130	بيع جزء من الشركة	2007-08-05	\N	\N	\N	\N	SAR	تم طرح عدد 2645000 سهم للاكتتاب العام بقيمة إسمية قدرها 10 ريالات للسهم الواحد.	2025-12-25 15:06:46.654726
6209	2050	توزيع أرباح نقدية	2007-08-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن الربع الأول من عام 2007 بنسبة 2.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.25 ريال للسهم \r\n	2025-12-25 15:06:46.654979
6210	3010	توزيع أرباح نقدية	2007-07-31	\N	\N	\N	\N	SAR	قرر مجلس الادارة صرف ارباح للمساهمين عن النصف الاول من عام 2007م، بما يمثل 10% من رأس المال، وذلك للمساهمين المسجلين في سجلات الشركة بنهاية تداول يوم الاحد 1/7/1428هـ الموافق 15/7/2007م، بواقع 1 ريال للسهم	2025-12-25 15:06:46.655244
6211	2020	توزيع أرباح نقدية	2007-07-29	\N	\N	\N	\N	SAR	قرر مجلس الادارة توزيع ( 600 ) مليون ريال أرباح نصف سنوية وذلك للنصف الأول من العام المالي 2007م بواقع (3 ) ريال للسهم الواحد على أن يكون تاريخ الأحقية لمالكي الأسهم بنهاية تداول يوم السبت تاريخ 29 / 6 /1428هـ الموافق 14 / 7 /2007م	2025-12-25 15:06:46.655622
6212	4090	توزيع أرباح نقدية	2007-07-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية علي توزيع أرباح ربعية (كل ثلاثة أشهر ) بما نسبته 3 % من رأسمال طيبة بواقع ثلاثين هللة عن السهم الواحد من الأسهم المصدرة البالغة 150.000.000 سهماً.	2025-12-25 15:06:46.655944
6213	3040	توزيع أرباح نقدية	2007-07-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن النصف الأول من عام 2007 بنسبة 2.30% من رأس المال (أو من القيمة الاسمية) بواقع 2.3 ريال للسهم \r\n	2025-12-25 15:06:46.656517
6214	4080	شراء نسبة من شركة	2007-07-23	\N	\N	\N	\N	SAR	قامت الشركة بشراء 5% من رأس مال شركة الخزامى للإدارة (مساهمة سعودية مقفلة) البالغ 2 مليار ريال باستثمار مقداره 180 مليون ريال وهى شركة متخصصة في تطوير وإدارة الأملاك والعقارات والفنادق	2025-12-25 15:06:46.656942
6215	1090	توزيع أرباح نقدية	2007-07-22	\N	\N	\N	\N	SAR	وافق مجلس الإدارة على اعتماد توزيع أرباح مرحلية نصف سنوية من أرباح العام 2007م بقيمة 1084مليون ريال واقع 1.70 ريال للسهم الواحد للمساهمين المدرجين في سجلات البنك كما في نهاية تداول يوم الثلاثاء بتاريخ 25/6/1428هـ الموافق 10/7/2007م.	2025-12-25 15:06:46.657323
6216	1120	توزيع أرباح نقدية	2007-07-22	\N	\N	\N	\N	SAR	قرر مجلس الإدارة توزيع مبلغ 2025 مليون ريال أرباحا نقدية عن النصف الأول لعام 2007م بواقع 1.50 ريال للسهم الواحد وتكون الأحقية للمساهمين المقيدين بسجل مساهمي المصرف كما في نهاية تداول يوم السبت 29/06/1428هـ الموافق 14/07/2007م.	2025-12-25 15:06:46.657759
6217	1050	توزيع أرباح نقدية	2007-07-21	\N	\N	\N	\N	SAR	قرر مجلس الإدارة اعتماد صرف ربح صافي للسهم الواحد عن الستة شهور الأولى للسنة المالية 2007م قدره (1.25) ريال (واحد ريال وخمسة وعشرون هلله) وسيكون استحقاق الأرباح لحاملي اسهم البنك كما في نهاية تداول يوم الأربعاء 26/6/1428هـ الموافق 11/07/2007م	2025-12-25 15:06:46.658168
6218	4150	توزيع أرباح نقدية	2007-07-21	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الخامس عشر علي توزيع أرباح نقدية عن العام المالي 2006م بمقدار نصف ريال للسهم	2025-12-25 15:06:46.658495
6219	3050	توزيع أرباح نقدية	2007-07-21	\N	\N	\N	\N	SAR	قرر مجلس الإدارة توزيع مبلغ (280 مليون) ريال بواقع ريالين للسهم الواحد كأرباح مرحلية نصف سنوية وستكون أحقية الأرباح للمساهمين المسجلين بسجلات الشركة في نهاية يوم 29/6/1428هـ الموافق 14/7/2007م	2025-12-25 15:06:46.658823
6222	4230	توزيع أرباح نقدية	2007-07-18	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع أرباح نقدية سنوية لعام 2006م بمقدار 1.5 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 5 مايو 2007 وذلك عن طريق التحويل للحساب.	2025-12-25 15:06:46.659635
6223	1030	شراء نسبة من شركة	2007-07-18	\N	\N	\N	\N	SAR	قام البنك 50 % من أسهم مجموعة البركة المصرفية (شركة مساهمة مصرفية بحرينية)	2025-12-25 15:06:46.659978
6224	2260	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-07-17	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية الأولى على زيادة رأس المال بمقدار 375 مليون ريال وذلك بإصدار عدد 37.500 مليون سهم مجاني بمنح سهم واحد مجاني لكل أربعة أسهم	2025-12-25 15:06:46.660349
6225	1010	توزيع أرباح نقدية	2007-07-15	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية عن النصف الأول من عام 2007 بنسبة 16% من رأس المال (أو من القيمة الاسمية) بواقع 1.6 ريال للسهم \r\n	2025-12-25 15:06:46.66074
6226	2010	اصدار صكوك	2007-07-15	\N	\N	\N	\N	SAR	أصدرت الشركة الإصدار الثانى لصكوك بقيمة 8 مليار ريال سعودى بقيمة أسمية تبدا من 10 ألاف ريال سعودى على ان يكون الحد الأدنى لامتلاكها 50 الف ريال سعودى بدون خصم أو علاوة وتستحق فى عام 2027. إن هذه الصكوك تحمل معدل عمولة على أساس سعر يوازى SIBOR زائد هامش محدد سنوياً تستحق دورياً على أساس ربع سنوى صافى الدخل المتحصل من موجودات الصكوك التى تحتفظ بها أمين موجودات الصكوك_ شركة سابك للصكوك (صكوك) المملوكة بالكامل للشركة.	2025-12-25 15:06:46.661942
6227	2050	توزيع أرباح نقدية	2007-07-10	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 5% من رأس المال (أو من القيمة الاسمية) بواقع 0.5 ريال للسهم \r\n\r\n	2025-12-25 15:06:46.662333
6228	4270	بيع جزء من الشركة	2007-07-04	\N	\N	\N	\N	SAR	بناء على موافقة هيئة السوق المالية بتاريخ 19 يونيو 2007 تم طرح 30% من أسهم الشركة للاكتتاب العام.	2025-12-25 15:06:46.662704
6229	4300	توزيع أرباح نقدية	2007-07-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 30% من رأس المال (أو من القيمة الاسمية) بواقع 3 ريال للسهم \r\n	2025-12-25 15:06:46.663079
6230	5110	اصدار صكوك	2007-07-01	\N	\N	\N	\N	SAR	أصدرت الشركة صكوك بقيمة 5 مليار ريال سعودى والقيمة الإسمية للصك الواحد 500 ألف ريال بدون خصم أو علاوة أصدار تستحق الدفع فى عام 2027 . هذه الصكوك تحمل عائد يحسب على أساس سعر سايبور زائداً هامش ربحى تستحق دوريا على أساس ربع سنوى من صافى الدخل المتحصل من موجودات الصكوك المحتفظ بها لدى شركة الكهرباء للصكوك. فى نهاية كل فترة 5 سنوات ستدفع الشركة مبلغ يعادل 10% من إجمالى القيمة الإسمية للصكوك منحة لحملة الصكوك، كما تعهدت الشركة بشراء هذه الصكوك من حامليها فى الأعوام 2012، 2017، 2022 بمبالغ تعادل تقريباً 90%، 60%، 30% من القيمة الإسمية للصك على التوالى.	2025-12-25 15:06:46.663481
6231	4210	بيع شركة تابعة	2007-06-30	\N	\N	\N	\N	SAR	بيع 30% من أسهم الشركة السعودية للطباعة والتغليف (إحدى الشركات التابعة للمجموعة) عن طريق طرحها للاكتتاب العام الأولي	2025-12-25 15:06:46.663861
6232	4080	بيع شركة تابعة	2007-06-26	\N	\N	\N	\N	SAR	باعت الشركة كامل حصتها فى شركة النواصي المحدودة إلى جهة ذات علاقة بالشركة نتج عنها ربح مقداره 9964000 ريال سعودي.	2025-12-25 15:06:46.664206
6233	4240	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-06-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 700000000 ريال من خلال توزيع أسهم منحة بواقع 3 أسهم لكل  4 أسهم	2025-12-25 15:06:46.664604
6234	6040	شراء نسبة من شركة	2007-06-05	\N	\N	\N	\N	SAR	قامت الشركة بشراء 25% من شركة جنات للإستثمار الزراعي\r\n\r\n	2025-12-25 15:06:46.664991
6235	2100	شراء نسبة من شركة	2007-06-05	\N	\N	\N	\N	SAR	قامت بسداد قيمة حصتها في رأس مال شركة جنات للاستثمار الزراعي (تحت التأسيس) والبالغ 7000000 ريال (فقط سبعة مليون ريال) وتمثل نسبة 10% من اجمالي رأس الما ل بالكامل	2025-12-25 15:06:46.665369
6236	6090	شراء نسبة من شركة	2007-06-05	\N	\N	\N	\N	SAR	قامت بسداد قيمة حصتها في رأس مال شركة جنات للإستثمار الزراعي ( تحت التأسيس ) والبالغ 17.500.000 ريال (فقط سبعة عشر مليون وخمسمائة ألف ريال) وتمثل نسبة 25% من إجمالي رأس المال بالكامل	2025-12-25 15:06:46.665773
6237	6090	توزيع أرباح نقدية	2007-06-02	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الخامسة عشرة على توزيع الإرباح بنسبة 10% عن السهم الواحد بواقع ريال واحد لكل سهم	2025-12-25 15:06:46.666132
6238	2050	بيع شركة تابعة	2007-06-02	\N	\N	\N	\N	SAR	المجموعة قد نجحت في بيع كامل حصتها في الشركة المصرية للأسمدة البالغة 30% من إجمالي رأس المال لمجموعة أبراج كبيتال بمبلغ يصل إلى 1.3 مليار ريال، محققة بذلك أرباح رأسمالية تربو على 700 مليون ريال،	2025-12-25 15:06:46.666486
6239	2150	توزيع أرباح نقدية	2007-06-02	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية السابعة عشرة على توزيع أرباح المساهمين بنسبة (10%) من رأس المال بمعدل واحد ريال لكل سهم على أن تكون أحقية الأرباح للمساهمين المالكين لأسهم الشركة بنهاية تداول يوم الأحد 19/4/ 1428 هـ الموافق 6/5/2007م	2025-12-25 15:06:46.666833
6240	2360	إدراج الشركة	2007-05-23	\N	\N	\N	\N	SAR	تم ادراج الشركة بسوق الاسهم السعودي من خلال طرح 30% من الاسهم للاكتتاب العام.	2025-12-25 15:06:46.667214
6241	4040	توزيع أرباح نقدية	2007-05-20	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الثامنة والعشرين علي توزيع الأرباح بواقع ( 70 هللة ) للسهم الواحد وبنسبة ( 7 % ) من رأس المال	2025-12-25 15:06:46.667624
6242	2070	توزيع أرباح نقدية	2007-05-19	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح نقدية بواقع ريال للسهم الواحد بنسبة 10% من القيمة الاسمية للسهم	2025-12-25 15:06:46.667981
6243	2250	توزيع أرباح نقدية	2007-05-16	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية علي توزيع أرباح نقدية مجموعها 225 مليون ريال، بواقع ريال واحد لكل سهم (10% من رأس المال الاسمي)	2025-12-25 15:06:46.668412
6244	5110	توزيع أرباح نقدية	2007-05-14	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الخامسة علي توزيع نقدية بواقع ( 70 هلله) للسهم الواحد بما يعادل (7%) من رأس المال	2025-12-25 15:06:46.668715
6245	2300	توزيع أرباح نقدية	2007-05-12	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية علي توزيع ارباح نقدية بواقع 5% من راس مال الشركة والذي يمثل نصف ريال للسهم للعام 2006م	2025-12-25 15:06:46.668995
6246	4070	بيع شركة تابعة	2007-05-12	\N	\N	\N	\N	SAR	باعت الشركة كامل حصتها فى شركة ستار ميديا القابضة والبالغة 25% لشريكها بمبلغ 50 مليون ريال وستم توجيه عائد البيع فى العديد من الفرص الإستثمارية بموجب الإستراتيجية التى أقرها المجلس.	2025-12-25 15:06:46.669288
6247	4020	توزيع أرباح نقدية	2007-05-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية التاسعة والعشرين علي توزيع ارباح عن عام 2006م بواقع (7.5 %) من القيمة الاسمية للسهم وبمبلغ (75) هللة للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 15 أبريل 2007	2025-12-25 15:06:46.669573
6248	4140	توزيع أرباح نقدية	2007-05-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية السابعه عشر علي توزيع أرباح نقدية عن العام المالي المنتهي في 31/12/2006م، بنسبة (10%) من القيمة الإسمية للسهم أي بواقع واحد (1)ريال للسهم وذلك عن طريق التحويل للحساب.	2025-12-25 15:06:46.669868
6249	4010	توزيع أرباح نقدية	2007-05-06	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الثامنة والثلاثون علي توزيع الأرباح عن عام 2006م بنسبة 5.5% من رأس المال اي بواقع 55 هللة للسهم الواحد.	2025-12-25 15:06:46.670151
6250	6040	توزيع أرباح نقدية	2007-05-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية الثانية والعشرون علي توزيع الأرباح بواقع واحد ريال للسهم وبنسبة 10% من رأس المال.	2025-12-25 15:06:46.675584
6251	1020	توزيع أرباح نقدية	2007-05-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية على المساهمين بنسبة 20% من رأس المال أى بواقع 2 ريال للسهم الواحد	2025-12-25 15:06:46.675872
6252	4090	توزيع أرباح نقدية	2007-05-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية علي توزيع أرباح ربعية (كل ثلاثة أشهر ) اعتباراً من الربع الأول من هذا العام 2007م بما نسبته 3 % من رأسمال طيبة حيث سيتم توزيع تلك الأرباح بواقع ثلاثون هللة عن السهم الواحد من الأسهم المصدرة البالغة 123.036.500	2025-12-25 15:06:46.676157
6253	2050	توزيع أرباح نقدية	2007-05-05	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الثلاثين على توزيع أرباح عن الربع الرابع من العام المالي 2006م بواقع (0.25) ريال للسهم الواحد وذلك بالإضافة إلى ما تم صرفه عن الثلاثة أرباع الأولى من العام المالي 2006 وقدره (0.75) ريال للسهم الواحد ليصبح إجمالي الربح الموزع عن العام المالي 2006 مبلغ 365.25 مليون ريال أي بواقع (واحد ريال) للسهم الواحد وهو ما يمثل نسبة 10% من القيمة الاسمية للسهم.	2025-12-25 15:06:46.676433
6254	2050	توزيع أرباح نقدية	2007-05-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 2.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.25 ريال للسهم \r\n	2025-12-25 15:06:46.676702
6255	2230	توزيع أرباح نقدية	2007-05-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية التاسعة على اقتراح مجلس الإدارة بتوزيع أرباح عن العام 2006م بما يعادل ما نسبته 10 % من رأس المال وذلك بتوزيع مبلغ 63.240.000 ريال بواقع (1) ريال للسهم الواحد علي أن يتم صرفها خلال شهر واحد من تاريخه لمساهمي الشركة والمسجلين بسجلات تداول كما في نهاية تداول يوم انعقاد الجمعية.	2025-12-25 15:06:46.676966
6256	4090	توزيع أرباح نقدية	2007-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية الثامنة عشرة على اقتراح مجلس الإدارة حيث تم إقرار توزيع الأرباح الذي تم عن النصف الأول لعام 2006م بما يعادل ما نسبته 5 % من رأس المال وذلك بتوزيع مبلغ 61.518.250 ريال بواقع (0.50) ريال للسهم الواحد وصرف أرباح بما يعادل ما نسبته 7 % من رأس المال بمبلغ 86.125.550 ريال بواقع (0.70) ريال للسهم الواحد ليصبح إجمالي مبلغ الأرباح الموزعة عن العام المالي 2006م 147.643.800 ريال بواقع 1.20 ريال عن السهم الواحد وبما نسبته 12 % من رأس المال	2025-12-25 15:06:46.677224
6257	4090	زيادة رأس مال - إصدار حقوق أولوية	2007-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية الثانية عشرة علي زيادة رأسمال طيبة من 1230365000 ريال بعدد 123036500 سهم ليصبح 1500000000 ريال بعدد 150000000 سهم بزيادة نسبتها 21.92 % تقريباً وذلك بمنح سهم مجاني لكل مساهم يملك 4.56 سهم تقريباً	2025-12-25 15:06:46.677494
6258	2080	توزيع أرباح نقدية	2007-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع الأرباح النقدية عن عام 2006م بواقع ريال واحد للسهم (أي ما يعادل 10 % من رأس المال)	2025-12-25 15:06:46.677762
6259	2090	توزيع أرباح نقدية	2007-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية رقم (42) على توزيع الأرباح حسب اقتراح مجلس الإدارة بواقع 3 ريال للسهم اى 30 % من رأس المال و سوف تكون احقية صرف الأرباح لمالكى الأسهم فى نهاية تداول يوم انعقاد الجمعية	2025-12-25 15:06:46.678026
6260	4030	توزيع أرباح نقدية	2007-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الثلاثون على توزيع الأرباح بواقع (1) ريال للسهم الواحد بنسبة (10%) من رأس المال	2025-12-25 15:06:46.678286
6261	1020	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 2250000000 ريال من خلال توزيع أسهم منحة بواقع سهم لكل  سهم\r\n	2025-12-25 15:06:46.678557
6262	2060	توزيع أرباح نقدية	2007-04-29	\N	\N	\N	\N	SAR	الموافقة على توصية مجلس الإدارة بتوزيع أرباح نقدية للمساهمين بواقع ريال واحد لكل سهم ، أي (10%) من رأس المال الاسمي	2025-12-25 15:06:46.678906
6263	2320	توزيع أرباح نقدية	2007-04-24	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على اقتراح مجلس الإدارة بتوزيع أرباح نقدية للمساهمين بنسبة 11 % من رأس المال المدفوع فى 31/12/2006م عن فترة التسعة شهور الأخيرة من عام 2006م وبما يعادل 1.1ريال للسهم الواحد حيث سبق وأن تم توزيع أرباح عن الربع الأول من العام بواقع 60هللة للسهم الواحد وستكون أحقية أرباح فترة التسعة شهور لمالكي أسهم الشركة بنهاية تداول يوم انعقاد الجمعية	2025-12-25 15:06:46.679311
6264	4140	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-04-19	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 108000000 ريال من خلال توزيع أسهم منحة بنسبة 50% من رأس المال\r\n	2025-12-25 15:06:46.679795
6265	6010	توزيع أرباح نقدية	2007-04-18	\N	\N	\N	\N	SAR	وافقت الجمعية العامه العادية الخامسة والعشرين على إقتراح مجلس الإدارة بتوزيع ارباح للمساهمين بنسبة 15 % من القيمة الاسمية للسهم بواقع 1.5 ريال للسهم الواحد والاحقية لمالكي الاسهم بنهاية تداول يوم انعقاد الجمعية	2025-12-25 15:06:46.681346
6266	7010	شراء نسبة من شركة	2007-04-16	\N	\N	\N	\N	SAR	قامت الشركة بشراء 97% من الشركة العربية لخدمات الانترنت والاتصالات (أول نت) وتبلغ قيمة هذه الصفقة 98.940.000 ريال (ثمانية وتسعون مليوناً وتسعمائة وأربعون ألف ريال)	2025-12-25 15:06:46.68209
6267	4210	توزيع أرباح نقدية	2007-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع أرباح بمبلغ (160) مليون ريال عن عام 2006م بما يعادل(20%) من رأس المال أي بواقع (2) ريال للسهم الواحد على المساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول27 مارس 2007 وذلك عن طريق التحويل للحساب.	2025-12-25 15:06:46.682558
6268	2040	توزيع أرباح نقدية	2007-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على اقتراح مجلس الادارة توزيع أرباح نقدية بواقع (2.5) ريال للسهم الواحد، وستكون أحقية الأرباح لمالكي أسهم الشركة المقيدين في السجلات بنهاية تداول يوم انعقاد الجمعية العامة	2025-12-25 15:06:46.683125
6269	2010	توزيع أرباح نقدية	2007-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على اقتراح مجلس الإدارة توزيع أرباح نقدية بواقع (4) ريالات للسهم الواحد ، علماً أنه قد تم توزيع (1.5) ريال للســــهم الواحد عن النصف الأول من العام 2006م ، وستكون أحقية النصف الثاني من الأرباح والتي تمثل (2.5) ريال للسهم الواحد - لمالكي أسهم الشركة المقيدين في السجلات بنهاية تداول يوم انعقاد الجمعية العامة	2025-12-25 15:06:46.685386
6270	3020	توزيع أرباح نقدية	2007-04-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 20% من رأس المال (أو من القيمة الاسمية) بواقع 2 ريال للسهم \r\n	2025-12-25 15:06:46.686029
6271	7010	توزيع أرباح نقدية	2007-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على اقتراح مجلس الإدارة توزيع أرباح عن الربع الرابع للعام 2006م بمقدار (1.5) ريال للسهم، حيث قد تم توزيع (4.25) ريال للسهم عن الثلاثة الأرباع الأولى من العام نفسه، ليصبح إجمالي ما تم توزيعه من أرباح بنهاية عام 2006 م (5.75) ريال للسهم	2025-12-25 15:06:46.686566
6272	4080	زيادة رأس مال - إصدار حقوق أولوية	2007-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على زيادة رأس المال من خلال طرح أسهم حقوق أولوية بقيمة 1218750000 ريال ، مقتصرة على مساهمي الشركة المقيدين بسجلات الشركة في نهاية تداول يوم انعقاد الجمعية العامة غير العادية. بسعر طرح للسهم الواحد 27 ريال (10 ريال قيمة أسمية 17 ريال علاوة إصدار) وعدد الأسهم المطروحة للاكتتاب 45138889 سهم بمعدل 5 أسهم لكل 9 أسهم مملوكة في تاريخ الأحقية لتكون عدد أسهم الشركة بعد الزيادة 126388889 سهماً بدلاً من 81250000	2025-12-25 15:06:46.68685
6273	2060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-04-11	\N	\N	\N	\N	SAR	أقرت الجمعية العامة غير العادية زيادة رأس المال من 2330490500 ريال إلى 3495735750 ريال بنسبه 50% وذلك بمنح سهم مجاني لكل سهمين	2025-12-25 15:06:46.687121
6274	2240	توزيع أرباح نقدية	2007-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على اقتراح مجلس الإدارة بتوزيع أرباح نقدية بواقع (1.5) ريال للسهم الواحد أي بنسبة 15% من رأس المال	2025-12-25 15:06:46.687413
6275	2280	توزيع أرباح نقدية	2007-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية للمساهمين على توزيع أرباح لحاملي الأسهم بتاريخ الإجتماع بنسبة 20% من القيمة الأسمية للأسهم بمعدل 2 ريال للسهم الواحد وبإجمالي قدره (200) مليون ريال	2025-12-25 15:06:46.687695
6276	2020	توزيع أرباح نقدية	2007-04-07	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الثامنة والثلاثين على توصية مجلس الإدارة بتوزيع أرباحا للمساهمين مبلغ ( 1100) مليون ريال عن عام 2006م ، بواقع ( 5.5 ) ريال للسهم الواحد بنسبة ( 55% ) من رأس المال ، وقد تم صرف ( 2.5 ) ريال عن النصف الأول، وسيتم صرف ( 3 ) ريال عن النصف الثاني	2025-12-25 15:06:46.687956
6277	2180	توزيع أرباح نقدية	2007-04-04	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع ارباح للمساهمين بنسبة 12 % اي بواقع ( 1.20 )ريال وعشرين هلله للسهم الواحد.	2025-12-25 15:06:46.688211
6278	1060	توزيع أرباح نقدية	2007-04-02	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية عن النصف الثانى من عام 2006 بنسبة 22.5% من رأس المال (أو من القيمة الاسمية) بواقع 2.25 ريال للسهم \r\n	2025-12-25 15:06:46.688474
6279	1050	توزيع أرباح نقدية	2007-04-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على توصية مجلس الإدارة بشأن توزيع الأرباح عن النصف الثاني من العام المالي 2006م بمقدار نصف ريال للسهم لحملة أسهم البنك	2025-12-25 15:06:46.688799
6280	2090	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-04-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على زيادة رأس مال الشركة من 237,500,000 ريال سعودى الى 316,666,667 ريال سعودى بزيادة قدرها 33.3% بإصدار 7,916,667 سهم قيمة كل سهم 10 ريال (عشر ريال) تسدد قيمتها من الأرباح المبقاة و ذلك بعد حجز الاحتياطي النظامى و توزيعات الأرباح للمساهمين وذلك بواقع سهم مجانى لكل ثلاثة اسهم .و بذلك يصبح عدد اسهم الشركة 31,666,667 سهم بدلا من 23,750,000 سهم	2025-12-25 15:06:46.689057
6281	3030	توزيع أرباح نقدية	2007-03-31	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية السابعة والأربعيـن للمساهميـن على إقتراح مجلس الإدارة بشأن توزيع الأرباح لعام 2006م بنسبة 36% من رأس المال المدفوع أي بواقع 3,6 ريالا لكل سهم	2025-12-25 15:06:46.689328
6282	3050	توزيع أرباح نقدية	2007-03-31	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الثامنة والعشرين على توزيع أرباح نقدية على المساهمين عن النصف الثانى لعام 2006 بواقع 2 ريال للسهم	2025-12-25 15:06:46.689603
6283	2030	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-03-31	\N	\N	\N	\N	SAR	وافقت الجمعيه العامة غير العادية السابعة على زيادة رأس مال الشركة من أربعين مليون ريال(أربعة ملايين سهم) إلى ستين مليون ريال (ستة ملايين سهم) وذلك بإصدار مليوني سهم بقيمة عشرين مليون ريال بنسبة زيادة خمسين في المائة (50%) من رأس المال ، عن طريق منح سهم واحد مجاني مقابل كل سهمين قائمين يملكها المساهمين المقيدين بسجل المساهمين بنهاية يوم انعقاد الجمعية العامة غير العادية	2025-12-25 15:06:46.689867
6284	3040	توزيع أرباح نقدية	2007-03-31	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح نقدية بواقع 4.60 ريال للسهم الواحد عن عام 2006.	2025-12-25 15:06:46.690134
6285	2210	تأسيس شركة	2007-03-31	\N	\N	\N	\N	SAR	قامت الشركة خلال الربع الاول من عام 2007 بتأسيس شركة جديدة ذات مسئولية محدودة بإسم شركة نماء للإستثمار الصناعى مملوكة بنسبة 95% ويبلغ رأس مال الشركة الجديدة 1.000.000 ريال سعودى مقسمة إلى 1.000 حصة قيمة كل حصة 1.000 ريال سعودى	2025-12-25 15:06:46.690465
6286	1090	شراء نسبة من شركة	2007-03-30	\N	\N	\N	\N	SAR	سامبا" تستحوذ على68.4% من بنك كريسينت الباكستاني بقيمة 100 مليون دولار .	2025-12-25 15:06:46.690712
6287	4190	توزيع أرباح نقدية	2007-03-28	\N	\N	\N	\N	SAR	وافقت الجمعية العامه السادسه على توزيع أرباح على مساهميها قدرها (180) مليون ريال بنسبة 60 في المائة من رأس المال المدفوع بمعدل (6) ريال للسهم عن العام المالي 2006م	2025-12-25 15:06:46.690982
6288	3090	زيادة رأس مال - إصدار حقوق أولوية	2007-03-27	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية الأولى على زيادة رأس مال الشركة من 700 مليون ريال (70 مليون سهم ) إلى 900 مليون ريال (90 مليون سهم ) و ذلك بإصدار 20 مليون سهم بقيمة 200 مليون ريال عن طريق منح سهمين مجانيين لكل سبعة أسهم بنسبة تغير 28.6 % و تحويل مبلغ 200 مليون ريال من الأرباح المبقاة.	2025-12-25 15:06:46.691285
6289	2280	زيادة رأس مال - إصدار حقوق أولوية	2007-03-27	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية علي اصدار 9 مليون سهم لمالكي شركة المخابز الغربية المحدودة و الشركة التابعة لها الشركة العالمية لخدمات المخابز المحدودة نظير استحواذ المراعي علي هاتين الشركتين و نتج عن ذلك زبادة راس المال	2025-12-25 15:06:46.691538
6290	2280	استحواذ على شركة	2007-03-27	\N	\N	\N	\N	SAR	إستحواذ المراعي على كافة الحصص في شركة المخابز الغربية ، وشركة خدمات المخابز العالمية مقابل إصدار (9) ملايين سهم جديد في شركة المراعي لمالكي هذه الشركات ليرتفع عدد أسهم الشركة من (100) مليون سهم إلى (109) مليون سهم وتمثل نسبة 9% من أسهم الشركة	2025-12-25 15:06:46.691879
6291	1050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-03-25	\N	\N	\N	\N	SAR	وافقت الجمعيه العامة غير العادية المنعقدة يوم السبت 24/3/2007م على زيادة رأس مال البنك من 3375 مليون ريال سعودي إلى 5625 مليون ريال سعودي بنسبة قدرها 67% وذلك بمنح سهمين مقابـل كل ثلاثة أسهم للمساهمين وبإجمالي مقداره 2250 مليون ريال سعودي تمول من الأحتياطي العام للبنك وزاد وعدد اسهم البنـك من 337.500.000 سهم إلى 562.500.000 سهم	2025-12-25 15:06:46.692266
6292	3080	توزيع أرباح نقدية	2007-03-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 40% من رأس المال (أو من القيمة الاسمية) بواقع 4 ريال للسهم \r\n	2025-12-25 15:06:46.692757
6293	2120	زيادة رأس مال - إصدار حقوق أولوية	2007-03-25	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى زيادة رأس المال إلى 432 مليون ريال من خلال إصدار أسهم حقوق أولوية\r\nيواقع 3 اسهم لكل سهم بقيمة اسمية 10 ريال و بعلاوة اصدار 10 ريال لكل سهم	2025-12-25 15:06:46.693035
6294	1090	توزيع أرباح نقدية	2007-03-20	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على اقتراح مجلس الإدارة بتوزيع ربح وقدره 1.70 ريال للسهم إضافة إلى المبلغ الذي تم توزيعه عن النصف الأول من السنة وقدره 1.70 ريال للسهم، بحيث يصبح إجمالي الربح الموزع 3.40 ريال سعودي	2025-12-25 15:06:46.693288
6295	1040	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-03-20	\N	\N	\N	\N	SAR	صادقت الجمعية غير العادية للمساهمين على اقتراح مجلس الادارة بزيادة رأس المال بنسبة 20% أى بزيادة من 2.205 مليون ريال إلى 2.646 مليون ريال من خلال رسملة مبلغ 441 مليون ريال من الإحتياطي العام للبنك إلى رأس المال ومنح أسهم مجانية بواقع سهم لكل خمسة أسهم يملكها المساهمين ليصبح بذلك إجمالي عدد الأسهم الممثلة لرأسمال البنك 000ر600ر264 سهماً بقيمة إسمية قدرها (10 ريال) ، عشرة ريالات للسهم الواحد	2025-12-25 15:06:46.693533
6296	1080	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-03-18	\N	\N	\N	\N	SAR	أقرت الجمعية العامة غير العادية السابعة عشرة الموافقة على زيادة رأس مال البنك من (3.250 ) مليون ريال إلى (4.550 ) مليون ريال بمنح سهميين مجانيين لكل خمسة أسهم قائمة بنسبة زيادة 40% وتحويل مبلغ ( 650 ) مليون ريال من بند الأرباح إلى الاحتياطي النظامي، ومبلغ ( 1.270 ) مليون ريال إلى الاحتياطي العام،	2025-12-25 15:06:46.6943
6297	8010	توزيع أرباح نقدية	2007-03-17	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح نقدية على المساهمين بمبلغ قدره 500 مليون ريال وبواقع 10 ريال للسهم.	2025-12-25 15:06:46.694574
6298	3010	توزيع أرباح نقدية	2007-03-12	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية التاسعة والأربعون الموافقة على الأرباح الموزعة عن العام المالي 2006م بنسبة 40% من رأس المال وبواقع 4 ريال للسهم، علما بأنه تم توزيع 1.2 ريال للسهم دفعة مقدمة كأرباح للنصف الأول للعام المالي 2006م	2025-12-25 15:06:46.694839
6299	3060	توزيع أرباح نقدية	2007-03-10	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح نقدية للنصف الثاني من عام 2006 بواقع 4 ريال للسهم وبنسبة 40%.	2025-12-25 15:06:46.6951
6300	1120	توزيع أرباح نقدية	2007-03-10	\N	\N	\N	\N	SAR	اقرت الجمعية العامة العادية التاسعة عشر على توزيع الإرباح عن العام 2006م بواقع (1) ريال للسهم الواحد بنسبة 10% من القيمة الاسمية للسهم.	2025-12-25 15:06:46.695348
6301	1010	توزيع أرباح نقدية	2007-03-05	\N	\N	\N	\N	SAR	أقرت الجمعية العامة العادية توصية مجلس الإدارة على توزيع (1000) مليون ريال أرباحاً على المساهمين عن النصف الثاني لعام 2006 م وذلك بواقع (1.6) ريالاً للسهم الواحد، بالإضافة إلى ما سبق توزيعه في النصف الأول من عام 2006 م وقدره (1000) مليون ريال بواقع (1.6) ريالاً للسهم الواحد. وبذلك أصبح إجمالي ما اعتمد توزيعه (3.2) ريال للسهم الواحد عن عام 2006 م	2025-12-25 15:06:47.512655
6302	1120	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2007-03-03	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى زيادة رأس المال إلى 13.5 مليار ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل  1 سهم\r\nليصبح عدد الأسهم 1350 مليون سهم	2025-12-25 15:06:47.513316
6303	1030	زيادة رأس مال - إصدار حقوق أولوية	2007-02-28	\N	\N	\N	\N	SAR	قررت الجمعية العامة غير العادية زيادة رأس المال بمبلغ 1,503,910,000 ريال بنسبة زيادة بلغت 62.5% .بتحويل جزء من حساب الأرباح المبقاة وإصدار عدد 150,391,000 سهم مجاني وتوزيعها على أساس سهم لكل 6ر1 سهم قائم على حملة أسهم البنك.	2025-12-25 15:06:47.513643
6304	4100	شراء نسبة من شركة	2007-02-17	\N	\N	\N	\N	SAR	أعلنت الشركة عن إيداعها مبلغ 640,232,130 ريال لدى بنك الرياض وذلك قيمة حصتها النقدية في رأس مال شركة جبل عمر للتطوير (شركة مساهمة تحت التأسيس) وذلك بخلاف حصتها العينية البالغة (755) مليون ريال وبذلك فإن نسبة حصة شركة مكة للانشاء والتعمير في رأس مال شركة جبل عمر للتطوير تقدر بحوالي 21% من رأس مال الشركة.	2025-12-25 15:06:47.513922
6305	4030	بيع شركة تابعة	2007-02-05	\N	\N	\N	\N	SAR	قررت الشركة بيع حصتها في الشركة العربية لناقلات الكيماويات نظراً لانها تمتلك شركة أخرى مع شركة سابك تقوم بنفس النشاط ، وهي الشركة الوطنية لنقل الكيماويات (ncc) .	2025-12-25 15:06:47.514241
6306	4160	زيادة حصة الشركة فى شركة تابعة	2007-01-15	\N	\N	\N	\N	SAR	تم توقيع عقد شراء لحوم وسمي فرع شركة مجموعة الفيصلية القابضة المحدودة وبقيمة قدرها 8 مليون ريال. ويشمل عقد الشراء على سلسلة فروع لحوم وسمي وعددها ( 10 ) فروع، والمنتشرة في مدن (الرياض، جدة، الظهران، الخبر).	2025-12-25 15:06:47.514527
6307	4080	شراء نسبة من شركة	2007-01-09	\N	\N	\N	\N	SAR	أعلنت شركة عسير للتجارة والسياحة والصناعة عن شراء 20% من رأس مال شركة مجموعة التوفيق المالية البالغ360 مليون ريال بقيمة 72 مليون ريال سعودى .	2025-12-25 15:06:47.514796
6308	4030	شراء نسبة من شركة	2006-12-31	\N	\N	\N	\N	SAR	أعلنت الشركة الوطنية السعودية للنقل البحري شراء نسبة 10%من رأس مال الشركة العربية المتحدة للزجاج المسطح بمبلغ قدره 20 مليون ريال سعودى تم دفع 11.2 مليون ريال منها حتى 31 /12/2006	2025-12-25 15:06:47.515059
6309	2010	استحواذ على شركة	2006-12-29	\N	\N	\N	\N	SAR	قامت الشركة بالاستحواذ على كامل أسهم شركة هنتسمان للبتروكيماويات المحدودة بالمملكة المتحدة وهى شركة غير مدرجة تعمل فى صناعة الكيماويات الأساسية بقيمة بلغت 685 مليون دولار أمريكى	2025-12-25 15:06:47.515321
6310	4100	توزيع أرباح نقدية	2006-12-23	\N	\N	\N	\N	SAR	أعلنت شركة مكة للإنشاء والتعمير عن توزيع 1.2 ريال للسهم الواحد بواقع 12% من رأس المال	2025-12-25 15:06:47.515579
6311	4061	تغيير اسم الشركة	2006-12-17	\N	\N	\N	\N	SAR	أقرت الجمعية العامة غير العادية تعديل أسم الشركة من (شركة المواشى المكيرش المحدودة) الى ( مجموعة أنعام الدولية القابضة ) بعد دمج سلسلة سوبر ماركت الراية وسلسلة سوبر ماركت الدانوب الى الشركة	2025-12-25 15:06:47.515837
6426	4030	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	أعلنت الشركة الوطنية السعودية للنقل البحري عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.373997
6312	2050	توزيع أرباح نقدية	2006-12-06	\N	\N	\N	\N	SAR	تمت الموافقة توزيع أرباح نقدية عن الربع الثالث من العام المالي 2006 قدرها 93.75 مليون ريال وذلك بواقع 0.25 ريال للسهم الواحد	2025-12-25 15:06:47.51613
6313	4090	تأسيس شركة	2006-11-29	\N	\N	\N	\N	SAR	وافق مجلس إدارة شركة طيبة للاستثمار والتنمية العقارية على تحويل الشركة الى شركة قابضة	2025-12-25 15:06:47.516473
6314	4030	زيادة رأس مال - إصدار حقوق أولوية	2006-11-25	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية لشركة الوطنية السعودية للنقل البحري على زيادة رأس مال الشركة من 2.250 مليون ريال إلى 3.150 مليون ريال عن طريق الإكتتاب فى 90 مليون سهم حقوق أولوية بقيمة قدرها 1.440 مليون ريال.	2025-12-25 15:06:47.525096
6315	7010	توزيع أرباح نقدية	2006-11-20	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:47.525499
6316	2050	توزيع أرباح نقدية	2006-11-11	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع أرباح نقدية عن الربع الثانى من العام المالي 2006 بواقع 0.25 ريال للسهم الواحد	2025-12-25 15:06:47.525829
6317	4240	بيع جزء من الشركة	2006-10-07	\N	\N	\N	\N	SAR	أعلنت شركة فواز عبدالعزيز الحكير وشركاه عن طرح 12 مليون سهم من رأس مال الشركة للأكتتاب العام بسعر 110 ريال سعودى للسهم تمثل 30% من إجمالى رأس مال الشركة	2025-12-25 15:06:47.526068
6318	1060	تأسيس شركة	2006-09-30	\N	\N	\N	\N	SAR	وافقت هيئة السوق المالية الجهة المنظمة للسوق المالية والبورصة،على طلب البنك لتأسيس أول شركة استثمارية مستقلة تقدم خدمات متكاملة في المملكة بموجب نظام السوق المالية الجديد وذلك بنسبة 40%	2025-12-25 15:06:47.526325
6319	4220	تأسيس شركة	2006-09-30	\N	\N	\N	\N	SAR	تم إعلان تأسيس شركة أعمار المدينة الاقتصادية شركة مساهمة عامة برأسمال قدره 8.500.000.000 ريال سعودى مقسم إلى 850,000,000 سهماَ تبلغ القيمة الاسمية للسهم عشرة ريالات تم الأكتتاب فى 595.000.000 سهم تمثل 70 % من رأس مال الشركة وتتخذ من محافظة جدة مقراً لها ,وستكون مدة الشركة( 99 ) تسعة وتسعون سنة تبدأ من تاريخ القرار الوزاري الصادر بإعلان تأسيسها ويجوز إطالة مدة الشركة بقرار تصدره الجمعية العامة غير العادية	2025-12-25 15:06:47.526572
6320	4230	تأسيس شركة	2006-09-30	\N	\N	\N	\N	SAR	أعلنت شركة البحر الأحمر لخدمات الأسكان عن تأسيس شركة البحر الأحمر لخدمات الإسكان - قطر شركة ذات مسؤولية محدودة. ("شركة البحر الأحمر - قطر") وقد تم تسجيلها في الدوحة بقطر بنسبة ملكية قدرها 49% بناءً على النظام الأساسي لشركة البحر الأحمر - قطر تسيطر الشركة على الناحية المالية والسياسات التشغيلية لشركة البحر الأحمر - قطر	2025-12-25 15:06:47.526903
6321	7010	تأسيس شركة	2006-09-26	\N	\N	\N	\N	SAR	<P align=right>وافق مجلس إدارة الشركة على إسهام الاتصالات السعودية في تأسيس شركة تجاري السعودية شركة مساهمة ذات مسؤولية محدودة مع شركة الاستثمارات التقنية والشركة الوطنية لأنظمة المعلومات بحصة تأسيسية قوامها 50 في المائة، حيث ستركز نشاطها على إنشاء وتشغيل وإدارة المنصات والأسواق الإلكترونية. <BR></P>	2025-12-25 15:06:47.52716
6322	4230	تغيير السنة المالية	2006-09-25	\N	\N	\N	\N	SAR	وفقاً للقرار الوزارى الصادر بتحويل الشكل النظامى للشركة إلى شركة مساهمة تم تغيير نهاية السنة المالية للشركة من 31 مارس إلى 31 ديسمبر.	2025-12-25 15:06:47.527393
6323	4020	زيادة رأس مال - إصدار حقوق أولوية	2006-09-17	\N	\N	\N	\N	SAR	أعلنت الشركة العقارية السعودية عن زيادة رأس المال من 600 مليون ريال سعودى الى 1.200 مليون ريال سعودى عن طريق إصدار 30 مليون سهم حقوق أولوية ومنح 30 مليون سهم مجانى بواقع سهم لكل سهمين بقيمة أسمية 10ريال سعودى	2025-12-25 15:06:47.527616
6324	1140	تأسيس شركة	2006-09-17	\N	\N	\N	\N	SAR	تأسيس "شركة البلاد العقارية" برأس مال قدره 500 ألف ريال من أجل القيام بإجراءات التسجيل المتعلقة بالضمانات العقارية التى يحصل عليها البنك من عملائه.	2025-12-25 15:06:47.527832
6325	2240	شراء نسبة من شركة	2006-09-10	\N	\N	\N	\N	SAR	قامت الشركة بشراء 2.75 % من رأسـمال شــركة المرافـق الحديثـة للتطوير العـقاري المحـدودة بقيمة 46.585.503 ريال سعودى	2025-12-25 15:06:47.528071
6326	2260	تأسيس شركة	2006-09-02	\N	\N	\N	\N	SAR	تم تأسيس "شركة الواحة للبتروكيماويات" وهى شركة سعودية ذات مسؤولية محدودة برأسمال 1.237 مليون ريال ومملوكة بنسبة 75% من قبل الشركة.	2025-12-25 15:06:47.528317
6327	2010	توزيع أرباح نقدية	2006-08-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:47.528583
6328	4090	توزيع أرباح نقدية	2006-08-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية الثامنة عشرة على توزيع الأرباح عن النصف الأول لعام 2006م بما يعادل ما نسبته 5 % من رأس المال وذلك بتوزيع مبلغ 61.518.250 ريال بواقع (0.50) ريال للسهم الواحد	2025-12-25 15:06:47.528825
6329	7010	توزيع أرباح نقدية	2006-08-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 1.5 ريال للسهم \r\n	2025-12-25 15:06:47.529055
6330	3060	توزيع أرباح نقدية	2006-08-12	\N	\N	\N	\N	SAR	صرف أرباح النصف الأول لعام 2006 بواقع نصف ريال للسهم	2025-12-25 15:06:47.529271
6331	4230	بيع جزء من الشركة	2006-08-12	\N	\N	\N	\N	SAR	أعلنت شركة البحر الأحمر لخدمات الإسكان عن طرح 9 مليون سهم بقيمة أسمية 58 ريال سعودى للسهم تمثل 30% من أسهم الشركة .	2025-12-25 15:06:47.529494
6332	1040	توزيع أرباح نقدية	2006-08-09	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 8.5% من رأس المال (أو من القيمة الاسمية) بواقع 0.85 ريال للسهم \r\n	2025-12-25 15:06:47.529719
6333	1090	توزيع أرباح نقدية	2006-07-29	\N	\N	\N	\N	SAR	وافقت الجمعية العامة للمساهمين على توزيع ارباح نصف سنويه بواقع 1.70 ريال للسهم وذلك للمساهمين السعوديين	2025-12-25 15:06:47.529953
6334	1050	توزيع أرباح نقدية	2006-07-26	\N	\N	\N	\N	SAR	أعلن البنك السعودي الفرنسي في بيان أمس، أن مجلس إدارة البنك قرر توزيع أرباح نصف سنوية للمساهمين بعد خصم الزكاة قدرها 1.5 ريال صافيه للسهم الواحد، عن النصف الأول من العام المالي 2006	2025-12-25 15:06:47.530253
6335	3050	توزيع أرباح نقدية	2006-07-25	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح النصف الأول لعام 2006 بواقع 2 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة بنهاية تداول يوم 30 يونيو 2006	2025-12-25 15:06:47.530485
6336	1060	توزيع أرباح نقدية	2006-07-23	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع أرباح نقدية عن النصف الاول لعام 2006 قدرها 1.50 ريال للسهم	2025-12-25 15:06:47.530704
6337	3010	توزيع أرباح نقدية	2006-07-22	\N	\N	\N	\N	SAR	أعلنت شركة الاسمنت العربية المحدودة عن توزيع أرباح النصف الاول بواقع 1.2 ريالات للسهم	2025-12-25 15:06:47.530928
6338	2020	توزيع أرباح نقدية	2006-07-22	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية على توزيع أرباح نقدية على المساهمين عن النصف الأول لعام 2006 بواقع 2.5 ريال للسهم	2025-12-25 15:06:47.531169
6339	4220	بيع جزء من الشركة	2006-07-22	\N	\N	\N	\N	SAR	أعلنت شركة إعمار المدينة الاقتصادية طرح 255.000.000 مليون سهم من أسهم الشركة للاكتتاب العام تمثل 30% من رأس مال الشركة بقيمة أسمية 10 ريال للسهم	2025-12-25 15:06:47.532871
6340	1010	توزيع أرباح نقدية	2006-07-10	\N	\N	\N	\N	SAR	وافق البنك على توزيع ألف مليون ريال بواقع 1.6 ريال للسهم الواحد في شهر يوليو 2006م عن النصف الأول من عام 2006م	2025-12-25 15:06:47.533214
6341	1080	توزيع أرباح نقدية	2006-07-08	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نصف سنوية عن النصف الاول من عام 2006 بواقع 1 ريال للسهم	2025-12-25 15:06:47.53355
6342	4300	توزيع أرباح نقدية	2006-07-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 150% من رأس المال (أو من القيمة الاسمية) بواقع 15 ريال للسهم \r\n	2025-12-25 15:06:47.533882
6343	2060	زيادة رأس مال - إصدار حقوق أولوية	2006-07-03	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية للشركة على زيادة رأس المال من 1.570.000ألف ريال إلى 2.330.491 ألف ريال مقسم إلى 233.049 ألف سهم قيمة كل منها 10 ريال سعودى وتم اصدار 76.049 ألف سهم	2025-12-25 15:06:47.534222
6344	4090	زيادة رأس مال - إصدار حقوق أولوية	2006-06-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية غير العادية للشركة على زيادة رأس مال الشركة من (750)مليون ريال الى (1.230.365) مليون ريال بعد الاكتفاء بالمبلغ الذى تم الاكتتاب فيه والبالغ 480.365.000 ريال ليصبح رأس مال المكتتب فيه والمدفوع 1.230.365.000 ريال	2025-12-25 15:06:47.534558
6345	1020	توزيع أرباح نقدية	2006-06-27	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 30% من رأس المال (أو من القيمة الاسمية) بواقع 3 ريال للسهم \r\n	2025-12-25 15:06:47.534925
6346	2050	توزيع أرباح نقدية	2006-06-20	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع ارباح قدرها 75 مليون ريال عن الربع الاول من العام المالي 2006 بواقع 25 هللة للسهم الواحد وهو ما يمثل 55.2% من الارباح الصافية التي حققتها المجموعة عن الربع الاول من عام 2006م البالغة 135.8 مليون ريال.	2025-12-25 15:06:47.535287
6347	2150	توزيع أرباح نقدية	2006-06-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 50% من رأس المال (أو من القيمة الاسمية) بواقع 5 ريال للسهم \r\n	2025-12-25 15:06:47.535623
6348	2010	تأسيس شركة	2006-06-14	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شركة سابك للصكوك وهى شركة ذات مسئولية محدودة برأس مال قدره 500.000 ريال سعودى وهى مملوكة بالكامل للشركة	2025-12-25 15:06:47.535959
6349	4110	توزيع أرباح نقدية	2006-06-11	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح عن عام 2005 بواقع 4 ريالات للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 24 أبريل 2006 عن طريق التحويل للحساب.	2025-12-25 15:06:47.536292
6350	2140	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-06-08	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة الى 428.75 مليون ريال  وذلك بمنح سهم مجاني مقابل كل 4 أسهم يملكها المساهمون 	2025-12-25 15:06:47.536635
6351	2220	زيادة رأس مال - إصدار حقوق أولوية	2006-06-07	\N	\N	\N	\N	SAR	وافقت هيئة السوق المالية على زيادة رأسمال الشركة من (125.000.000) مليون ريال إلى (163.561.250) ريال وذلك بإصدار عدد (3.856.125) سهم جديدة بغرض شراء الشركة العربية للمحاور والمسابك وقطع الغيار بالكامل والتى تملك الشركة ما نسبته 0.6%	2025-12-25 15:06:47.536972
6352	3080	شراء نسبة من شركة	2006-06-01	\N	\N	\N	\N	SAR	سددت الشركة 79.749.980 ريال سعودى يمثل حصتها من زيادة رأس مال شركة التصنيع وخدمات الطاقة .	2025-12-25 15:06:47.537333
6353	6090	توزيع أرباح نقدية	2006-05-29	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الرابعة عشر على توزيع أرباح نقدية سنوية عن عام 2005 بواقع 2.5 ريال للسهم	2025-12-25 15:06:47.537717
6354	2110	زيادة رأس مال - إصدار حقوق أولوية	2006-05-29	\N	\N	\N	\N	SAR	وافق المساهمون على زيادة رأس المال بمبلغ 120 مليون ريال سعودى عن طريق طرح الأسهم للأكتتاب وتم تغطيتها فى شهر مايو 2006	2025-12-25 15:06:47.538139
6355	2250	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-05-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية علة زيادة رأس المال من 1.800.000.000 ريال إلى 2.250.000.000 عن طريق توزيع أسهم منحة للمساهمين بنسبة سهم لكل أربعة أسهم .	2025-12-25 15:06:47.538507
6356	4040	توزيع أرباح نقدية	2006-05-16	\N	\N	\N	\N	SAR	اعلنت شركة السعودية للنقل الجماعي في 11/3/2006 عن توزيع ارباح (3.00 ريال للسهم) في يوم 16/5/2006 وتستحق الي يوم 19/4/2006 عن طريق التحويل للحساب.	2025-12-25 15:06:47.538864
6357	5110	توزيع أرباح نقدية	2006-05-15	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية للكهرباء عن بدء صرف الأرباح لعام 2005م بواقع (70) هلله للسهم إعتباراً من يوم 15/5/2006م كما طالبت الشركة السعودية للكهرباء المساهمين الذين لم يستبدلوا شهادات الأسهم القديمة التي تحمل أسم شركات الكهرباء السابقة المندمجة بالشركة أستبدال شهاداتهم القديمة بشهادة الأسهم الجديدة وتحديث بياناتهم ،	2025-12-25 15:06:47.53935
6358	2070	توزيع أرباح نقدية	2006-05-15	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح نقدية بواقع 5 ريال للسهم الواحد بنسبة 10 % من القيمة الاسمية للسهم.	2025-12-25 15:06:47.539719
6359	4150	توزيع أرباح نقدية	2006-05-13	\N	\N	\N	\N	SAR	اعلنت شركة الرياض للتعمير في 13/12/2005 عن توزيع ارباح (2.50 ريال للسهم) في يوم 13/5/2006 وتستحق الي يوم 4/4/2006 عن طريق التحويل للحساب	2025-12-25 15:06:47.540112
6360	7010	توزيع أرباح نقدية	2006-05-08	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع أرباح نقدية بواقع 1.25 ريال للسهم الواحد	2025-12-25 15:06:47.540514
6361	2010	توزيع أرباح نقدية	2006-05-06	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن عام 2005 بنسبة 30% من رأس المال (أو من القيمة الاسمية) بواقع 15 ريال للسهم \r\n	2025-12-25 15:06:47.540905
6362	6010	توزيع أرباح نقدية	2006-05-06	\N	\N	\N	\N	SAR	أعلنت الشركة الوطنية للتنمية الزراعية عن توزيع ارباح عام بواقع 6 ريال للسهم الواحد	2025-12-25 15:06:47.541382
6363	4010	توزيع أرباح نقدية	2006-05-06	\N	\N	\N	\N	SAR	وافقت الجمعية العادية السابعة والثلاثون علي توزيع الأرباح عن عام 2005م بنسبة 8% من رأس المال بواقع بواقع 4 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 1 مايو 2006.	2025-12-25 15:06:47.541635
6364	2230	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-05-02	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 632400000 ريال من خلال توزيع أسهم منحة بواقع 1 سهم لكل  5 سهم\r\n	2025-12-25 15:06:47.541865
6365	2020	توزيع أرباح نقدية	2006-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية السابعة والثلاثين على توزيع 840 مليون ريال أرباحا بواقع 21 ريال للسهم والتى تمثل 42% من رأس المال المدفوع	2025-12-25 15:06:47.542288
6366	2080	توزيع أرباح نقدية	2006-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية للشركة على اقتراح مجلس الإدارة بتوزيع الأرباح الصافية عن عام 2005م بواقع تسعة ريالات ونصف للسهم الواحد (قبل تجزئة القيمة الاسمية للسهم الى 10 ريالات) اي ما يعادل 19? من رأس المال.	2025-12-25 15:06:47.542511
6367	2090	توزيع أرباح نقدية	2006-05-01	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 40% من رأس المال (أو من القيمة الاسمية) بواقع 20 ريال للسهم \r\n	2025-12-25 15:06:47.542734
6368	4947	توزيع أرباح نقدية	2006-05-01	\N	\N	\N	\N	SAR	أقرت الجمعية العمومية العادية لشركة حائل للتنمية الزراعية توزيع الأرباح لعام 2005 بواقع 2.5 ريال للسهم.	2025-12-25 15:06:47.542971
6369	2260	شراء نسبة من شركة	2006-04-30	\N	\N	\N	\N	SAR	قامت الشركة بشراء 32.55% من شركة التصنيع والصحراء للأوليفينات بدفع مبلغ 781.2 مليون ريال سعودى ويمثل رأس مال الشركة الشقيقة ككل 2.400.000.000 ريال سعودى	2025-12-25 15:06:47.543497
6370	3090	توزيع أرباح نقدية	2006-04-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 20% من رأس المال (أو من القيمة الاسمية) بواقع 10 ريال للسهم \r\n	2025-12-25 15:06:47.543738
6371	4090	توزيع أرباح نقدية	2006-04-29	\N	\N	\N	\N	SAR	اعلنت شركة طيبة للاستثمار والتنمية عن توزيع أرباح نقدية لعام 2005م 6 ريال سعودي لكل سهم .	2025-12-25 15:06:47.544075
6372	4020	توزيع أرباح نقدية	2006-04-26	\N	\N	\N	\N	SAR	أعلنت الشركة العقارية السعودية عن بدء صرف أرباح عام 2005م بواقع ( 4) ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم5 أبريل 2006	2025-12-25 15:06:47.544421
6373	7010	توزيع أرباح نقدية	2006-04-24	\N	\N	\N	\N	SAR	أعلنت شركـة الاتصالات السعوديـة توزيع أرباح الربع الرابع 2005 بواقع (10) ريالات عن كل سهم	2025-12-25 15:06:47.544759
6374	2290	تجزئة أسهم	2006-04-22	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة القيمة الأسمية لأسهم الشركة إلى 10 ريال للسهم بدلا من 50 ريال للسهم وعليه أصبح عدد الأسهم 562,500,000 بقيمة اسمية 10 ريال للسهم الواحد	2025-12-25 15:06:47.545073
6375	2150	تجزئة أسهم	2006-04-22	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تمت الموافقة على تجزئة القيمة الاسمية للسهم لتصبح 10 ريال سعودى بدلا من 50 ريال سعودى	2025-12-25 15:06:47.545392
6376	1080	تجزئة أسهم	2006-04-18	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تمت تجزئة القيمة الأسمية لأسهم الشركة لتصبح 10 ريال للسهم بدلا من 50 ريال للسهم وعليه أصبح عدد الأسهم 325 مليون سهم قيمة كل سهم 10 ريال	2025-12-25 15:06:47.545713
6377	6040	توزيع أرباح نقدية	2006-04-17	\N	\N	\N	\N	SAR	أعلنت شركة تبوك للتنمية الزراعية عن توزيع ارباح العام المالي 2005 بواقع 5 ريالات للسهم.	2025-12-25 15:06:47.546173
6378	2210	زيادة رأس مال - إصدار حقوق أولوية	2006-04-16	\N	\N	\N	\N	SAR	وافق مجلس هيئة السوق المالية على الطلب الذي تقدمت به الشركة (نماء) لزيادة رأس مالها من 650,000,000 ريالاً إلى 680,000,000 ريالاً بغرض اندماج شركة نماء وشركة جنا لامتلاك الحصص المتبقية فى الشركة وهى 49% من الملكية.	2025-12-25 15:06:47.546517
6379	2260	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال بتاريخ 27/3/2006 تم تجزئة القيمة الأسمية للسهم إلى عشرة ريالات للسهم بدلا من 50 ريال وبناء عليه زاد عدد أسهم الشركة ليصبح 150 مليون سهم بقيمة اسمية 10 ريال	2025-12-25 15:06:47.546858
6380	2110	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة القيمة الأسمية لأسهم الشركة إلى 10 ريال بدلا من 50 ريال وعليه تم تعديل عدد الاسهم من 12.800.000 سهم بقيمة اسمية 50 ريال إلى 64.000.000 سهم بقيمة اسمية 10 ريال.	2025-12-25 15:06:47.547252
6381	2060	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال الموافق 27/3/2006 تم تجزئة القيمة الأسمية للسهم لتصبح 10 ريال سعودى بدلا من 50 ريال سعودى	2025-12-25 15:06:47.547584
6382	2020	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة القيمة الاسمية للسهم من 50 ريال إلى 10 ريال وبالتالى أصبح عدد الأسهم 200 مليون سهم	2025-12-25 15:06:47.547838
6383	2040	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	طبقا لقرار هيئة سوق المال تم تجزئة القيمة الاسمية للسهم بواقع خمسة أسهم وبالتالى زاد عدد أسهم الشركة من 5 مليون سهم إلى 25 مليون سهم بقيمة اسمية 10 ريال سعودى للسهم	2025-12-25 15:06:47.548101
6384	2070	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	طبقا لقرار هيئة السوق المالية بتاريخ 27/3/2006 تم تجزئة أسهم الشركة بواقع خمسة أسهم لكل سهم وعلية زاد عدد اسهم الشركة من 12 مليون سهم بقيمة اسمية قدرها 50 ريال سعودى إلى 60 مليون سهم بقيمة اسمية قدرها 10 ريال سعودى للسهم	2025-12-25 15:06:47.548402
6385	2140	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تم تجزئة القيمة الاسمية للسهم إلى عشرة ريالات للسهم الواحد وبناء عليه أصبح عدد الاسهم خلال الربع الثانى 34.3 مليون سهم بقيمة اسمية عشرة ريالات للسهم الواحد	2025-12-25 15:06:47.548695
6386	2010	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية بتاريخ 27 مارس 2006 تم تجزئة القيمة الاسمية للسهم لتصبح 10 ريال سعودى بدلا من 50 ريال سعودى وبذلك يكون عدد الاسهم 2.5 بليون سهم	2025-12-25 15:06:47.548965
6387	2100	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة الاسهم بواقع خمسة أسهم لكل سهم وعليه أصبحت القيمة الأسمية للسهم 10 ريال بدلا من 50 ريال	2025-12-25 15:06:47.549249
6388	2120	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة القيمة الأسمية لأسهم الشركة من 50 ريال إلى 10 ريال أى بواقع خمسة أسهم لكل سهم.	2025-12-25 15:06:47.549504
6389	2130	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة القيمة الاسمية لأسهم الشركة من 50 ريال للسهم إلى 10 ريال للسهم وعليه زاد عدد الأسهم من 8 ملايين سهم بقيمة اسمية 50 ريال للسهم إلى 40 مليون سهم بقيمة اسمية 10 ريال للسهم	2025-12-25 15:06:47.549759
6390	2160	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	وفقاً لقرار هيئة السوق المالية تم تجزئة الاسهم بواقع خمسة أسهم لكل سهم وبناء على ذلك زادت أسهم الشركة من 23.1 مليون سهم عادى بقيمة 50 ريال للسهم إلى 115.5 مليون ريال بقيمة 10 ريال للسهم.	2025-12-25 15:06:47.550812
6391	2180	توزيع أرباح نقدية	2006-04-15	\N	\N	\N	\N	SAR	أعلنت الشركة عن توزيع أرباح نقدية بواقع 6 ريال للسهم	2025-12-25 15:06:47.551091
6392	2170	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	وفقا لقرار مجلس الوزراء بتاريخ 27 مارس 2006 تم تخفيض القيمة الاسمية الى عشرة ريالات عن طريق تجزئة السهم الواحد الى خمسة أسهم	2025-12-25 15:06:47.55136
6393	2050	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة اسهم الشركة على اساس خمسة أسهم لكل سهم قائم وذلك بتخفيض القيمة الاسمية لكل سهم من 50 ريال إلى 10 ريال وبالتالى زاد عدد اسهم الشركة المصدرة والمدفوعة بالكامل من 36 مايون سهم إلى 180 مليون سهم	2025-12-25 15:06:47.551619
6394	2200	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تم تجزئة اسهم الشركة والبالغ عددها 6.300.000 سهم بقيمة اسمية 50 ريال سعودى للسهم الواحد إلى 31.500.000 سهم بقيمة اسمية 10 ريال سعودى للسهم الواحد .	2025-12-25 15:06:47.55188
6395	2080	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة الاسهم بواقع خمسة أسهم لكل سهم وعليه أصبحت القيمة الأسمية للسهم 10 ريال للسهم بدلا من 50 ريال للسهم	2025-12-25 15:06:47.552132
6396	2230	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تم تجزئة القيمة الاسمية للسهم لتصبح 10 ريالات سعودية بدلا من 50 ريال سعودى للسهم	2025-12-25 15:06:47.55238
6397	6070	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تم تجزئة القيمة الأسمية لأسهم الشركة لتصبح 10 ريال إلى 50 ريال وعليه اصبحت الأسهم 20000000 سهم بقيمة اسمية 10 ريال للسهم بدلا من 4000000 سهم بقيمة اسمية 50 ريال	2025-12-25 15:06:47.552631
6398	2270	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال بتاريخ 27/3/2006 تم تجزئة أسهم الشركة بواقع خمسة أسهم لكل سهم وعليه زاد عدد الأسهم من 6.5 مليون سهم بقيمة اسمية 50 ريال إلى 32.5 مليون سهم بقيمة اسمية 10 ريال	2025-12-25 15:06:47.552886
6399	2280	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تعديل القيمة الأسمية للأسهم لتصبح 10 ريال بدلا من 50 ريال وعلية فقد تم زيادة عدد الأسهم من 20 مليون سهم قيمة كل سهم 50 ريال إلى 100 مليون سهم قيمة كل سهم 10 ريال	2025-12-25 15:06:47.553158
6400	3020	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت اليمامة السعودية المحدودة عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:47.553413
6402	6080	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على موافقة هيئة سوق المال تمت تجزئة القيمة الاسمية لأسهم الشركة لتصبح 10 ريال بدلا من 50 ريال وبذلك أصبح عدد الأسهم 50 مليون سهم بقيمة اسمية 10 ريال	2025-12-25 15:06:48.365057
6403	6090	تجزئة أسهم	2006-04-15	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تمت تجزئة القيمة الأسمية لأسهم الشركة لتصبح 10 ريال بدلا من 50 ريال وبالتالى أصبح عدد الأسهم بعد التجزئة 50 مليون سهم بقيمة اسمية 10 ريال للسهم	2025-12-25 15:06:48.365502
6404	3040	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت القصيم عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم .	2025-12-25 15:06:48.365792
6405	2030	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على تجزئة الأسهم بنسبة خمسة أسهم لكل سهم بحيث تصبح القيمة الاسمية للسهم 10 ريالات بدلا من 50 ريال	2025-12-25 15:06:48.366077
6406	2090	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة القيمة الاسمية لأسهم الشركة من 50 ريال للسهم إلى 10 ريال للسهم وعليه زاد عدد الأسهم من 4.7 ملايين سهم بقيمة اسمية 50 ريال للسهم إلى 23.7 مليون سهم بقيمة اسمية 10 ريال للسهم	2025-12-25 15:06:48.366366
6407	2220	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	بناء على موافقة هيئة السوق المالية تم تجزئة القيمة الاسمية للسهم لتصبح 10 ريال سعودى بدلا من 50 ريال سعودى وبذلك ارتفع عدد أسهم الشركة من 2.5 مليون سهم إلى 12.5 مليون سهم	2025-12-25 15:06:48.366665
6408	2250	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة أسهم الشركة إلى خمسة أسهم لكل سهم واحد لتصبح 10 ريالات سعودية بدلا من 50 ريالا سعوديا وبذلك زاد عدد الاسهم من 36 مليون سهم بقيمة 50 ريال للسهم إلى 180 مليون سهم بقيمة 10 ريال للسهم الواحد	2025-12-25 15:06:48.366958
6409	3010	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	أعلنت شركة الاسمنت العربية المحدودة عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم مملوكا .	2025-12-25 15:06:48.367286
6410	3030	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	أعلنت شركة الأسمنت السعودية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.36756
6411	2190	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تم تجزئة الأسهم بنسبة خمسة أسهم لكل سهم بحيث تصبح القيمة الاسمية للسهم 10 ريال سعودى بدلا من 50 ريال سعودى	2025-12-25 15:06:48.367846
6412	4010	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية للفنادق عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم لتصبح قيمة السهم 10 ريال بدلا من 50 ريال	2025-12-25 15:06:48.368117
6413	4020	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	أعلنت الشركة العقارية السعودية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.368388
6414	3060	تجزئة أسهم	2006-04-13	\N	\N	\N	\N	SAR	تجزئة الأسهم بواقع خمسة أسهم لكل سهم.	2025-12-25 15:06:48.368796
6415	4030	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-04-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 2250000000 ريال من خلال توزيع أسهم منحة بواقع سهم لكل  8 أسهم\r\n	2025-12-25 15:06:48.369234
6416	7010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-04-11	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية غير العادية على زيادة رأس المال من 15.000 مليون ريال الى 20.000 مليون ريال وذلك عن طريق منح سهم مجانى لكل ثلاثة اسهم قائمة	2025-12-25 15:06:48.369699
6417	3060	توزيع أرباح نقدية	2006-04-10	\N	\N	\N	\N	SAR	توزيع أرباح النصف الثانى لعام 2005 بواقع 15 ريال للسهم	2025-12-25 15:06:48.370963
6418	2040	توزيع أرباح نقدية	2006-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الثامنة والعشرون على توزيع أرباح نقدية بما يعادل 20% من رأس المال المدفوع بواقع 10 ريال للسهم الواحد	2025-12-25 15:06:48.371302
6419	1050	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تمت تجزئة القيمة الاسمية لأسهم الشركة إلى 10 ريال للسهم بدلا من 50 ريال للسهم وعليه اصبح عدد الأسهم 337.5 مليون سهم	2025-12-25 15:06:48.371556
6420	7020	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	بموجب قرار هيئة السوق المالية تم تجزئة السهم إلى خمسة أسهم لكل سهم بقيمة اسمية 10 ريال للسهم وبالتالى أصبح عدد الأسهم المصدرة 500 مليون سهم.	2025-12-25 15:06:48.371819
6421	1090	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تمت تجزئة الأسهم بنسبة خمسة أسهم لكل سهم وعليه أصبح عدد الأسهم 600 مليون سهم بقيمة اسمية 10 ريال للسهم بدلا من 120 مليون سهم بقيمة اسمية 50 ريال للسهم	2025-12-25 15:06:48.372074
6422	1030	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	تم تجزئة القيمة الاسمية للسهم لتصبح 10 ريال سعودى بدلا من 50 ريال سعودى وعليه زاد عدد الأسهم  34.4 مليون سهم إلى 240.6 مليون سهم	2025-12-25 15:06:48.372328
6423	1060	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تمت تجزئة أسهم الشركة لتصبح 10 ريال للسهم بدلا من 50 ريال للسهم وعليه زاد عدد الأسهم من 75 مليون سهم بقيمة اسمية 50 ريال إلى 375 مليون سهم بقيمة اسمية 10 ريال	2025-12-25 15:06:48.372739
6424	1120	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	طبقا لقرار هيئة السوق المالية بتاريخ 27/3/2006 تم تجزئة القيمة الاسمية للسهم بواقع خمسة أسهم لكل  سهم وعليه زاد عدد أسهم الشركة من 135 مليون سهم بقيمة اسمية 50 ريال إلى 675 مليون سهم بقيمة اسمية 10 ريال	2025-12-25 15:06:48.37314
6425	1140	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	طبقا لقرار هيئة السوق المالية تمت تجزئة القيمة الأسمية لأسهم الشركة الى 10 ريال للسهم بدلا من 50 ريال للسهم وعليه زاد عدد الأسهم من 60 مليون سهم بقيمة اسمية 50 ريال إلى 300 مليون سهم بقيمة اسمية 10 ريال	2025-12-25 15:06:48.373563
6427	1020	تجزئة أسهم	2006-04-08	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية بتاريخ 27 مارس 2006 تم تجزئة اسهم البنك على أساس خمسة أسهم لكل سهم وعليه اصبحت القيمة الأسمية للسهم 10ريال بدلا من 50 ريال للسهم الواحد	2025-12-25 15:06:48.37444
6428	4210	بيع جزء من الشركة	2006-04-08	\N	\N	\N	\N	SAR	أعلنت المجموعة السعودية للأبحاث والتسويق عن طرح24.000.000 سهم للأكتتاب تمثل 30% من رأس مال الشركة وسيتم الطرح بقيمة اسمية قدرها 46 ريالا للسهم .	2025-12-25 15:06:48.374943
6429	7010	تجزئة أسهم	2006-04-06	\N	\N	\N	\N	SAR	تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.375461
6430	3050	توزيع أرباح نقدية	2006-04-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 5 ريال للسهم \r\n	2025-12-25 15:06:48.37588
6431	4190	توزيع أرباح نقدية	2006-04-05	\N	\N	\N	\N	SAR	أعلنت شركة جرير للتسويق عن توزيع أرباح نقدية لعام 2005م 20 ريال سعودي لكل سهم .	2025-12-25 15:06:48.376292
6432	1040	توزيع أرباح نقدية	2006-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية  على توزيع أرباح نقدية  بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 7.5 ريال للسهم \r\n	2025-12-25 15:06:48.376685
6433	3020	توزيع أرباح نقدية	2006-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 60% من رأس المال (أو من القيمة الاسمية) بواقع 30 ريال للسهم \r\n	2025-12-25 15:06:48.377079
6434	4050	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية لخدمات السيارات والمعدات عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.377558
6435	4190	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة جرير للتسويق عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.37797
6436	6010	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	اعلنت الشركة الوطنية للتنمية الزراعية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.378353
6437	4080	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة عسير للتجارة والسياحة والصناعة عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم لتصبح القيمة الأسمية للسهم 10 ريال سعودى.	2025-12-25 15:06:48.378777
6438	4090	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	اعلنت شركة طيبة للاستثمار والتنمية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.379258
6439	4130	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة الباحة للإستثمار والتنمية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.379657
6440	4110	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	وفقاً لقرار هيئة السوق المالية تم تجزئة الأسهم بواقع خمسة أسهم لكل سهم وبالتالى زاد عدد الأسهم من 3600000 سهم بقيمة اسمية 50 ريال للسهم إلى 18 مليون سهم بقيمة اسمية 10 ريال للسهم.	2025-12-25 15:06:48.380046
6441	2180	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	طبقا لقرار هيئة السوق المالية بتاريخ 27 مارس 2006 تم تجزئة القيمة الاسمية للسهم بواقع خمسة أسهم لكل سهم وبالتالى زاد عدد الاسهم الى 6.875.000 سهم .	2025-12-25 15:06:48.380518
6442	4070	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة تهامة للإعلان والعلاقات العامة عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.380945
6443	4061	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت الشركة عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم إبتداء من1/4/2006 ليصبح عدد أسهم الشركة 120 مليون سهم بقيمة أسمية 10 ريالات لكل سهم	2025-12-25 15:06:48.381481
6444	4140	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية للصادرات الصناعية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.382924
6445	4150	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	اعلنت شركة الرياض للتعمير عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.383369
6446	4160	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.383783
6447	4170	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة المشروعات السياحية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.384191
6448	4180	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة أحمد حسن فتيحي وشركاه عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.384625
6449	5110	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية للكهرباء عن تجزئة القيمة الأسمية للسهم الشركة من50 ريال سعودى الى 10 ريالات للسهم	2025-12-25 15:06:48.385036
6450	4100	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة مكة للإنشاء والتعمير عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم.	2025-12-25 15:06:48.385459
6451	4947	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة حائل للتنمية الزراعية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم	2025-12-25 15:06:48.385862
6452	6040	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت شركة تبوك للتنمية الزراعية عن تجزئة الأسهم بنسبة خمسة أسهم لكل سهم	2025-12-25 15:06:48.386263
6453	6060	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية تم تجزئة القيمة الأسمية لأسهم الشركة لتصبح 10 ريال إلى 50 ريال وعليه اصبحت الأسهم 7.500.000 سهم بقيمة اسمية 10 ريال للسهم بدلا من 1.500.000 سهم بقيمة اسمية 50 ريال	2025-12-25 15:06:48.386674
6454	8010	تجزئة أسهم	2006-04-01	\N	\N	\N	\N	SAR	أعلنت الشركة عن تقسيم سهمها إلى خمسة أسهم وبذلك يرتفع عدد أسهم الشركة من 10 مليون سهم بقيمة إسمية قدرها 50 ريال للسهم إلى 50 مليون سهم بقيمة إسمية قدرها 10 ريال للسهم.	2025-12-25 15:06:48.38712
6455	4230	تأسيس شركة	2006-03-31	\N	\N	\N	\N	SAR	أعلنت شركة البحر الأحمر لخدمات الإسكان عن تأسيس شركة سارل البحر الأحمر لخدمات الإسكان الجزائر المحدودة ("شركة البحر الأحمر - الجزائر") وهي شركة مسجلة وتزاول أعمالها في الجزائر وتمتلك الشركة ما نسبته 98 %من رأسمالها.	2025-12-25 15:06:48.387591
6457	3030	توزيع أرباح نقدية	2006-03-29	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن النصف الثانى من عام 2005 بنسبة 18% من رأس المال (أو من القيمة الاسمية) بواقع 9 ريال للسهم \r\n	2025-12-25 15:06:48.388456
6458	3050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-03-29	\N	\N	\N	\N	SAR	توزيع أسهم منحة بواقع سهم لكل ثلاثة أسهم.	2025-12-25 15:06:48.388984
6459	1060	توزيع أرباح نقدية	2006-03-28	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 5 ريال للسهم \r\n	2025-12-25 15:06:48.389387
6460	3020	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-03-28	\N	\N	\N	\N	SAR	زيادة رأس مال الشركة من أربعمائة وخمسون (450 ) مليون ريال ( 9 ملايين سهم ) إلى ألف وثلاثمائة وخمسون (1350) مليون ريال ( 27 مليون سهم ) وذلك برسملة احتياطيات الشركة التي تزيد عن ألف (1000) مليون ريال . بمنح سهمين لكل سهم .	2025-12-25 15:06:48.389785
6461	1010	تجزئة أسهم	2006-03-27	\N	\N	\N	\N	SAR	بناء على قرار هيئة السوق المالية رقم 4-154-2006 تمت تجزئة القيمة الاسمية للسهم لتصبح 10 ريال سعودى بدلا من 50 ريال سعودى وبذلك اصبح عدد الاسهم المملوكة للبنك 625 مليون سهم بقيمة اسمية 10 ريال للسهم	2025-12-25 15:06:48.390193
6462	2210	تجزئة أسهم	2006-03-27	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تم تجزئة القيمة الاسمية إلى عشرة ريالات للسهم الواحد وبناء عليه اصبح عدد اسهم الشركة خلال الربع الثانى من عام 2006 65 مليون سهم بقيمة اسمية 10 ريال للسهم الواحد	2025-12-25 15:06:48.390626
6463	2240	تجزئة أسهم	2006-03-27	\N	\N	\N	\N	SAR	بناء على قرار هيئة سوق المال تمت تجزئة اسهم الشركة بواقع 5 أسهم لكل سهم وعليه زاد عدد الاسهم من 7 مليون سهم بقيمة 50 ريال سعودى إلى 35 مليون سهم بقيمة اسمية 10 ريال سعودى	2025-12-25 15:06:48.391023
6464	8010	توزيع أرباح نقدية	2006-03-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقديةبنسبة 60% من رأس المال (أو من القيمة الاسمية) بواقع 30 ريال للسهم \r\n	2025-12-25 15:06:48.391444
6465	3040	توزيع أرباح نقدية	2006-03-25	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت القصيم عن توزيع أرباح نقدية لعام 2005م، 23 ريال سعودي لكل سهم .	2025-12-25 15:06:48.391856
6466	1090	توزيع أرباح نقدية	2006-03-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح سنوية على المساهمين عن العام المالى 2005 بواقع 14 ريال للسهم الواحد	2025-12-25 15:06:48.392262
6467	4080	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-03-21	\N	\N	\N	\N	SAR	أعلنت شركة عسير للتجارة والسياحة والصناعة عن توزيع أسهم منحة بواقع ثلاثة أسهم لكل عشرة أسهم من خلال إصدار أسهم مجانية قدرها 3.750 مليون سهم ليصبح عدد أسهم الشركة 16.250 مليون سهم بدلا من12.5 مليون سهم بقيمةأسمية 50 ريال سعودى	2025-12-25 15:06:48.392716
6468	1080	توزيع أرباح نقدية	2006-03-20	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح عن النصف الثانى من عام 2005 بواقع 5 ريال للسهم الواحد	2025-12-25 15:06:48.393109
6469	3080	توزيع أرباح نقدية	2006-03-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 5 ريال للسهم \r\n	2025-12-25 15:06:48.39349
6470	1050	توزيع أرباح نقدية	2006-03-18	\N	\N	\N	\N	SAR	أعلن البنك عن صرف أرباح نقدية عن النصف الثانى من عام 2005 بمقدار 5 ريالات للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 5 مارس 2006.	2025-12-25 15:06:48.39389
6471	1120	توزيع أرباح نقدية	2006-03-18	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية على المساهمين بواقع 5 ريال للسهم الواحد	2025-12-25 15:06:48.394289
6472	1030	توزيع أرباح نقدية	2006-03-14	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بواقع 3 ريال للسهم الواحد وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 6 مارس 2008	2025-12-25 15:06:48.395522
6473	1080	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-03-13	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى زيادة رأس المال إلى 650000000 ريال من خلال توزيع أسهم منحة بنسبة 30% من رأس المال\r\n	2025-12-25 15:06:48.395898
6474	1010	توزيع أرباح نقدية	2006-03-06	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على توزيع أرباح نقدية على المساهمين عن النصف الثانى من عام 2005 بمبلغ 800 مليون ريال بواقع 8 ريال للسهم الواحد	2025-12-25 15:06:48.396315
6475	1050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-03-05	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى زيادة رأس المال إلى 675000000 ريال من خلال توزيع أسهم منحة بنسبة 50% من رأس المال\r\n	2025-12-25 15:06:48.396704
6476	3010	توزيع أرباح نقدية	2006-03-05	\N	\N	\N	\N	SAR	قررت الجمعية العمومية صرف ارباح للمساهمين عن النصف الثانى من عام 2005م، بواقع 12 ريال للسهم، وذلك للمساهمين المسجلين في سجلات الشركة بنهاية تداول يوم 19 فبراير 2006.	2025-12-25 15:06:48.397105
6477	1010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-02-27	\N	\N	\N	\N	SAR	وافقت  الجمعية العامة غـيـر الـعـاديـة على  زيـادة رأس مال البنك إلى مبلغ (6,250,000,000) ريال سعودي وذلك بمنح سهم مجاني لحامل كل أربعة أسهم ليصبح عدد الاسهم القائمة والمصدرة 125 مليون سهم بقيمة اسمية 50 ريال للسهم	2025-12-25 15:06:48.397509
6478	2240	شراء نسبة من شركة	2006-02-15	\N	\N	\N	\N	SAR	قامت الشركة بشراء 51% من الشركة السعودية للمواد العازلة من الفيبر غلاس المحدودة بقيمة استثمارية قدرها 65 مليون ريال سعودى	2025-12-25 15:06:48.397901
6479	2190	شراء نسبة من شركة	2006-02-07	\N	\N	\N	\N	SAR	قامت الشركة بشراء 2.67% من شركة الطيران منخفضة التكاليف بإسم شركة (سما) وتم تأسيس الشركة برأس مال قدره 187.500.000 ريال	2025-12-25 15:06:48.3983
6480	3010	تأسيس شركة	2006-01-31	\N	\N	\N	\N	SAR	تأسيس شركة فى المملكة الهاشمية الأردنية تتولى إنشاء مصنع لإنتاج الأسمنت البورتلاندى بمنطقة القطرانة	2025-12-25 15:06:48.398728
6481	4200	بيع جزء من الشركة	2006-01-21	\N	\N	\N	\N	SAR	أعلنت شركة الدريس للخدمات البترولية والنقليات عن طرح 1,2 مليون سهم تمثل 30% من رأس مال الشركة، وذلك خلال مدة أقصاها 30 يناير الجاري بسعر 185 ريالاً للسهم الواحد	2025-12-25 15:06:48.399771
6482	6080	تجزئة أسهم	2006-01-18	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية غير العادية على تجزئة الأسهم وعلية أصبح عدد الأسهم مليون سهم بقيمة أسمية خمسون ريالا للسهم الواحد	2025-12-25 15:06:48.400176
6483	2030	توزيع أرباح نقدية	2006-01-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 16% من رأس المال (أو من القيمة الاسمية) بواقع 8 ريال للسهم \r\n	2025-12-25 15:06:48.400604
6484	1020	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2006-01-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على زيادة رأس المال إلى 1125000000 ريال من خلال توزيع أسهم منحة بواقع سهم لكل  2 سهم\r\n	2025-12-25 15:06:48.401025
6485	2060	استحواذ على شركة	2006-01-01	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على قيام الشركة بشراء حصة الأقلية بشركة التصنيع الوطنية للبتروكيماويات(شركة تابعة) مقابل إصدار أسهم بنسبة 0.77 لكل سهم من أسهم الشركة التابعة	2025-12-25 15:06:48.401444
6486	4170	بيع شركة تابعة	2005-12-30	\N	\N	\N	\N	SAR	أعلنت المشروعات السياحية عن بيع مساهمتها فى رأس مال شركة الجزيرة للسياحة بالبحرين البالغة 19.65% بمبلغ 1 مليون دينار بحرينى	2025-12-25 15:06:48.401874
6487	4190	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2005-12-18	\N	\N	\N	\N	SAR	أعلنت شركة جرير للتسويق عن توزيع أسهم منحة للمساهمين بنسبة سهم لكل أربعة أسهم .	2025-12-25 15:06:48.402306
6488	2010	تأسيس شركة	2005-12-07	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شركة ينبع الوطنية للبتروكيماويات وهى شركة مساهمة سعودية برأسمال قدره 5625 مليون ريال سعودى وتمتلك الشركة 55.95 من رأس المال	2025-12-25 15:06:48.402732
6489	6090	زيادة رأس مال - إصدار حقوق أولوية	2005-11-20	\N	\N	\N	\N	SAR	تمت الموافقة على مضاعفة رأس المال من 250 مليون ريال إلى 500 مليون ريال وذلك عن طريق طرح 5 مليون سهم عادى بقيمة تبلغ 75 ريال للسهم منها 50 ريال قيمة اسمية للسهم زائدا عليها 25 ريال للسهم علاوة اصدار	2025-12-25 15:06:48.403142
6490	2050	زيادة رأس مال - إصدار حقوق أولوية	2005-11-16	\N	\N	\N	\N	SAR	قرر مساهمو الشركة خلال اجتماع الجمعية العمومية غير العادية زيادة رأس المال إلى 1.8 مليار ريال عن طريق اصدار 6 مليون سهم جديد بقيمة اسمية 50 ريال سعودى للسهم الواحد وبعلاوة اصدار بلغت 350 ريال سعودى للسهم الواحد	2025-12-25 15:06:48.403543
6491	7010	توزيع أرباح نقدية	2005-11-12	\N	\N	\N	\N	SAR	أعلنت شركـة الاتصالات السعوديـةعن توزيع أرباح اولية بواقع ( 7 ) ريالات عن كل سهم عن الربع الثالث من عام 2005	2025-12-25 15:06:48.403968
6492	4070	توزيع أرباح نقدية	2005-10-26	\N	\N	\N	\N	SAR	أعلنت شركة تهامة للإعلان والعلاقات العامة عن توزيع توزيع أرباح عام 2004 بواقع 3 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 26 سبتمبر 2005	2025-12-25 15:06:48.404325
6493	1120	توزيع أرباح نقدية	2005-10-23	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية على المساهمين بواقع 5 ريال للسهم الواحد	2025-12-25 15:06:48.404659
6494	3010	تغيير اسم الشركة	2005-10-18	\N	\N	\N	\N	SAR	وافقت الجمعية على تعديل إسم الشركة من "شركة الأسمنت العربية المحدودة" إلى " شركة الأسمنت العربية".	2025-12-25 15:06:48.40499
6495	4180	زيادة رأس مال - إصدار حقوق أولوية	2005-10-08	\N	\N	\N	\N	SAR	أعلنت شركة أحمد حسن فتيحي وشركاه عن زيادة رأسمالها من 220 مليون ريال إلى 385 مليون ريال،من خلال إصدار أسهم حقوق أولية عددها 3.3 مليون سهم بقيمة إجمالية 165 مليون ريال سعودى وقيمة أسمية 90 ريال سعودى .	2025-12-25 15:06:48.405322
6496	1040	توزيع أرباح نقدية	2005-08-13	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 15% من رأس المال (أو من القيمة الاسمية) بواقع 7.5 ريال للسهم \r\n	2025-12-25 15:06:48.405644
6497	7010	توزيع أرباح نقدية	2005-08-06	\N	\N	\N	\N	SAR	أعلنت شركـة الاتصالات السعوديـة توزيع أرباح عن النصف الاول من عام 2005 بواقع ( 14 ) ريالات عن كل سهم إبتداء من يوم 6 / 8 /2005	2025-12-25 15:06:48.405982
6498	4300	توزيع أرباح نقدية	2005-08-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 30% من رأس المال (أو من القيمة الاسمية) بواقع 15 ريال للسهم \r\n	2025-12-25 15:06:48.407023
6499	4080	توزيع أرباح نقدية	2005-08-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 8% من رأس المال (أو من القيمة الاسمية) بواقع 4 ريال للسهم \r\n	2025-12-25 15:06:48.407373
6500	3060	توزيع أرباح نقدية	2005-07-30	\N	\N	\N	\N	SAR	صرف أرباح النصف الأول لعام 2005 بواقع 5 ريال للسهم	2025-12-25 15:06:48.40772
6501	3010	توزيع أرباح نقدية	2005-07-23	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 16% من رأس المال (أو من القيمة الاسمية) بواقع 8 ريال للسهم \r\n\r\n	2025-12-25 15:06:49.200824
6502	2160	زيادة رأس مال - إصدار حقوق أولوية	2005-07-18	\N	\N	\N	\N	SAR	وافقت هيئة السوق المالية على زيادة رأس المال من&nbsp; 770 مليون ريال إلى 1.155 مليون ريال عن طريق الاكتتاب&nbsp; على ان يكون سعر السهم 55 ريال سعودى&nbsp;	2025-12-25 15:06:49.201385
6503	1120	توزيع أرباح نقدية	2005-07-17	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 10% من رأس المال (أو من القيمة الاسمية) بواقع 5 ريال للسهم \r\n	2025-12-25 15:06:49.201698
6504	1060	توزيع أرباح نقدية	2005-07-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 20% من رأس المال (أو من القيمة الاسمية) بواقع 10 ريال للسهم \r\n	2025-12-25 15:06:49.201979
6505	3030	توزيع أرباح نقدية	2005-07-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن النصف الأول من عام 2005 بنسبة 18% من رأس المال (أو من القيمة الاسمية) بواقع 9 ريال للسهم \r\n	2025-12-25 15:06:49.202358
6506	3050	توزيع أرباح نقدية	2005-07-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 24% من رأس المال (أو من القيمة الاسمية) بواقع 12 ريال للسهم \r\n	2025-12-25 15:06:49.202605
6507	1050	توزيع أرباح نقدية	2005-07-16	\N	\N	\N	\N	SAR	 وافقت الجمعية على توزيع أرباح عن النصف الأول من عام 2008 بواقع 8 ريالات للسهم الواحد وذلك للمساهمين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 30 يونيو 2006.	2025-12-25 15:06:49.202832
6508	4090	توزيع أرباح نقدية	2005-07-16	\N	\N	\N	\N	SAR	اعلنت شركة طيبة للاستثمار والتنمية عن توزيع أرباح عام 2004 بواقع 4 ريال للسهم	2025-12-25 15:06:49.203061
6509	2270	توزيع أرباح نقدية	2005-07-13	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 23% من رأس المال (أو من القيمة الاسمية) بواقع 11.5 ريال للسهم \r\n	2025-12-25 15:06:49.203317
6510	1010	توزيع أرباح نقدية	2005-07-10	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على توزيع أرباح نقدية على المساهمين عن النصف الاول من عام 2005 بمبلغ 800 مليون ريال بواقع 8 ريال للسهم الواحد	2025-12-25 15:06:49.203587
6511	1080	توزيع أرباح نقدية	2005-07-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح عن النصف الاول من عام 2005 بواقع 5 ريال للسهم الواحد	2025-12-25 15:06:49.203939
6512	2060	توزيع أرباح نقدية	2005-06-14	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 12% من رأس المال (أو من القيمة الاسمية) بواقع 6 ريال للسهم \r\n	2025-12-25 15:06:49.204227
6513	4110	توزيع أرباح نقدية	2005-05-30	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح عن عام 2004 بواقع 4 ريالات للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 2 مايو 2005 عن طريق التحويل للحساب.	2025-12-25 15:06:49.204558
6514	4050	توزيع أرباح نقدية	2005-05-21	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية لخدمات السيارات والمعدات( ساسكو) عن توزيع ارباح عام 2004 بواقع 3.5 ريال للسهم	2025-12-25 15:06:49.205014
6515	4020	توزيع أرباح نقدية	2005-05-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح بواقع 8 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 21 أبريل 2005	2025-12-25 15:06:49.205597
6516	4040	توزيع أرباح نقدية	2005-05-16	\N	\N	\N	\N	SAR	اعلنت شركة السعودية للنقل الجماعي في 30/3/2005 عن توزيع (2.50 ريال للسهم) في يوم 16/5/2005 وتستحق الي يوم 2/5/2005 عن طريق الاستلام الشخصي.	2025-12-25 15:06:49.212288
6517	5110	توزيع أرباح نقدية	2005-05-14	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية للكهرباء عن توزيع 3.5 ريال للسهم الواحد أرباح للعام المالي 2004م بدءا من يوم 14/5/2005م .	2025-12-25 15:06:49.213641
6518	4140	توزيع أرباح نقدية	2005-05-07	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح عام 2004 بواقع 5 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 5 ابريل 2005 وذلك عن طريق الإستلام الشخصى.	2025-12-25 15:06:49.214252
6519	3020	توزيع أرباح نقدية	2005-04-27	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت اليمامة السعودية المحدودة عن توزيع أرباح بواقع 30 ريال للسهم	2025-12-25 15:06:49.214887
6520	2250	توزيع أرباح نقدية	2005-04-26	\N	\N	\N	\N	SAR	تم الموافقة على توزيع أرباح نقدية بواقع 4 ريال للسهم الواحد بنسبة 8% من رأس مال الشركة	2025-12-25 15:06:49.215669
6521	2150	توزيع أرباح نقدية	2005-04-23	\N	\N	\N	\N	SAR	اعلنت شركة الصناعات الزجاجية الوطنية في 27/12/2004 عن توزيع ارباح (5 ريال للسهم)	2025-12-25 15:06:49.216436
6522	2020	توزيع أرباح نقدية	2005-04-23	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غيرالعادية السادسة والثلاثين على توزيع 560 مليون ريال أرباح بواقع 14 ريال للسهم والتى تمثل 28% من رأس المال المدفوع	2025-12-25 15:06:49.21722
6523	4030	شراء نسبة من شركة	2005-04-18	\N	\N	\N	\N	SAR	أعلنت شركة الوطنية السعودية للنقل البحري شراء 30.3% من رأس مال شركة بترديك المحدودة مقابل 50 مليون دولار أمريكى	2025-12-25 15:06:49.218128
6524	4180	توزيع أرباح نقدية	2005-04-17	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح لعام 2004 بواقع 2.5 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تدول يوم 2 ابريل 2005 وذلك عن طريق التحويل للحساب.	2025-12-25 15:06:49.219225
6525	2010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2005-04-16	\N	\N	\N	\N	SAR	تم الموافقة على زيادة رأس المال عن طريق منح أسهم مجانية بواقع سهم مجانى مقابل كل ثلاثة أسهم مملوكة	2025-12-25 15:06:49.220518
6526	2020	توزيع أرباح نقدية	2005-04-13	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غيرالعادية السادسة والثلاثين على توزيع 560 مليون ريال أرباح بواقع 14 ريال للسهم والتى تمثل 28% من رأس المال المدفوع	2025-12-25 15:06:49.221225
6527	2070	توزيع أرباح نقدية	2005-04-13	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح نقدية بواقع 5 ريالات للسهم الواحد بنسبة 10% من القيمة الاسمية للسهم.	2025-12-25 15:06:49.222
6528	2240	توزيع أرباح نقدية	2005-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية فى اجتماعها السنوى على توزيع ارباح نقدية عن عام 2004 بواقع 42 مليون ريال سعودى تمثل 12% من رأس المال أى بواقع 6 ريال للسهم الواحد	2025-12-25 15:06:49.222996
6529	4010	توزيع أرباح نقدية	2005-04-04	\N	\N	\N	\N	SAR	وافقت الجمعية العادية علي توزيع الأرباح عام 2004 بواقع ثلاثة ريالات للسهم الواحد، وبنسبة 6 في المائة من رأس المال, بواقع 3 ريال للسهم.	2025-12-25 15:06:49.223424
6530	4230	تأسيس شركة	2005-03-31	\N	\N	\N	\N	SAR	أعلنت شركة البحر الأحمر لخدمات الإسكان عن تأسيس شركة البحر الأحمر لخدمات الإسكان (غانا) المحدودة ("شركة البحر الأحمر - غانا") وهي شركة مسجلة وتزاول أعمالها في أكرا - غانا وتمتلك الشركة ما نسبته 100% من رأس مالها	2025-12-25 15:06:49.224228
6531	1040	توزيع أرباح نقدية	2005-03-30	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 17% من رأس المال (أو من القيمة الاسمية) بواقع 8.5 ريال للسهم \r\n	2025-12-25 15:06:49.224877
6532	3050	توزيع أرباح نقدية	2005-03-29	\N	\N	\N	\N	SAR	توزيع أرباح عام 2004 بواقع 25 يال للسهم	2025-12-25 15:06:49.225552
6533	2040	توزيع أرباح نقدية	2005-03-28	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية السابعة والعشرين على اقتراح توزيع ربح على المساهمين يعادل 20% من رأس المال المدفوع بواقع عشرة ريالات للسهم الواحد	2025-12-25 15:06:49.226241
6534	6040	توزيع أرباح نقدية	2005-03-28	\N	\N	\N	\N	SAR	أعلنت شركة تبوك للتنمية الزراعية عن توزيع أرباح عام 2004 بواقع 3 ريال للسهم	2025-12-25 15:06:49.226959
6535	4030	توزيع أرباح نقدية	2005-03-28	\N	\N	\N	\N	SAR	اعلنت الشركة الوطنية السعودية للنقل البحري في 28/3/2005 عن توزيع ارباح (5.00 ريال للسهم) في يوم 25/5/2005 وتستحق الي يوم 2/5/2005 عن طريق الاستلام الشخصي.	2025-12-25 15:06:49.227783
6536	3030	توزيع أرباح نقدية	2005-03-27	\N	\N	\N	\N	SAR	أعلنت شركة الأسمنت السعودية عن توزيع أرباح لعام 2004 بواقع 18 ريال للسهم	2025-12-25 15:06:49.228503
6537	1020	توزيع أرباح نقدية	2005-03-26	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 6% من رأس المال (أو من القيمة الاسمية) بواقع 3 ريال للسهم \r\n	2025-12-25 15:06:49.229108
6538	1080	توزيع أرباح نقدية	2005-03-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن النصف الثانى من عام 2004 بواقع 4 ريال للسهم الواحد	2025-12-25 15:06:49.230011
6539	1090	توزيع أرباح نقدية	2005-03-23	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع ارباح نقدية على المساهمين عن النصف الثانى لعام 2004م بواقع عشر ريالات و نصف للسهم الواحد ليبلغ اجمالى ما تم توزيعه عن كامل السنة واحد وعشرين ريالا للسهم الواحد	2025-12-25 15:06:49.230888
6540	1060	توزيع أرباح نقدية	2005-03-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 20% من رأس المال (أو من القيمة الاسمية) بواقع  10 ريال للسهم \r\n	2025-12-25 15:06:49.231306
6541	7010	توزيع أرباح نقدية	2005-03-19	\N	\N	\N	\N	SAR	اعلنت شركة الاتصالات السعودية توزيع ارباح عن النصف الثانى من عام 2004 بواقع (14 ريال للسهم) .	2025-12-25 15:06:49.232105
6542	3060	توزيع أرباح نقدية	2005-03-19	\N	\N	\N	\N	SAR	صرف أرباح بواقع 20 ريالاً للسهم الواحد .	2025-12-25 15:06:49.233032
6543	1050	توزيع أرباح نقدية	2005-03-16	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية  على توزيع أرباح نقدية  بنسبة 24% من رأس المال (أو من القيمة الاسمية) بواقع 12 ريال للسهم \r\n	2025-12-25 15:06:49.23384
6544	1030	توزيع أرباح نقدية	2005-03-15	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 6% من رأس المال (أو من القيمة الاسمية) بواقع 3 ريال للسهم \r\n	2025-12-25 15:06:49.2342
6545	2180	توزيع أرباح نقدية	2005-03-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية بنسبة 12% من رأس المال (أو من القيمة الاسمية) بواقع 6 ريال للسهم \r\n	2025-12-25 15:06:49.234621
6546	1120	توزيع أرباح نقدية	2005-03-12	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية على المساهمين بواقع 35 ريال للسهم الواحد	2025-12-25 15:06:49.235135
6547	4190	توزيع أرباح نقدية	2005-02-27	\N	\N	\N	\N	SAR	اعلنت شركة جرير للتسويق في 7/2/2005 عن توزيع ارباح (22.00 ريال للسهم) في يوم 23/3/2005 وتستحق الي يوم 16/3/2005 عن طريق التحويل للحساب.	2025-12-25 15:06:49.235763
6548	3040	توزيع أرباح نقدية	2005-02-24	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت القصيم عن توزيع أرباح بواقع 22 ريالاً للسهم	2025-12-25 15:06:49.236609
6549	6010	توزيع أرباح نقدية	2005-02-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية للشركة الوطنية للتنمية الزراعية (نادك) على اقتراح مجلس الإدارة بتوزيع أرباح المساهمين بنسبة 10% من القيمة الاسمية للسهم بواقع (5 ريال للسهم الواحد) .	2025-12-25 15:06:49.237266
6550	1010	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2005-02-21	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية غير العادية على توصية مجلس الادارة بزيادة رأس مال البنك من أربعة آلاف مليون ريال الى خمسة آلاف مليون ريال، وذلك بمنح سهم مجاني مقابل كل أربعة أسهم يملكها كل مساهم.	2025-12-25 15:06:49.238229
6551	3010	توزيع أرباح نقدية	2005-01-12	\N	\N	\N	\N	SAR	أعلنت شركة الاسمنت العربية المحدودة عن توزيع أرباح نقدية لعام 2004 قدرها16 ريال سعودي للسهم	2025-12-25 15:06:49.238518
6552	3060	تأسيس شركة	2005-01-04	\N	\N	\N	\N	SAR	تم تأسيس شركة ينبع للمنتجات الورقية برأس مال وقدره 12,5 مليون ريال وذلك بموجب اتفاق يمتلك فيه الشريك السعودي شركة اسمنت ينبع حصة 60? من الشركة الجديدة فيما تكون حصة الشريك الكويتي شركة الشعيبة للمنتجات الورقية 40?.	2025-12-25 15:06:49.239517
6553	8010	بيع جزء من الشركة	2005-01-03	\N	\N	\N	\N	SAR	أعلنت الشركة التعاونية للتأمين عن طرح 7 مليون سهم من أسهم الشركة للأكتتاب والتى تمثل 70% من رأس المال المصدر للشركة	2025-12-25 15:06:49.240911
6554	2190	تأسيس شركة	2005-01-01	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شركة تشغيل الخدمات المساندة " إسناد" برأسمال قدره 10 مليون ريال، وتمتلك فيه سيسكو نسبة 97%	2025-12-25 15:06:49.241609
6555	2190	تأسيس شركة	2004-12-31	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس الشركة السعودية لتنمية التجارة والصادرات (تصدير) برأسمال قدره 45 مليون ريال، وتمتلك شركة سيسكو فيها 76%.	2025-12-25 15:06:49.242272
6556	2190	تأسيس شركة	2004-12-31	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس شركة كنداسة لخدمات المياه برأسمال قدره 54.1 مليون ريال (تمتلك فيه شركة سيسكو 60%).	2025-12-25 15:06:49.243178
6557	2190	تأسيس شركة	2004-12-31	\N	\N	\N	\N	SAR	قامت الشركة بتأسيس الشركة الدولية لتوزيع المياه " توزيع "برأسمال قدره 10 مليون ريال تمتلك فيه سيسكو نسبة 50 %.	2025-12-25 15:06:49.243886
6558	4100	توزيع أرباح نقدية	2004-12-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح بواقع 6 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 12 ديسمبر 2004.	2025-12-25 15:06:49.244651
6559	4080	تغيير السنة المالية	2004-12-05	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية الغير العادية لشركة عسير للتجارة والسياحة والصناعة على تغيير السنة المالية للشركة لتبدأ إعتبارا من الاول من شهر يناير وتنتهى فى 31 ديسمبر من كل عام	2025-12-25 15:06:49.24551
6560	3080	تأسيس شركة	2004-12-01	\N	\N	\N	\N	SAR	وكان مجلس إدارة الشركة قد وافق على المشاركة فى تأسيس الشركة العربية اليمنية للأسمنت المحدودة بنسبة 30 % من رأس المال	2025-12-25 15:06:49.246463
6561	2200	زيادة رأس مال - إصدار حقوق أولوية	2004-10-30	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأس المال من 210 مليون ريال سعودى إلى 315 مليون ريال وذلك بطرح 2.3 مليون سهم للاكتتاب لمساهميها ليصبح عدد أسهمها 6.3 مليون سهم	2025-12-25 15:06:49.250101
6562	1020	زيادة رأس مال - إصدار حقوق أولوية	2004-10-13	\N	\N	\N	\N	SAR	قام البنك بزيادة رأس المال وذلك بإصدار 3 ملايين سهم جديد بقيمة اسمية 50 ريال للسهم الواحد اضافة الى علاوة اصدار بمبلغ 80 ريال لكل سهم ليصبح عدد أسهمه 15 مليون سهم	2025-12-25 15:06:49.250806
6563	2210	زيادة رأس مال - إصدار حقوق أولوية	2004-09-26	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأس المال من 250 مليون الى 650 مليون ريال وذلك بإصدار( 8 ) مليون سهم بقيمة أسمية (50) خمسون ريال مع علاوة اصدار (10) عشرة ريال للسهم.	2025-12-25 15:06:49.251395
6564	4070	توزيع أرباح نقدية	2004-09-13	\N	\N	\N	\N	SAR	أعلنت شركة تهامة للإعلان والعلاقات العامة عن توزيع أرباح نقدية لعام 2003 قدرها 3.00 ريال سعودي للسهم .	2025-12-25 15:06:49.252014
6565	7010	توزيع أرباح نقدية	2004-08-07	\N	\N	\N	\N	SAR	أعلنت شركـة الاتصالات السعوديـة عن توزيع أرباح النصف الاول من العام المالي 2004م بواقع ( 12 ) ريالات عن كل سهم وسيتم صرف الأرباح اعتباراً من 7 / 8 /2004م	2025-12-25 15:06:49.252652
6566	1090	توزيع أرباح نقدية	2004-07-17	\N	\N	\N	\N	SAR	تمت الموافقة على توزيع ارباح نقدية على المساهمين عن النصف الاول لعام 2004م بواقع عشر ريالات و نصف للسهم الواحد	2025-12-25 15:06:49.254137
6567	4160	زيادة رأس مال - إصدار حقوق أولوية	2004-07-17	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأسمالها من 13.4 مليون ريال إلى 100 مليون ريال وذلك بطرح أسهم للاكتتاب لمساهميها ليصبح بذلك عدد أسهمها 2 مليون سهم	2025-12-25 15:06:49.255623
6568	1080	توزيع أرباح نقدية	2004-06-30	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على توزيع ارباح نصف سنوية عن النصف الاول من العام 2004 بواقع 5 ريال للسهم الواحد	2025-12-25 15:06:49.257037
6569	2110	زيادة رأس مال - إصدار حقوق أولوية	2004-06-29	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأس المال من 500 مليون ريال إلى 640 مليون ريال من خلال طرح 2.8 مليون سهم بسعر 50 ريال سعودى للسهم ليصبح عدد أسهمها 12.8 مليون سهم	2025-12-25 15:06:49.257983
6570	2060	توزيع أرباح نقدية	2004-06-06	\N	\N	\N	\N	SAR	وافقت الجمعية العامة للمساهمين على اقتراح مجلس الادارة توزيع أرباح نقدية على المساهمين بمبلغ 78.500 ألف ريال تمثل 10% من رأس المال بواقع 5 ريال للسهم الواحد	2025-12-25 15:06:49.258585
6571	2060	زيادة رأس مال - إصدار حقوق أولوية	2004-06-06	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأس المال من 785 مليون ريال إلى 981 مليون ريال عن طريق إصدار 3.925 مليون سهم للاكتتاب لمساهميها ليصبح عدد أسهمها 19.625 مليون سهم	2025-12-25 15:06:49.25928
6572	2170	زيادة رأس مال - إصدار حقوق أولوية	2004-06-01	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأس المال من 173 مليون ريال إلى 519 مليون ريال وذلك بإصدار 6.92 مليون سهم للاكتتاب ليصبح عدد الأسهم 10.38 مليون سهم	2025-12-25 15:06:49.259664
6573	1020	توزيع أرباح نقدية	2004-05-29	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 5.1% من رأس المال (أو من القيمة الاسمية) بواقع 2.55 ريال للسهم \r\n	2025-12-25 15:06:49.260173
6574	2220	زيادة رأس مال - إصدار حقوق أولوية	2004-05-29	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأسمالها من 100 مليون ريال إلى 125 مليون ريال وذلك بإصدار 500 ألف سهم جديد بقيمة اسمية قدرها 50 ريال سعودى للسهم الواحد	2025-12-25 15:06:49.260885
6575	4080	شراء نسبة من شركة	2004-05-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة الغير عادية لشركة عسير للتجارة والسياحة والصناعة على شراء 95% من أسهم شركة دلة للاستثمار الصناعى وذلك مقابل إصدار 6.235.274 سهم جديد بقيمة 455.175 مليون ريال سعودى ومبلغ نقدى قدره 77.681 مليون ريال سعودى	2025-12-25 15:06:49.261643
6576	4110	توزيع أرباح نقدية	2004-05-26	\N	\N	\N	\N	SAR	قررت الجمعية العمومية توزيع أرباح عن عام 2003 بواقع 7 ريالات للسهم وذلك عن طريق الاستلام الشخصي.	2025-12-25 15:06:49.262222
6577	4140	توزيع أرباح نقدية	2004-05-25	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية لعام 2003 قدرها 2.50 ريال سعودي للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 25 أبريل 2004 .	2025-12-25 15:06:49.262817
6578	5110	توزيع أرباح نقدية	2004-05-24	\N	\N	\N	\N	SAR	تبدأ الشركة السعودية للكهرباء اليوم الاثنين 5/4/1425هـ الموافق 24/5/2004م بصرف الأرباح للعام المالي 2003م بواقع 3.5 ريال للسهم الواحد	2025-12-25 15:06:49.263745
6579	2160	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2004-05-20	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأسمالها عن طريق توزيع أسهم منحة للمساهمين بواقع سهم واحد لكل 10 أسهم	2025-12-25 15:06:49.264433
6580	2230	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2004-05-20	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأس المال إلى 527 مليون ريال سعودى بتحويل مبلغ 62 مليون ريال سعودى من الأرباح المستبقاة وذلك بإصدار 1.240.000 سهم مجانى بواقع سهمين مجانيين لكل خمسة عشر سهما قائما	2025-12-25 15:06:49.264857
6581	2050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2004-05-20	\N	\N	\N	\N	SAR	قرر المساهمون فى الشركة فى الجمعية العمومية غير العادية زيادة رأس المال من 800 مليون ريال إلى مليار ريال عن طريق منح سهم واحد لكل أربعة أسهم قائمة وعليه زاد عدد الأسهم إلى 20 مليون سهم وتمت الزيادة عن طريق تحويل مبلغ 200 مليون ريال سعودى من حساب علاوة اصدار رأس المال	2025-12-25 15:06:49.265153
6582	4020	توزيع أرباح نقدية	2004-05-10	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح بواقع 8 ريال للسهم وذلك لمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 10 أبريل 2004.	2025-12-25 15:06:49.265404
6583	4180	توزيع أرباح نقدية	2004-04-22	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية لعام 2003 قدرها 2.50 ريال سعودي للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 21 أبريل 2004 .	2025-12-25 15:06:49.265664
6584	4180	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2004-04-22	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأسمالها عن طريق توزيع أسهم منحة للمساهمين بواقع سهم لكل عشرة أسهم ليصبح عدد أسهم الشركة 4.4 مليون سهم	2025-12-25 15:06:49.265959
6585	2240	توزيع أرباح نقدية	2004-04-10	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بنسبة 6% من رأس المال بواقع 3 ريال للسهم الواحد	2025-12-25 15:06:49.266246
6586	4050	توزيع أرباح نقدية	2004-04-06	\N	\N	\N	\N	SAR	أعلنت الشركة السعودية لخدمات السيارات والمعدات( ساسكو) عن توزيع ارباح 2.5 ريال لكل سهم عن العام المالى 2003	2025-12-25 15:06:49.26654
6587	2070	توزيع أرباح نقدية	2004-04-03	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية  بنسبة 8% من رأس المال (أو من القيمة الاسمية) بواقع 4 ريال للسهم \r\n	2025-12-25 15:06:49.266778
6588	6040	توزيع أرباح نقدية	2004-03-31	\N	\N	\N	\N	SAR	أعلنت شركة تبوك للتنمية الزراعية عن توزيع أرباح عام 2003 بواقع 2.5 ريال للسهم	2025-12-25 15:06:49.267011
6589	4040	توزيع أرباح نقدية	2004-03-31	\N	\N	\N	\N	SAR	اعلنت شركة السعودية للنقل الجماعي في 31/3/2004 عن توزيع (2.50 ريال للسهم ) في يوم 29/5/2004 وتستحق الي يوم 9/5/2004 عن طريق الاستلام الشخصي.	2025-12-25 15:06:49.267225
6590	4010	توزيع أرباح نقدية	2004-03-29	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن عام 2003 بواقع 2.75 ريال للسهم الواحد	2025-12-25 15:06:49.267511
6591	4090	توزيع أرباح نقدية	2004-03-27	\N	\N	\N	\N	SAR	أعلنت شركة طيبة للاستثمار والتنمية العقارية عن توزيع أرباح عام 2003 بواقع 3.50 ريال للسهم	2025-12-25 15:06:49.26776
6592	3020	توزيع أرباح نقدية	2004-03-25	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت اليمامة السعودية المحدودة عن توزيع أرباح بواقع 30 ريالا للسهم	2025-12-25 15:06:49.267993
6593	2040	توزيع أرباح نقدية	2004-03-22	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية السادسة والعشرون على توزيع أرباح نقدية بما يعادل 12% من رأس المال المدفوع بواقع 6 ريال للسهم الواحد	2025-12-25 15:06:49.268246
6594	3060	توزيع أرباح نقدية	2004-03-21	\N	\N	\N	\N	SAR	صرف أرباح بواقع 17.5ريالا للسهم وبنسبة 35% من رأس المال.	2025-12-25 15:06:49.268547
6595	1090	توزيع أرباح نقدية	2004-03-18	\N	\N	\N	\N	SAR	قرر مجلس الادارة توزيع أرباح نقدية عن النصف الثانى من عام 2003 بواقع 6.25 ريال للسهم	2025-12-25 15:06:49.268778
6596	1060	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2004-03-16	\N	\N	\N	\N	SAR	قام البنك بزيادة رأس المال من 40 مليون سهم إلى 50 مليون سهم بقيمة اسمية 50 ريال وذلك بإصدار أسهم مجانية بواقع سهم واحد لكل أربعة أسهم مملوكة	2025-12-25 15:06:49.269003
6597	1060	توزيع أرباح نقدية	2004-03-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية عن النصف الثاني من عام 2003بقيمة 11 ريال للسهم الواحد.	2025-12-25 15:06:49.269348
6598	2150	توزيع أرباح نقدية	2004-03-03	\N	\N	\N	\N	SAR	اعلنت شركة الصناعات الزجاجية الوطنية في 3/3/2004 عن توزيع ارباح (2.50 ريال للسهم) وتستحق الي يوم 18/4/2004	2025-12-25 15:06:49.269772
6599	3050	توزيع أرباح نقدية	2004-03-03	\N	\N	\N	\N	SAR	توزيع أرباح نقدية قدرها 20.50 ريال سعودي للسهم .	2025-12-25 15:06:49.270128
6600	1080	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2004-03-01	\N	\N	\N	\N	SAR	قام البنك بزيادة رأس المال من 1800 مليون ريال إلى 2000 مليون ريال عن طريق منح المساهمين الحاليين أسهم مجانية قدرها 4 ملايين سهم القيمة الأسمية لكل سهم 50 ريال بواقع سهم واحد لكل تسعة أسهم من الأسهم المملوكة وذلك برسملة مبلغ 200 مليون ريال سعودى من الأحتياطى العام.	2025-12-25 15:06:49.270436
6601	1080	توزيع أرباح نقدية	2004-02-29	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح سنوية عن العام 2003 بواقع 11 ريال للسهم الواحد	2025-12-25 15:06:50.073823
6602	3040	توزيع أرباح نقدية	2004-02-25	\N	\N	\N	\N	SAR	 أعلنت شركة أسمنت القصيم عن توزيع أرباح نقدية لعام 2003 قدرها 21.50 ريال سعودي للسهم .	2025-12-25 15:06:50.074768
6603	6010	توزيع أرباح نقدية	2004-02-22	\N	\N	\N	\N	SAR	اعلنت الشركة الوطنية للتنمية الزراعية في 22/2/2004 عن توزيع ارباح (3 ريال للسهم) وتستحق الي يوم 28/3/2004 عن طريق الاستلام الشخصي.	2025-12-25 15:06:50.075333
6604	4100	تجزئة أسهم	2004-02-21	\N	\N	\N	\N	SAR	قامت الشركة بتجزئة القيمة الاسمية للسهم من (100) ريال إلى (50) ريال وبذلك سيتضاعف عدد أسهم الشركة ليصبح 28,963,248 سهم بدلا من 14,481,624 سهم.	2025-12-25 15:06:50.077025
6605	2180	توزيع أرباح نقدية	2004-02-17	\N	\N	\N	\N	SAR	وافقت الجمعية العموميةعلى توزيع أرباح نقدية بنسبة 12% من رأس المال (أو من القيمة الاسمية) بواقع 6 ريال للسهم \r\n	2025-12-25 15:06:50.077521
6606	1030	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2004-02-12	\N	\N	\N	\N	SAR	قام البنك بزيادة رأس المال من 1100 مليون ريال الى 1375 مليون ريال وذلك بمنح سهم واحد لكل أربعة أسهم وبالتالى تمت زيادة عدد الأسهم من 22 مليون سهم إلى 27.5 مليون سهم	2025-12-25 15:06:50.078009
6607	3030	توزيع أرباح نقدية	2004-01-31	\N	\N	\N	\N	SAR	أعلنت شركة الأسمنت السعودية عن توزيع أرباح لعام 2003 بواقع 17 ريال للسهم	2025-12-25 15:06:50.078492
6608	2200	زيادة رأس مال - إصدار حقوق أولوية	2004-01-25	\N	\N	\N	\N	SAR	بناء على قرار الجمعية العامة غير العادية الثالثة تقرر زيادة رأس المال من 140 مليون ريال سعودى إلى 210 مليون ريال سعودى وذلك بإصدار 1.4 مليون سهم للاكتتاب لمساهميها	2025-12-25 15:06:50.078933
6609	3010	توزيع أرباح نقدية	2004-01-21	\N	\N	\N	\N	SAR	أعلنت شركة الاسمنت العربية المحدودة عن توزيع أرباح نقدية لعام 2003 قدرها 13.50 ريال سعودي للسهم	2025-12-25 15:06:50.07941
6610	4190	توزيع أرباح نقدية	2004-01-20	\N	\N	\N	\N	SAR	أعلنت شركة جرير للتسويق عن توزيع أرباح نقدية لعام 2003 قدرها 20 ريال سعودي للسهم .	2025-12-25 15:06:50.079912
6611	2200	زيادة رأس مال - إصدار حقوق أولوية	2003-12-31	\N	\N	\N	\N	SAR	بناء على قرار مجلس الادارة تم زيادة رأس المال بمبلغ 21.235.520 ريال سعودى ليصبح رأس المال المدفوع فى 31/12/2003 يساوى رأس المال المصرح به للشركة وهو 140.000.000 ريال	2025-12-25 15:06:50.080227
6612	4100	توزيع أرباح نقدية	2003-12-24	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح بواقع 12ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 22 ديسمبر 2003	2025-12-25 15:06:50.080555
6613	5110	زيادة رأس مال - إصدار حقوق أولوية	2003-11-11	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأسمالها من 38287770900 مليون ريال إلى 41665938150 مليون ريال وعليه زادت عدد أسهم الشركة إلى 833.318.763 سهم	2025-12-25 15:06:50.080973
6614	2060	توزيع أرباح نقدية	2003-07-20	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية على المساهمين بمبلغ 36 مليون ريال وهى تمثل 6% من رأس المال بواقع 3 ريال للسهم الواحد	2025-12-25 15:06:50.081381
6615	2060	زيادة رأس مال - إصدار حقوق أولوية	2003-07-20	\N	\N	\N	\N	SAR	وافقت الجمعية العامة غير العادية على زيادة رأس المال من 600 مليون ريال إلى 785 مليون ريال مقسم إلى 15.7 مليون سهم قيمة كل منها 50 ريال سعودى مقابل اصدار 3.7 مليون سهم اضافى	2025-12-25 15:06:50.081817
6616	7010	توزيع أرباح نقدية	2003-07-17	\N	\N	\N	\N	SAR	أعلنت شركة الاتصالات السعودية عن توزيع أرباح سنوية لعام 2003بواقع 22 ريال لكل سهم	2025-12-25 15:06:50.082246
6617	1090	توزيع أرباح نقدية	2003-07-15	\N	\N	\N	\N	SAR	قرر مجلس الادارة توزيع أرباح نصف سنوية عن النصف الاول من عام 2003 بواقع 9.75 ريال للسهم الواحد	2025-12-25 15:06:50.082678
6618	2050	زيادة رأس مال - إصدار حقوق أولوية	2003-07-06	\N	\N	\N	\N	SAR	قرر المساهمون خلال الجمعية العمومية غير العادية زيادة رأس المال إلى 800 مليون ريال سعودى عن طريق منح ثلاثة أسهم لكل أحد عشر سهما قائما وزاد عدد الأسهم الصادرة إلى 16 مليون سهم تمت عن طريق تحويل مبلغ 171.4 مليون ريال سعودى من حساب علاوة اصدار رأس المال	2025-12-25 15:06:50.083109
6619	6060	توزيع أرباح نقدية	2003-06-14	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية التاسعة عشر على توزيع أرباح نقدية على المساهمين بواقع 2.5 ريال لكل سهم وذلك لمساهمين المسجلين فى سجلا الشركة حتى نهاية يوم تداول 21 مايو 2003	2025-12-25 15:06:50.083575
6620	2160	توزيع أرباح نقدية	2003-06-04	\N	\N	\N	\N	SAR	أعلنت الشركة عن توزيع ارباح نقدية بواقع 3.5 ريال سعودى للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 3 يونيو 2003	2025-12-25 15:06:50.084056
6621	2160	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2003-06-04	\N	\N	\N	\N	SAR	قامت الشركة بزياده رأس المال من 560 مليون ريال الى 700 مليون ريال من خلال توزيع توزيع سهم مجانى لكل 13 سهم	2025-12-25 15:06:50.0845
6622	4140	توزيع أرباح نقدية	2003-05-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح عام 2002 بواقع 4.5 ريال للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية تداول يوم 23 أبريل 2003.	2025-12-25 15:06:50.084923
6623	5110	توزيع أرباح نقدية	2003-05-19	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح سنوية عن العام المالى 2002 بواقع 3.5 ريال للسهم الواحد	2025-12-25 15:06:50.085364
6624	4090	تخفيض رأس مال - بتخفيض عدد الأسهم	2003-05-17	\N	\N	\N	\N	SAR	قامت الشركة بتخفيض رأسمالها من مليار ريال الى 750 مليون ريال وذلك من خلال إلغاء 5 ملايين سهم من الاسهم المصدرة البالغة 20 مليون سهم ليصبح عدد الاسهم 15 مليون سهم بقيمة أسمية 50 ريال سعودى	2025-12-25 15:06:50.085796
6625	4110	تخفيض رأس مال - بتخفيض عدد الأسهم	2003-05-10	\N	\N	\N	\N	SAR	قامت الشركة بتخفيض رأس مالها من 300 مليون إلى 180 مليون ريال ليصبح عدد الاسهم 3.6 مليون سهم بقيمة أسمية 50 ريال سعودى	2025-12-25 15:06:50.086258
6626	4020	توزيع أرباح نقدية	2003-05-08	\N	\N	\N	\N	SAR	أعلنت الشركة العقارية السعودية عن صرف الأرباح عن العام 2002م اعتبارا من يوم السبت 1424/3/9هـ الموافق 2003/5/10م بواقع 6ريالات للسهم الواحد وذلك بناء على موافقة الجمعية العامة العادية الخامسة والعشرين التي عقدت بتاريخ 1424/2/12هـ الموافق 2003/4/14م .	2025-12-25 15:06:50.0867
6627	2230	توزيع أرباح نقدية	2003-04-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الخامسة على توزيع أرباح نقدية بواقع 4 ريال للسهم الواحد للمساهمين المسجلين بسجلات الشركة بتاريخ 21/4/2003	2025-12-25 15:06:50.087273
6628	4010	توزيع أرباح نقدية	2003-04-20	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية عن عام 2002 بواقع 2.50 ريال للسهم الواحد	2025-12-25 15:06:50.08769
6629	3020	توزيع أرباح نقدية	2003-04-19	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت اليمامة السعودية المحدودة عن توزيع أرباح بواقع 30 ريالا للسهم الواحد	2025-12-25 15:06:50.088227
6630	4180	توزيع أرباح نقدية	2003-04-15	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية على توزيع أرباح نقدية لعام 2002 قدرها 2.50 ريال سعودي للسهم وذلك للمساهمين المسجلين فى سجلات الشركة حتى نهاية يوم تداول 13 أبريل 2003 .	2025-12-25 15:06:50.088693
6631	2020	توزيع أرباح نقدية	2003-04-09	\N	\N	\N	\N	SAR	وافقت الجمعية العامة العادية الرابعة والثلاثين على توزيع 160 مليون ريال أرباحا بواقع 4 ريال للسهم الواحد والتى تمثل 8% من رأس المال المدفوع	2025-12-25 15:06:50.089726
6632	3040	توزيع أرباح نقدية	2003-04-08	\N	\N	\N	\N	SAR	أعلنت شركة أسمنت القصيم عن توزيع الأرباح لعام 2002م، بواقع 21.5 ريالا للسهم .	2025-12-25 15:06:50.090221
6633	2070	توزيع أرباح نقدية	2003-04-05	\N	\N	\N	\N	SAR	قررت الجمعية العمومية العادية توزيع أرباح نقدية بواقع 7 ريالات للسهم الواحد بنسبة 14% من القيمة الاسمية للسهم.	2025-12-25 15:06:50.090722
6634	4040	توزيع أرباح نقدية	2003-03-31	\N	\N	\N	\N	SAR	اعلنت شركة السعودية للنقل الجماعي في 31/3/2003 عن توزيع (2.50 ريال للسهم) وتستحق الي يوم 10/5/2003 عن طريق البريد.	2025-12-25 15:06:50.091298
6635	2240	توزيع أرباح نقدية	2003-03-26	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح نقدية بنسبة 12% من رأس المال بواقع 6 ريال للسهم الواحد	2025-12-25 15:06:50.091824
6636	1060	توزيع أرباح نقدية	2003-03-12	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية لعى توزيع أرباح عن النصف الثاني من 2002 بمقدار 8 ريالات للسهم الواحد.	2025-12-25 15:06:50.092264
6637	3010	توزيع أرباح نقدية	2003-03-10	\N	\N	\N	\N	SAR	أعلنت شركة الاسمنت العربية المحدودة عن توزيع أرباح نقدية لعام 2002قدرها 12.50 ريال سعودي للسهم .	2025-12-25 15:06:50.092699
6638	2050	توزيع أرباح نقدية	2003-03-09	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية على توزيع ارباح على المساهمين بمبلغ 150.8 مليون ريال سعودى بواقع 12 ريال سعودى للسهم الواحد	2025-12-25 15:06:50.09318
6639	2090	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2003-03-08	\N	\N	\N	\N	SAR	قامت الشركة بزيادة رأس المال من 200.000.000 ريال إلى 237.500.000 ريال وذلك بإصدار 750.000 سهم قيمة كل منها 50 ريال وتوزع على المساهمين بواقع سهم ونصف لكل ثمانية أسهم.	2025-12-25 15:06:50.093614
6640	3050	توزيع أرباح نقدية	2003-03-06	\N	\N	\N	\N	SAR	توزيع أرباح نقدية لعام 2002 قدرها 20ريال سعودي للسهم .	2025-12-25 15:06:50.094053
6641	1050	توزيع أرباح نقدية	2003-03-05	\N	\N	\N	\N	SAR	وافقت الجمعية على توزيع أرباح نقدية عن عام 2002 بواقع 10 ريال لكل سهم وذلك للمسهامين المقيدين فى سجلات الشركة حتى نهاية تداول يوم 22 مارس 2003	2025-12-25 15:06:50.0945
6642	3060	توزيع أرباح نقدية	2003-03-05	\N	\N	\N	\N	SAR	توزيع أرباح على المساهمين بواقع 10 ريال للسهم الواحد عن عام 2002م	2025-12-25 15:06:50.095001
6643	2180	توزيع أرباح نقدية	2003-03-02	\N	\N	\N	\N	SAR	أعلنت الشركة عن توزيع أرباح نقدية بواقع 6 ريال للسهم	2025-12-25 15:06:50.095453
6644	3030	توزيع أرباح نقدية	2003-03-01	\N	\N	\N	\N	SAR	أعلنت شركة الأسمنت السعودية عن توزيع أرباح بواقع 12 ريال للسهم الواحد وإعادة الرصيد المتبقي من تخفيض رأس المال بواقع 5 ريال عن كل سهم قائم.	2025-12-25 15:06:50.095911
6645	1080	توزيع أرباح نقدية	2003-02-27	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع ارباح سنوية عن عام 2002 بواقع 12 ريال للسهم	2025-12-25 15:06:50.096372
6646	1020	توزيع أرباح نقدية	2003-02-27	\N	\N	\N	\N	SAR	وافقت الجمعية العامة على توزيع أرباح سنوية عن عام 2002 بواقع 2.5 ريال للسهم	2025-12-25 15:06:50.096818
6647	1050	زيادة رأس مال - توزيع أرباح من خلال أسهم منحة	2003-02-22	\N	\N	\N	\N	SAR	قامت البنك بزيادة رأس المال من 1.800 مليار ريال إلى 2.250 مليار ريال عن طريق منح المساهمين الحاليين أسهم مجانية قدرها 9 مليون سهم القيمة الأسمية لكل سهم 50 ريال سعودى بواقع سهم واحد لكل أربعة أسهم من الأسهم المملوكة وذلك برسملة الإحتياطى العام.	2025-12-25 15:06:50.097248
6648	2240	شراء نسبة من شركة	2002-09-14	\N	\N	\N	\N	SAR	قامت الشركة بشراء 15% حصة إضافية من شركة جيوكلايما الإيطالية للتكييف وبذلك يصبح مجموع ما تمتلكه الزامل للصناعة 85%	2025-12-25 15:06:50.09768
6649	1090	توزيع أرباح نقدية	2002-07-20	\N	\N	\N	\N	SAR	وافقت الجمعية العمومية العادية على توزيع أرباح نقدية على المساهمين بواقع 9 ريال للسهم الواحد	2025-12-25 15:06:50.09813
6650	4130	تأسيس شركة	2000-12-31	\N	\N	\N	\N	SAR	أعلنت شركة الباحة للإستثمار والتنمية عن تأسيس شركة مصنع الباحة للجلد الصناعي ( تم التشغيل عام 2000م )	2025-12-25 15:06:50.098517
6651	4130	تأسيس شركة	2000-12-31	\N	\N	\N	\N	SAR	أعلنت شركة الباحة للإستثمار والتنمية عن تأسيس شركة تليفريك أثرب السياحي ( تم التشغيل عام 2000م )	2025-12-25 15:06:50.09889
6652	4180	استحواذ على شركة	1996-01-01	\N	\N	\N	\N	SAR	أعلنت شركة أحمد حسن فتيحي عن شرائها شركة المجوهرات العالمية (مارينا بى) بنسبة تبلغ 100% من رأس مال الشركة بمبلغ 9.4 مليون ريال سعودى	2025-12-25 15:06:50.099217
6653	4130	تأسيس شركة	1994-12-01	\N	\N	\N	\N	SAR	أعلنت شركة الباحة للإستثمار والتنمية عن تأسيس شركة الباحة للرخام والجرانيت حيث تساهم الشركة بنسبة 95% من رأس المال .	2025-12-25 15:06:50.099653
\.


--
-- Name: corporate_actions_id_seq; Type: SEQUENCE SET; Schema: public; Owner: home
--

SELECT pg_catalog.setval('public.corporate_actions_id_seq', 6653, true);


--
-- PostgreSQL database dump complete
--

\unrestrict W0mY9adRYBKAOj53a10Nt8YNM1KCsjq3U5rn4gaIPnmKPl5NxXT4WgeD2XByH6W

