--
-- PostgreSQL database dump
--

\restrict gKTstQ6gr2lOyd28GPww4KlyNhyJbdD6UQ4Xngah51CBndRWv8ehQE9fYc6vyA6

-- Dumped from database version 14.20 (Homebrew)
-- Dumped by pg_dump version 14.20 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: mutual_funds; Type: TABLE DATA; Schema: public; Owner: home
--

COPY public.mutual_funds (fund_id, fund_name, manager_name, inception_date, currency, latest_nav, aum, ytd_return, one_year_return, three_year_return, last_updated, five_year_return, sharpe_ratio, standard_deviation, expense_ratio) FROM stdin;
2013	صندوق الأهلي المتنوع بالريال السعودي	شركة الأهلي المالية	\N	SAR	1.5834	\N	3.1200	\N	\N	2025-12-25 10:02:57.788942+02	\N	-2.9438	0.4295	\N
2014	صندوق الأھلي المتنوع بالدولار الأمريكي	شركة الأهلي المالية	\N	SAR	1.5619	\N	4.0100	\N	\N	2025-12-25 10:02:57.788943+02	\N	-3.5082	0.3805	\N
2022	صندوق الأهلي للمتاجرة العالمية	شركة الأهلي المالية	\N	SAR	3.2091	\N	4.5200	\N	\N	2025-12-25 10:02:57.788944+02	\N	-4.1895	0.3641	\N
2049	صندوق الرياض للمتاجرة بالريال	الرياض المالية	\N	SAR	2525.6050	\N	2.6300	\N	\N	2025-12-25 10:02:57.788946+02	\N	-3.1439	0.3827	\N
2050	صندوق الرياض للمتاجرة بالدولار	الرياض المالية	\N	SAR	6.8289	\N	3.1400	\N	\N	2025-12-25 10:02:57.788947+02	\N	-4.0870	0.3638	\N
5639	صندوق الجزيرة للمرابحة بالدولار الأمريكي	الجزيرة للأسواق المالية	\N	SAR	119.4992	\N	3.1500	\N	\N	2025-12-25 10:02:57.788955+02	\N	-5.5382	0.1782	\N
6151	صندوق الراجحي للبتروكيماويات	الراجحي المالية	\N	SAR	8.2069	\N	-13.1300	\N	\N	2025-12-25 10:02:57.788956+02	\N	-1.4471	13.5373	\N
2054	صندوق الرياض للإعمار	الرياض المالية	\N	SAR	23.3350	\N	-10.9900	\N	\N	2025-12-25 10:02:57.788954+02	\N	0.3587	62392130.9925	\N
2051	صندوق الرياض للأسهم السعودية	الرياض المالية	\N	SAR	36.4384	\N	-4.4800	\N	\N	2025-12-25 10:02:57.788948+02	\N	\N	\N	\N
2052	صندوق الرياض للأسهم السعودية المتوافقة مع الشريعة	الرياض المالية	\N	SAR	17.0099	\N	-6.5200	\N	\N	2025-12-25 10:02:57.788951+02	\N	\N	\N	\N
2053	صندوق الرياض للأسهم القيادية	الرياض المالية	\N	SAR	105.5774	\N	-2.1000	\N	\N	2025-12-25 10:02:57.788953+02	\N	\N	\N	\N
2057	صندوق الرياض للأسهم العالمية المتوافقة مع الشريعة	الرياض المالية	\N	SAR	44.6669	\N	10.5200	\N	\N	2025-12-25 10:02:57.788957+02	\N	0.4582	27.8572	\N
2059	صندوق الرياض المتحفظ	الرياض المالية	\N	SAR	18.7015	\N	5.8000	\N	\N	2025-12-25 10:02:57.788958+02	\N	0.8299	2.9433	\N
2063	صندوق الرياض للمتاجرة المتنوع بالريال	الرياض المالية	\N	SAR	1867.4711	\N	1.6900	\N	\N	2025-12-25 10:02:57.78896+02	\N	-3.3821	0.3994	\N
2064	صندوق الرياض للمتاجرة المتنوع بالدولار	الرياض المالية	\N	SAR	30.4438	\N	1.8400	\N	\N	2025-12-25 10:02:57.788961+02	\N	-4.2717	0.3720	\N
2065	صندوق الرياض المتوازن	الرياض المالية	\N	SAR	29.4937	\N	8.3500	\N	\N	2025-12-25 10:02:57.788962+02	\N	0.6254	12.3658	\N
2066	صندوق الرياض المتوازن المتوافق مع الشريعة	الرياض المالية	\N	SAR	33.2810	\N	7.9800	\N	\N	2025-12-25 10:02:57.788963+02	\N	0.7549	11.8215	\N
6163	صندوق الرياض للسيولة بالريال	الرياض المالية	\N	SAR	10.6195	\N	0.0000	\N	\N	2025-12-25 10:02:57.788964+02	\N	6.4551	0.2452	\N
6164	صندوق إحسان الوقفي	شركة الأهلي المالية	\N	SAR	1.0532	\N	5.7700	\N	\N	2025-12-25 10:02:57.788966+02	\N	0.2582	4.7944	\N
6165	صندوق جدوى للأسهم السعودية الثانيٍ أ	جدوى للإستثمار	\N	SAR	96.1144	\N	-4.7400	\N	\N	2025-12-25 10:02:57.788969+02	\N	-0.6669	10.8727	\N
2070	صندوق الرياض الجريء	الرياض المالية	\N	SAR	40.4671	\N	11.4800	\N	\N	2025-12-25 10:02:57.788971+02	\N	0.6060	21.7286	\N
6166	صندوق جدوى للأسهم السعودية الثانيٍ ج	جدوى للإستثمار	\N	SAR	96.4041	\N	-4.4900	\N	\N	2025-12-25 10:02:57.788972+02	\N	-0.6400	10.8744	\N
2071	صندوق الرياض الجريء المتوافق مع الشريعة	الرياض المالية	\N	SAR	48.3116	\N	9.8000	\N	\N	2025-12-25 10:02:57.788972+02	\N	0.6739	20.2186	\N
6420	صندوق صدارة للسيولة	صدارة كابيتال	\N	SAR	9.9031	\N	0.0000	\N	\N	2025-12-25 10:02:57.788968+02	\N	\N	\N	\N
4119	صندوق الجزيرة الخليجي للدخل	الجزيرة للأسواق المالية	\N	SAR	241.0266	\N	-4.5700	\N	\N	2025-12-25 10:02:57.788973+02	\N	0.6925	24.8286	\N
6421	صندوق صدارة المرن للأسهم السعودية	صدارة كابيتال	\N	SAR	9.9189	\N	0.0000	\N	\N	2025-12-25 10:02:57.78897+02	\N	\N	\N	\N
4375	صندوق الخير كابيتال للأسهم السعودية	الخير كابيتال السعودية	\N	SAR	17.2758	\N	-9.4200	\N	\N	2025-12-25 10:02:57.788974+02	\N	0.4254	25.7129	\N
6167	صندوق جدوى للأسهم السعودية الثانيٍ ب	جدوى للإستثمار	\N	SAR	95.3193	\N	-5.4800	\N	\N	2025-12-25 10:02:57.788975+02	\N	-0.7407	10.8980	\N
2072	صندوق الرياض الشجاع	الرياض المالية	\N	SAR	34.0155	\N	9.8200	\N	\N	2025-12-25 10:02:57.788977+02	\N	0.5972	16.9167	\N
5913	صندوق أشمور للأسهم السعودية المتوافق مع المعايير الشرعية - الفئة أ	أشمور للإستثمار السعودية	\N	SAR	8.8801	\N	-11.5400	\N	\N	2025-12-25 10:02:57.78898+02	\N	-1.8179	17.3562	\N
2077	صنـدوق الأهلي العطاء للأسهم السعوديـة	شركة الأهلي المالية	\N	SAR	18.9478	\N	-16.2900	\N	\N	2025-12-25 10:02:57.788982+02	\N	0.3494	23.5734	\N
5919	صندوق رصانة المرن للأسهم السعودية	رصانة المالية	\N	SAR	8.9845	\N	-20.5900	\N	\N	2025-12-25 10:02:57.788988+02	\N	-0.4834	21.8779	\N
6423	صندوق الإنماء لأسهم سوق نمو	الإنماء المالية	\N	SAR	0.9855	\N	0.0000	\N	\N	2025-12-25 10:02:57.788976+02	\N	\N	\N	\N
2081	صندوق الأهلي للأسهم العالمية	شركة الأهلي المالية	\N	SAR	35.8818	\N	20.3000	\N	\N	2025-12-25 10:02:57.788989+02	\N	0.7297	23.0180	\N
2073	صندوق الرياض للشركات المتوسطة والصغيرة	الرياض المالية	\N	SAR	48.9802	\N	-13.0800	\N	\N	2025-12-25 10:02:57.788979+02	\N	0.3587	42068155.5776	\N
2083	صنـدوق الأهلي الرزين بالريال	شركة الأهلي المالية	\N	SAR	34.0833	\N	1.8400	\N	\N	2025-12-25 10:02:57.78899+02	\N	-3.1183	0.3967	\N
1928	صندوق أصول و بخيت للإصدارات الأولية	شركة أصول وبخيت الاستثمارية	\N	SAR	2.8463	\N	-22.6900	\N	\N	2025-12-25 10:02:57.789084+02	\N	0.2366	22.1537	\N
6425	صندوق ميفك كابيتال للمرابحة فئة ب	الشرق الأوسط للاستثمار المالي	\N	SAR	100.2217	\N	0.0000	\N	\N	2025-12-25 10:02:57.788981+02	\N	\N	\N	\N
5686	صندوق كامكو للأسهم السعودية فئة ب	شركة كامكو للاستثمار	\N	SAR	497.7258	\N	-0.3700	\N	\N	2025-12-25 10:02:57.788938+02	\N	1.0302	22.4762	\N
5917	صندوق ارتال للمرابحات - فئة أ	أرتال المالية	\N	SAR	11.7386	\N	5.4800	\N	\N	2025-12-25 10:02:57.788983+02	\N	\N	\N	\N
5918	صندوق ارتال للمرابحات - فئة ب	أرتال المالية	\N	SAR	11.7711	\N	5.6000	\N	\N	2025-12-25 10:02:57.788984+02	\N	\N	\N	\N
6430	صندوق التداول المعزز بالخوارزميات للأسهم السعودية - فئة أ	السعودي الفرنسي كابيتال	\N	SAR	10.2115	\N	0.0000	\N	\N	2025-12-25 10:02:57.788987+02	\N	\N	\N	\N
1944	صندوق كامكو للأسهم السعودية فئة أ	شركة كامكو للاستثمار	\N	SAR	464.8814	\N	-1.4800	\N	\N	2025-12-25 10:02:57.78894+02	\N	0.8316	26.8787	\N
6183	صندوق الراجحي الوقفي	الراجحي المالية	\N	SAR	0.9987	\N	-1.2000	\N	\N	2025-12-25 10:02:57.788993+02	\N	-0.5891	6.6429	\N
5673	صندوق الأهلي للصكوك السيادية -فئة ب	شركة الأهلي المالية	\N	SAR	10.4925	\N	4.8400	\N	\N	2025-12-25 10:02:57.788994+02	\N	-0.3585	8.0574	\N
2090	صندوق الأهلي للأسهم الصينية	شركة الأهلي المالية	\N	SAR	24.4788	\N	29.6500	\N	\N	2025-12-25 10:02:57.788995+02	\N	0.4191	45.2874	\N
5675	صندوق إتقان كابيتال للأسهم السعودية	إتقان كابيتال	\N	SAR	13.4121	\N	-22.6600	\N	\N	2025-12-25 10:02:57.788999+02	\N	0.4282	19.6185	\N
6186	صندوق أشمور الخليجي المتنوع للمتاجرة - الفئة ب	أشمور لإدارة الأصول المحدودة	\N	SAR	12.9790	\N	4.9100	\N	\N	2025-12-25 10:02:57.788997+02	\N	0.6870	151852128.5729	\N
5676	صندوق بيت المال الخليجي المرن للأسهم السعودية المتوافق مع الضوابط الشرعية	بيت المال الخليجي	\N	SAR	13.5738	\N	-8.5700	\N	\N	2025-12-25 10:02:57.789+02	\N	0.4598	26.2805	\N
6189	صندوق يقين للفرص	شركة يقين المالية	\N	SAR	8.7236	\N	-14.3200	\N	\N	2025-12-25 10:02:57.789001+02	\N	-1.8932	21.8482	\N
2096	صندوق الأهلي لقطاعي الصحة والتعليم	شركة الأهلي المالية	\N	SAR	174.3659	\N	-15.0100	\N	\N	2025-12-25 10:02:57.789003+02	\N	0.1843	44.2162	\N
6192	صندوق كامكو للمرابحة بالريال السعودي	شركة كامكو للاستثمار	\N	SAR	10.4273	\N	0.0000	\N	\N	2025-12-25 10:02:57.789004+02	\N	3.5333	0.2066	\N
2099	صندوق الأهلي لأسهم الشركات الكبيرة والمتوسطة السعودية	شركة الأهلي المالية	\N	SAR	75.4405	\N	-7.1600	\N	\N	2025-12-25 10:02:57.789006+02	\N	0.4388	34.7081	\N
5942	صندوق الأهلي للقطاع المالي الخليجي	شركة الأهلي المالية	\N	SAR	10.5919	\N	0.1700	\N	\N	2025-12-25 10:02:57.789008+02	\N	-0.0791	12.3580	\N
6190	صندوق الرياض للتوزيعات الشهرية متعدد الأصول	الرياض المالية	\N	SAR	9.3702	\N	-6.3000	\N	\N	2025-12-25 10:02:57.789002+02	\N	\N	\N	\N
6194	صندوق أرتال للأسهم السعودية المرن - فئة أ	أرتال المالية	\N	SAR	8.6124	\N	0.0000	\N	\N	2025-12-25 10:02:57.789005+02	\N	1.0928	6333837.0332	\N
5692	صندوق جدوى لأسواق الأسهم العربية - الفئة د	جدوى للإستثمار	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789009+02	\N	0.0000	0.0000	\N
5693	صندوق جدوى للأسهم الخليجية - الفئة د	جدوى للإستثمار	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.78901+02	\N	0.0000	0.0000	\N
5694	صندوق جدوى للأسهم السعودية - الفئة د	جدوى للإستثمار	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789012+02	\N	0.0000	0.0000	\N
6195	صندوق أرتال للأسهم السعودية المرن - فئة ب	أرتال المالية	\N	SAR	8.7731	\N	0.0000	\N	\N	2025-12-25 10:02:57.789007+02	\N	\N	\N	\N
5695	صندوق جدوى للصكوك العالمية - الفئة د	جدوى للإستثمار	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789013+02	\N	0.0000	0.0000	\N
1854	صندوق الأول للدخل الدوري	شركة الأول كابيتال	\N	SAR	9.3401	\N	-8.6600	\N	\N	2025-12-25 10:02:57.789011+02	\N	0.3313	26087919.0032	\N
6207	صندوق جدوى للأسهم السعودية الثاني د	جدوى للإستثمار	\N	SAR	91.4552	\N	0.0000	\N	\N	2025-12-25 10:02:57.789014+02	\N	-1.2673	12.2484	\N
1856	صندوق مرابحات الأول بالريال السعودي	شركة الأول كابيتال	\N	SAR	13.7616	\N	3.1800	\N	\N	2025-12-25 10:02:57.789015+02	\N	-0.4734	6.8472	\N
3907	الأول للاستثمار لأسهم الشركات الخليجية للدخل	الأول للاستثمار	\N	SAR	23.4906	\N	6.3400	\N	\N	2025-12-25 10:02:57.789022+02	\N	0.7543	27.2851	\N
5699	صندوق جدوى للمرابحة بالريال السعودي - الفئة أ	جدوى للإستثمار	\N	SAR	121.7602	\N	5.0500	\N	\N	2025-12-25 10:02:57.789023+02	\N	-1.3163	0.2270	\N
6208	صندوق ارتال لأسهم الأسواق العربية - فئة أ	أرتال المالية	\N	SAR	9.1144	\N	0.0000	\N	\N	2025-12-25 10:02:57.789016+02	\N	1.1253	4731799.7371	\N
1857	صندوق الأول للأسهم السعودية	شركة الأول كابيتال	\N	SAR	42.6649	\N	-12.9700	\N	\N	2025-12-25 10:02:57.789017+02	\N	0.2667	10231886.9115	\N
6209	صندوق ارتال لأسهم الأسواق العربية - فئة ب	أرتال المالية	\N	SAR	9.2341	\N	0.0000	\N	\N	2025-12-25 10:02:57.789018+02	\N	1.1253	373103048.2079	\N
5444	صندوق الخير كابيتال للطروحات الأولية	الخير كابيتال السعودية	\N	SAR	12.6639	\N	-17.2800	\N	\N	2025-12-25 10:02:57.789024+02	\N	0.1836	19.1638	\N
5701	صندوق مشاركة للمرابحات والصكوك	شركة مشاركة المالية ش.م.م	\N	SAR	11.9432	\N	4.4700	\N	\N	2025-12-25 10:02:57.789025+02	\N	-1.0429	0.5707	\N
5191	صندوق مشاركة للأسهم السعودية	شركة مشاركة المالية ش.م.م	\N	SAR	16.4449	\N	-16.7200	\N	\N	2025-12-25 10:02:57.789028+02	\N	0.2526	21.4009	\N
6216	صندوق الإنماء الاستثماري الوقفي	الإنماء المالية	\N	SAR	0.9513	\N	0.0000	\N	\N	2025-12-25 10:02:57.789031+02	\N	-1.6028	11.9864	\N
1865	صندوق الاستثمار كابيتال لأسهم الشرق الأوسط وشمال افريقيا	الإستثمار للأوراق المالية و الوساطة	\N	SAR	2253.7803	\N	2.6100	\N	\N	2025-12-25 10:02:57.789033+02	\N	0.3772	9024.1372	\N
5450	صندوق الفرص السعودية	عوده كابيتال - السعودية	\N	SAR	16.5653	\N	-9.4200	\N	\N	2025-12-25 10:02:57.789034+02	\N	0.1533	14.5311	\N
1862	صندوق البلاد للمرابحة بالريال السعودي	البلاد للإستثمار	\N	SAR	1.5948	\N	5.1500	\N	\N	2025-12-25 10:02:57.789026+02	\N	\N	\N	\N
5707	صندوق يقين للذهب	شركة يقين المالية	\N	SAR	2.3485	\N	62.3600	\N	\N	2025-12-25 10:02:57.789035+02	\N	1.6623	22.9623	\N
1868	صندوق الاستثمار كابيتال للأسهم السعودية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	571.6530	\N	-6.0900	\N	\N	2025-12-25 10:02:57.789036+02	\N	0.4588	26.3141	\N
5452	صندوق الإنماء للإصدارات الأولية	الإنماء المالية	\N	SAR	16.5631	\N	-22.5400	\N	\N	2025-12-25 10:02:57.789036+02	\N	0.4470	24.5155	\N
1869	صندوق الاستثمار كابيتال للشركات السعودية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	337.3344	\N	-8.7800	\N	\N	2025-12-25 10:02:57.789037+02	\N	0.3129	26.6313	\N
6222	صندوق الأهلي لقطاع البتروكيماويات الخليجي	شركة الأهلي المالية	\N	SAR	9.8611	\N	0.0000	\N	\N	2025-12-25 10:02:57.789038+02	\N	-0.5758	9.7327	\N
2999	صنـدوق الأهلي الرزين بالدولار	شركة الأهلي المالية	\N	SAR	31.3721	\N	1.4900	\N	\N	2025-12-25 10:02:57.789127+02	\N	-3.0179	0.5441	\N
2085	صندوق الأهلي لأسواق الأسهم العربية	شركة الأهلي المالية	\N	SAR	47.9447	\N	-3.3300	\N	\N	2025-12-25 10:02:57.788992+02	\N	0.4890	35.8479	\N
6182	صندوق الأهلي لأسهم سوق نمو السعودي	شركة الأهلي المالية	\N	SAR	0.8717	\N	-12.9200	\N	\N	2025-12-25 10:02:57.788992+02	\N	-1.0367	16.1990	\N
1875	صندوق الإنماء للسيولة بالريال السعودي	الإنماء المالية	\N	SAR	13.8640	\N	5.2900	\N	\N	2025-12-25 10:02:57.789043+02	\N	-9.5002	0.1715	\N
1876	صندوق الجزيرة للمرابحه بالريال السعودي	الجزيرة للأسواق المالية	\N	SAR	178.4372	\N	4.5900	\N	\N	2025-12-25 10:02:57.789044+02	\N	-1.2306	0.3240	\N
1877	صندوق الجزيرة للأسهم الأوروبية	الجزيرة للأسواق المالية	\N	SAR	241.8243	\N	18.6900	\N	\N	2025-12-25 10:02:57.789045+02	\N	0.3736	29.8239	\N
1878	صندوق الجزيرة للأسهم العالمية	الجزيرة للأسواق المالية	\N	SAR	240.9928	\N	18.2800	\N	\N	2025-12-25 10:02:57.789046+02	\N	0.5212	26.3021	\N
1879	صندوق الجزيرة للأسهم اليابانية	الجزيرة للأسواق المالية	\N	SAR	243.5504	\N	16.0500	\N	\N	2025-12-25 10:02:57.789047+02	\N	0.4551	29.1173	\N
1881	صندوق الجزيرة للاسهم السعودية	الجزيرة للأسواق المالية	\N	SAR	1025.4466	\N	-6.6800	\N	\N	2025-12-25 10:02:57.78905+02	\N	0.2973	23.8690	\N
5977	صندوق الاستثمار كابيتال للتوزيعات الربعية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	10.1207	\N	-0.8600	\N	\N	2025-12-25 10:02:57.789051+02	\N	0.1800	7.3505	\N
5210	صندوق بي ام كي للإصدارات الأولية	بيت المال الخليجي	\N	SAR	13.0705	\N	-4.0200	\N	\N	2025-12-25 10:02:57.789052+02	\N	0.2192	16.8623	\N
5467	صندوق السعودي الفرنسي الخليجي للطروحات الأولية	السعودي الفرنسي كابيتال	\N	SAR	16.6584	\N	-19.4900	\N	\N	2025-12-25 10:02:57.789053+02	\N	0.5184	19.7593	\N
5723	صندوق الجزيرة للصكوك	الجزيرة للأسواق المالية	\N	SAR	103.5801	\N	7.1400	\N	\N	2025-12-25 10:02:57.789054+02	\N	-0.3257	3.7368	\N
5979	صندوق رصانة للمرابحة	رصانة المالية	\N	SAR	11.0613	\N	3.7600	\N	\N	2025-12-25 10:02:57.789055+02	\N	0.2520	0.2540	\N
5983	صندوق معيار للأسهم السعودية	معيار المالية	\N	SAR	11.5849	\N	-5.9500	\N	\N	2025-12-25 10:02:57.789056+02	\N	0.2182	14.7805	\N
1888	صندوق الراجحي للادخار والسيولة بالريال السعودي	الراجحي المالية	\N	SAR	189.3351	\N	4.4700	\N	\N	2025-12-25 10:02:57.789057+02	\N	-3.1098	0.3125	\N
1891	صندوق الراجحي للأسهم الخليجيه	الراجحي المالية	\N	SAR	331.3691	\N	-8.7200	\N	\N	2025-12-25 10:02:57.789058+02	\N	0.5534	27.9358	\N
1892	صندوق الراجحي للأسهم العالمية	الراجحي المالية	\N	SAR	484.4028	\N	17.4400	\N	\N	2025-12-25 10:02:57.789059+02	\N	0.7391	31.0824	\N
6245	صندوق دراية لفرص الأسهم السعودية	شركة دراية المالية	\N	SAR	8.7552	\N	0.0000	\N	\N	2025-12-25 10:02:57.78906+02	\N	-2.2956	23.4394	\N
1895	صندوق الراجحي للأسهم السعودية	الراجحي المالية	\N	SAR	1312.9491	\N	-10.9900	\N	\N	2025-12-25 10:02:57.789061+02	\N	0.4193	24.9912	\N
1897	صندوق الراجحي المتوازن	الراجحي المالية	\N	SAR	13.1972	\N	0.5400	\N	\N	2025-12-25 10:02:57.789062+02	\N	1.2296	6.2683	\N
1898	صندوق الراجحي للنمو	الراجحي المالية	\N	SAR	18.9914	\N	0.0000	\N	\N	2025-12-25 10:02:57.789062+02	\N	0.5332	106.0946	\N
1899	صندوق الراجحي المحافظ	الراجحي المالية	\N	SAR	581.6321	\N	2.5800	\N	\N	2025-12-25 10:02:57.789063+02	\N	1.0373	2.8083	\N
1900	صندوق الراجحي لأسهم قطاع المواد الأساسية	الراجحي المالية	\N	SAR	18.8404	\N	-6.4900	\N	\N	2025-12-25 10:02:57.789064+02	\N	0.2787	31.3329	\N
5228	صندوق أشمور للأسهم السعودية - الفئة أ	أشمور للإستثمار السعودية	\N	SAR	27.8926	\N	-7.1900	\N	\N	2025-12-25 10:02:57.789065+02	\N	0.8488	27.5844	\N
5996	صندوق الشفاء الصحي الوقفي	الراجحي المالية	\N	SAR	0.9891	\N	-3.1600	\N	\N	2025-12-25 10:02:57.789067+02	\N	-0.6965	6.1463	\N
5485	صندوق قيمة المرن للأسهم السعودية	شركة قيمة المالية	\N	SAR	17.7737	\N	-14.9700	\N	\N	2025-12-25 10:02:57.789068+02	\N	0.5314	26.1540	\N
5998	صندوق الإنماء المتنوع بالريال السعودي	الإنماء المالية	\N	SAR	10.2436	\N	1.3300	\N	\N	2025-12-25 10:02:57.789069+02	\N	-0.6698	3.2243	\N
1903	صندوق الراجحي للادخار والسيولة بالدولار الأمريكي	الراجحي المالية	\N	SAR	2732.1984	\N	4.4400	\N	\N	2025-12-25 10:02:57.78907+02	\N	-3.8562	0.2962	\N
1905	صندوق العربي المالية متعدد الأصول المتوازن المتوافق مع المعايير الشرعية	شركة العربي المالية	\N	SAR	112.6303	\N	-0.9200	\N	\N	2025-12-25 10:02:57.789071+02	\N	0.4758	101.6520	\N
5235	صندوق الأهلي المرن للأسهم السعودية	شركة الأهلي المالية	\N	SAR	3.0057	\N	-12.0400	\N	\N	2025-12-25 10:02:57.789072+02	\N	0.5151	16.9638	\N
1917	صندوق العربي المالية للمتاجرة بالريال السعودي المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	26.2843	\N	5.2500	\N	\N	2025-12-25 10:02:57.789074+02	\N	-1.3471	0.5654	\N
5501	صندوق الراجحي للنمو والتوزيعات	الراجحي المالية	\N	SAR	23.6854	\N	-10.7900	\N	\N	2025-12-25 10:02:57.789075+02	\N	0.8189	21.6970	\N
1921	صندوق العربي المالية للمتاجرة بالدولار الأمريكي المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	22.5205	\N	4.0300	\N	\N	2025-12-25 10:02:57.789076+02	\N	-4.0807	0.3457	\N
6017	صندوق دوم كابيتال للمرابحة بالريال السعودي	دوم كابيتال	\N	SAR	10.7251	\N	3.1900	\N	\N	2025-12-25 10:02:57.789078+02	\N	-5.6148	0.1528	\N
5507	صندوق دراية المرن للأسهم السعودية	شركة دراية المالية	\N	SAR	37.0870	\N	-16.1800	\N	\N	2025-12-25 10:02:57.789079+02	\N	1.3431	24.4292	\N
5752	صندوق البلاد المتنوع بالريال السعودي	البلاد للإستثمار	\N	SAR	10.8762	\N	1.7800	\N	\N	2025-12-25 10:02:57.789073+02	\N	\N	\N	\N
5763	صندوق بلوم إنفست للمرابحة بالريال السعودي	شركة بلوم للاستثمار السعوديه	\N	SAR	11.9491	\N	5.3700	\N	\N	2025-12-25 10:02:57.78908+02	\N	0.2819	1.7872	\N
6019	صندوق الراجحي للانضمام للمؤشرات	الراجحي المالية	\N	SAR	12.7349	\N	-14.1200	\N	\N	2025-12-25 10:02:57.789081+02	\N	0.5587	15.0271	\N
5764	صندوق الراجحي المرن للأسهم السعودية	الراجحي المالية	\N	SAR	16.6298	\N	-11.6500	\N	\N	2025-12-25 10:02:57.789081+02	\N	0.6434	15.4319	\N
6021	صندوق الراجحي النشط	الراجحي المالية	\N	SAR	11.6742	\N	-14.8500	\N	\N	2025-12-25 10:02:57.789083+02	\N	0.2876	15.9128	\N
6223	صندوق دراية لأسهم سوق نمو	شركة دراية المالية	\N	SAR	8.7212	\N	0.0000	\N	\N	2025-12-25 10:02:57.78904+02	\N	-2.8776	17.2953	\N
1874	صندوق الإنماء للأسهم السعودية	الإنماء المالية	\N	SAR	33.5470	\N	-13.7000	\N	\N	2025-12-25 10:02:57.789042+02	\N	0.7202	28.1890	\N
5514	صندوق أشمور الخليجي المتنوع للمتاجرة - الفئة أ	أشمور للإستثمار السعودية	\N	SAR	12.8086	\N	4.3200	\N	\N	2025-12-25 10:02:57.789085+02	\N	\N	\N	\N
1934	صندوق يقين للطروحات الأولية	شركة يقين المالية	\N	SAR	4987.9008	\N	-18.8900	\N	\N	2025-12-25 10:02:57.789088+02	\N	1.0762	31.9399	\N
1941	يقين للأسهم السعودية	شركة يقين المالية	\N	SAR	4.5085	\N	-15.1700	\N	\N	2025-12-25 10:02:57.78909+02	\N	0.0936	29.8041	\N
6039	صندوق الراجحي العقاري للتوزيعات الشهرية	الراجحي المالية	\N	SAR	9.0151	\N	-15.2100	\N	\N	2025-12-25 10:02:57.789091+02	\N	0.3150	26.4968	\N
1936	يقين للمرابحة بالريال السعودي	شركة يقين المالية	\N	SAR	1.5555	\N	5.4200	\N	\N	2025-12-25 10:02:57.789089+02	\N	\N	\N	\N
3736	صندوق الرياض الشجاع المتوافق مع الشريعة	الرياض المالية	\N	SAR	41.0100	\N	9.0900	\N	\N	2025-12-25 10:02:57.789092+02	\N	0.3638	205.1870	\N
5530	صندوق سيكو المالية لأسواق النقد	سيكو كابيتال	\N	SAR	13.6257	\N	0.0000	\N	\N	2025-12-25 10:02:57.789093+02	\N	0.6776	20.6708	\N
6043	صندوق دراية للأسهم السعودية	شركة دراية المالية	\N	SAR	12.3794	\N	-12.1400	\N	\N	2025-12-25 10:02:57.789094+02	\N	1.0072	23.0594	\N
1948	صندوق الأول للإستثمار للأسھم الخلیجیة	الأول للاستثمار	\N	SAR	47.5321	\N	7.8200	\N	\N	2025-12-25 10:02:57.789095+02	\N	0.8055	34.9267	\N
5532	صندوق الأهلي متعدد الأصول للدخل الإضافي	شركة الأهلي المالية	\N	SAR	1.0681	\N	1.6300	\N	\N	2025-12-25 10:02:57.789096+02	\N	-1.4340	2.2393	\N
6044	صندوق سيكو لأسهم المملكة - الفئة أ	سيكو كابيتال	\N	SAR	10.4230	\N	-2.1500	\N	\N	2025-12-25 10:02:57.789097+02	\N	0.1731	23.5670	\N
6045	صندوق سيكو لأسهم المملكة - الفئة ب	سيكو كابيتال	\N	SAR	10.4110	\N	-2.1800	\N	\N	2025-12-25 10:02:57.789098+02	\N	0.1670	23.5374	\N
6046	صندوق الراجحي للتوزيعات الشهرية 2	الراجحي المالية	\N	SAR	10.0593	\N	-0.8500	\N	\N	2025-12-25 10:02:57.789099+02	\N	-0.0439	7.6335	\N
1951	صندوق الأول للإستثمار للمرابحة بالدولار الأمریكي	الأول للاستثمار	\N	SAR	17.3423	\N	3.2700	\N	\N	2025-12-25 10:02:57.7891+02	\N	-0.9746	1.5705	\N
5791	صندوق الأهلي وجامعة الملك سعود الوقفي	شركة الأهلي المالية	\N	SAR	1.1674	\N	11.6200	\N	\N	2025-12-25 10:02:57.789101+02	\N	0.2685	5.1281	\N
1952	صندوق الأول للإستثمار لأسھم الصین والھند المرن	الأول للاستثمار	\N	SAR	30.9785	\N	16.0400	\N	\N	2025-12-25 10:02:57.789102+02	\N	0.5023	40.6760	\N
6049	صندوق دراية الخليجي لأسهم النمو والدخل	شركة دراية المالية	\N	SAR	14.8930	\N	-11.7900	\N	\N	2025-12-25 10:02:57.789103+02	\N	0.9986	20.3543	\N
1954	صندوق الأول للاستثمار لأسھم المؤسسات المالیة السعودیة	الأول للاستثمار	\N	SAR	34.2612	\N	-2.0600	\N	\N	2025-12-25 10:02:57.789104+02	\N	0.4893	40.2886	\N
6051	صندوق الراجحي للشركات المتوسطة والصغيرة	الراجحي المالية	\N	SAR	13.9109	\N	-14.7000	\N	\N	2025-12-25 10:02:57.789105+02	\N	0.8455	16.2979	\N
6053	صندوق ألفا المرن للأسهم السعودية	ألفا المالية	\N	SAR	13.7135	\N	-9.1400	\N	\N	2025-12-25 10:02:57.789106+02	\N	1.0385	29.6352	\N
6054	صندوق ألفا المالية العام للصكوك	ألفا المالية	\N	SAR	11.6313	\N	7.1600	\N	\N	2025-12-25 10:02:57.789107+02	\N	3.9762	3.2086	\N
6050	صندوق الرياض للفرص المتوافقة مع الشريعة	الرياض المالية	\N	SAR	9.1331	\N	-11.0800	\N	\N	2025-12-25 10:02:57.789104+02	\N	\N	\N	\N
3751	الأول للاستثمار التقليدي المرن للأسهم السعودية	الأول للاستثمار	\N	SAR	15.4579	\N	-11.0600	\N	\N	2025-12-25 10:02:57.789108+02	\N	0.1060	27.4088	\N
5543	صندوق جدوى للأسهم السعودية - الفئة أ	جدوى للإستثمار	\N	SAR	414.0834	\N	-6.7000	\N	\N	2025-12-25 10:02:57.789108+02	\N	1.0100	13.5721	\N
5544	صندوق جدوى للأسهم السعودية - الفئة ج	جدوى للإستثمار	\N	SAR	424.8733	\N	-6.5900	\N	\N	2025-12-25 10:02:57.789111+02	\N	1.0308	13.5611	\N
6056	صندوق الراجحي للعوائد	الراجحي المالية	\N	SAR	1.1206	\N	5.7500	\N	\N	2025-12-25 10:02:57.789112+02	\N	8.0812	0.3017	\N
3754	صندوق البدر للمرابحة بالدولار الأمريكي	السعودي الفرنسي كابيتال	\N	SAR	1.9404	\N	4.6700	\N	\N	2025-12-25 10:02:57.789114+02	\N	-1.4313	0.4174	\N
1963	صندوق الأول للإستثمار الدفاعي للأصول المتنوعة	الأول للاستثمار	\N	SAR	24.6550	\N	9.3900	\N	\N	2025-12-25 10:02:57.789115+02	\N	1.1010	7.4008	\N
1964	صندوق الأول للإستثمار المتنامي للأصول المتنوعة	الأول للاستثمار	\N	SAR	42.5424	\N	8.4400	\N	\N	2025-12-25 10:02:57.789116+02	\N	0.7414	22.0646	\N
5806	صندوق الوطني للأسھم السعودیة	الوطني لإدارة الثروات	\N	SAR	12.5443	\N	-1.5400	\N	\N	2025-12-25 10:02:57.789118+02	\N	0.5839	20.9745	\N
1968	صندوق الأول للإستثمار لأسھم شركات البناء والإسمنت السعودیة	الأول للاستثمار	\N	SAR	7.3012	\N	-11.0500	\N	\N	2025-12-25 10:02:57.789119+02	\N	0.0806	20.8962	\N
4528	صندوق السعودي الفرنسي للأسهم السعودية للدخل بالريال السعودي	السعودي الفرنسي كابيتال	\N	SAR	7.6991	\N	-19.7300	\N	\N	2025-12-25 10:02:57.78912+02	\N	-0.2374	21.4384	\N
1969	صندوق الأول للاستثمار للأسھم السعودیة	الأول للاستثمار	\N	SAR	424.7274	\N	-7.5500	\N	\N	2025-12-25 10:02:57.789121+02	\N	0.7761	39.0018	\N
5805	صندوق الرياض للفرص	الرياض المالية	\N	SAR	16.3787	\N	-6.2100	\N	\N	2025-12-25 10:02:57.789118+02	\N	\N	\N	\N
1971	صندوق الأول للإستثمار للأسھم السعودیة للدخل	الأول للاستثمار	\N	SAR	159.0610	\N	-16.2200	\N	\N	2025-12-25 10:02:57.789122+02	\N	0.4023	214.5690	\N
2995	صندوق الأهلي السنبلة بالريال	شركة الأهلي المالية	\N	SAR	142.4914	\N	5.7000	\N	\N	2025-12-25 10:02:57.789123+02	\N	-3.7672	0.2697	\N
2996	صندوق الأهلي السنبلة بالدولار	شركة الأهلي المالية	\N	SAR	34.1228	\N	4.7800	\N	\N	2025-12-25 10:02:57.789124+02	\N	-4.7481	0.3011	\N
1975	صندوق الأول للإستثمار للصكوك	الأول للاستثمار	\N	SAR	9.3975	\N	5.1100	\N	\N	2025-12-25 10:02:57.789126+02	\N	-0.1344	6.2642	\N
4531	صندوق الرياض للدخل	الرياض المالية	\N	SAR	8.7913	\N	-13.0800	\N	\N	2025-12-25 10:02:57.789124+02	\N	0.4015	135657166.2558	\N
5516	صندوق العربي المالية للاكتتابات الأولية المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	19.5557	\N	-15.5700	\N	\N	2025-12-25 10:02:57.789087+02	\N	0.4741	20.0923	\N
1931	صندوق بلوم السعودي	شركة بلوم للاستثمار السعوديه	\N	SAR	3617.1087	\N	-6.5400	\N	\N	2025-12-25 10:02:57.789086+02	\N	0.8443	27.0756	\N
3770	صندوق الأول للإستثمار المرن للأسھم السعودیة	الأول للاستثمار	\N	SAR	51.2110	\N	-15.6600	\N	\N	2025-12-25 10:02:57.789133+02	\N	0.9203	29.2133	\N
6074	الصندوق الأهلي متعدد الأصول المتحفظ بالريال	شركة الأهلي المالية	\N	SAR	10.2794	\N	1.5400	\N	\N	2025-12-25 10:02:57.789134+02	\N	-0.5333	3.8338	\N
3003	صندوق البدر للمرابحة بالريال السعودي	السعودي الفرنسي كابيتال	\N	SAR	18.8945	\N	5.2400	\N	\N	2025-12-25 10:02:57.789134+02	\N	-0.9719	0.3698	\N
4540	صندوق الخير كابيتال للمرابحة بالريال السعودي	الخير كابيتال السعودية	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789135+02	\N	0.0000	NaN	\N
6078	صندوق الاستثمار كابيتال المتنوع بالريال السعودي	الإستثمار للأوراق المالية و الوساطة	\N	SAR	10.7900	\N	4.2100	\N	\N	2025-12-25 10:02:57.789136+02	\N	0.2952	1.9626	\N
1983	صندوق جدوى لأسواق الأسهم العربية - الفئة ب	جدوى للإستثمار	\N	SAR	834.6820	\N	3.3500	\N	\N	2025-12-25 10:02:57.789137+02	\N	0.7855	22.2099	\N
3009	صندوق الاستثمار في الأسهم السعودية	السعودي الفرنسي كابيتال	\N	SAR	17678.6276	\N	-7.3700	\N	\N	2025-12-25 10:02:57.789138+02	\N	0.6367	28.5787	\N
1987	صندوق جدوى للأسهم الخليجية - الفئة ب	جدوى للإستثمار	\N	SAR	915.8080	\N	2.4700	\N	\N	2025-12-25 10:02:57.789138+02	\N	0.8084	22.7017	\N
1988	صندوق جدوى للصكوك العالمية - الفئة ب	جدوى للإستثمار	\N	SAR	153.6580	\N	5.8000	\N	\N	2025-12-25 10:02:57.789139+02	\N	0.1572	4.3002	\N
3012	صندوق الصفاء للمتاجرة بالأسهم السعودية	السعودي الفرنسي كابيتال	\N	SAR	27.6084	\N	-10.9200	\N	\N	2025-12-25 10:02:57.78914+02	\N	0.2824	31.7427	\N
3013	صندوق الأسواق المالية بالريال السعودي	السعودي الفرنسي كابيتال	\N	SAR	32.9710	\N	4.6300	\N	\N	2025-12-25 10:02:57.789141+02	\N	-3.9157	0.3441	\N
1990	صندوق جدوى للأسهم السعودية - الفئة ب	جدوى للإستثمار	\N	SAR	1010.0354	\N	-7.4300	\N	\N	2025-12-25 10:02:57.789142+02	\N	0.6144	22.8034	\N
1992	صندوق جدوى للمرابحة بالريال السعودي - الفئة ب	جدوى للإستثمار	\N	SAR	142.6430	\N	4.7600	\N	\N	2025-12-25 10:02:57.789145+02	\N	-5.3906	0.2875	\N
3022	صندوق أسهم المؤسسات المالية السعودية	الأول للاستثمار	\N	SAR	70.7073	\N	-1.7800	\N	\N	2025-12-25 10:02:57.789146+02	\N	0.0048	44.2893	\N
3792	صندوق الراجحي لأسواق الأسهم العربية	الراجحي المالية	\N	SAR	146.9887	\N	-7.3600	\N	\N	2025-12-25 10:02:57.789146+02	\N	0.1677	23.8357	\N
6096	صندوق دراية لأسواق النقد بالريال السعودي	شركة دراية المالية	\N	SAR	10.8460	\N	5.2200	\N	\N	2025-12-25 10:02:57.789147+02	\N	6.5846	0.2910	\N
2001	صندوق قيمة للطروحات الأولية	شركة قيمة المالية	\N	SAR	53.2361	\N	-22.4700	\N	\N	2025-12-25 10:02:57.789148+02	\N	1.4280	30.6073	\N
2002	صندوق قيمة لأسواق النقد	شركة قيمة المالية	\N	SAR	12.4678	\N	4.1000	\N	\N	2025-12-25 10:02:57.789149+02	\N	-9.7620	0.2463	\N
2007	صندوق ميفك للمرابحة بالريال السعودي	الشرق الأوسط للاستثمار المالي	\N	SAR	111.0888	\N	4.9600	\N	\N	2025-12-25 10:02:57.789153+02	\N	0.0000	NaN	\N
3033	صندوق أسواق النقد بالريال السعودي	الأول للاستثمار	\N	SAR	25.0482	\N	4.5300	\N	\N	2025-12-25 10:02:57.789154+02	\N	-2.3107	0.3995	\N
2012	صندوق الأهلي لمؤشر أسهم آسيا والباسيفيك	شركة الأهلي المالية	\N	SAR	2.1296	\N	11.9700	\N	\N	2025-12-25 10:02:57.789155+02	\N	0.3881	24.1745	\N
3036	الأول للاستثمار للصكوك والمرابحة	الأول للاستثمار	\N	SAR	14.3558	\N	5.5400	\N	\N	2025-12-25 10:02:57.789157+02	\N	-0.3377	24.2603	\N
3039	صندوق اليسر للمرابحة بالريال السعودي	الأول للاستثمار	\N	SAR	16.7380	\N	4.3700	\N	\N	2025-12-25 10:02:57.789159+02	\N	-1.1909	0.8505	\N
2017	صندوق الأهلي لمؤشر أسهم الأسواق الناشئة	شركة الأهلي المالية	\N	SAR	2.0625	\N	27.7500	\N	\N	2025-12-25 10:02:57.78916+02	\N	0.1658	26.9135	\N
2018	صندوق الأهلي لمؤشر أسهم أوروبا	شركة الأهلي المالية	\N	SAR	6.1240	\N	19.3900	\N	\N	2025-12-25 10:02:57.78916+02	\N	0.4597	24.0241	\N
3038	صندوق اليسر للأسهم السعودية	الأول للاستثمار	\N	SAR	161.7291	\N	-8.4300	\N	\N	2025-12-25 10:02:57.789158+02	\N	0.2636	13821554.7232	\N
6114	صندوق ملكية للمرابحة والادخار	شركة ملكية للاستثمار	\N	SAR	10.6991	\N	4.1800	\N	\N	2025-12-25 10:02:57.789161+02	\N	2.7886	0.3007	\N
2020	صندوق الأهلي للمتاجرة بالأسهم الخليجية	شركة الأهلي المالية	\N	SAR	2.0328	\N	-5.2500	\N	\N	2025-12-25 10:02:57.789163+02	\N	0.1812	22.2314	\N
5604	صندوق ميفك المرن للأسهم السعودية	الشرق الأوسط للاستثمار المالي	\N	SAR	243.9006	\N	-8.0700	\N	\N	2025-12-25 10:02:57.789164+02	\N	1.1009	24.6787	\N
2021	صندوق الأهلي العالمي للرعاية الصحية	شركة الأهلي المالية	\N	SAR	4.1843	\N	20.1200	\N	\N	2025-12-25 10:02:57.789165+02	\N	0.5252	19.3998	\N
5606	صندوق بيتك للسيولة	بيت التمويل السعودي الكويتي	\N	SAR	12.6558	\N	4.7900	\N	\N	2025-12-25 10:02:57.789166+02	\N	-2.1107	0.3454	\N
2023	صندوق الأهلي متعدد الأصول المتحفظ	شركة الأهلي المالية	\N	SAR	2.1969	\N	9.2400	\N	\N	2025-12-25 10:02:57.789168+02	\N	0.4469	4.8817	\N
2024	صندوق الأهلي متعدد الأصول للنمو	شركة الأهلي المالية	\N	SAR	3.6355	\N	16.4300	\N	\N	2025-12-25 10:02:57.789169+02	\N	0.4634	14.8561	\N
2025	صندوق الأهلي متعدد الأصول المتوازن	شركة الأهلي المالية	\N	SAR	2.9119	\N	13.0800	\N	\N	2025-12-25 10:02:57.789169+02	\N	0.4694	9.8604	\N
5605	صندوق الأهلي القابض لصناديق الاستثمار العقارية المتداولة	شركة الأهلي المالية	\N	SAR	0.7802	\N	-1.7300	\N	\N	2025-12-25 10:02:57.789166+02	\N	0.3728	1478232152.0788	\N
2027	صندوق الأهلي العالمي للريت	شركة الأهلي المالية	\N	SAR	1.0491	\N	3.4500	\N	\N	2025-12-25 10:02:57.78917+02	\N	-0.0130	23.1307	\N
4076	صندوق الجزيرة لتوزيع الأصول - الاستراتيجية المتحفظة	الجزيرة للأسواق المالية	\N	SAR	154.4620	\N	7.3800	\N	\N	2025-12-25 10:02:57.789174+02	\N	0.8304	3.6804	\N
6374	صندوق جود الوقفي	شركة الأهلي المالية	\N	SAR	1.0133	\N	0.0000	\N	\N	2025-12-25 10:02:57.789167+02	\N	\N	\N	\N
6072	صندوق الأهلي متعدد الأصول المتوازن بالريال	شركة الأهلي المالية	\N	SAR	9.7633	\N	-3.6000	\N	\N	2025-12-25 10:02:57.78913+02	\N	-0.5917	8.8623	\N
1977	صندوق إتقان للمرابحات والصكوك	إتقان كابيتال	\N	SAR	15.2554	\N	4.7800	\N	\N	2025-12-25 10:02:57.789131+02	\N	0.0050	8.3537	\N
5615	صندوق جدوى لأسواق الأسهم العربية - الفئة ج	جدوى للإستثمار	\N	SAR	308.7895	\N	4.4800	\N	\N	2025-12-25 10:02:57.789178+02	\N	1.1932	10.6954	\N
6382	صندوق سدكو كابيتال العالمي للتوزيعات الشهرية	الشركة السعودية للإقتصاد والتنمية للأوراق المالية	\N	SAR	9.9008	\N	0.0000	\N	\N	2025-12-25 10:02:57.789177+02	\N	\N	\N	\N
6383	صندوق سدكو كابيتال المغذي للأسهم الأمريكية	الشركة السعودية للإقتصاد والتنمية للأوراق المالية	\N	SAR	10.2659	\N	0.0000	\N	\N	2025-12-25 10:02:57.789179+02	\N	0.6362	14.9893	\N
5616	صندوق جدوى للأسهم الخليجية - الفئة أ	جدوى للإستثمار	\N	SAR	261.0646	\N	3.2700	\N	\N	2025-12-25 10:02:57.78918+02	\N	1.2778	7.8607	\N
5617	صندوق جدوى للأسهم الخليجية - الفئة ج	جدوى للإستثمار	\N	SAR	258.7104	\N	3.5800	\N	\N	2025-12-25 10:02:57.789181+02	\N	1.2500	7.9502	\N
5873	صندوق اشمور للأسهم السعودية - الفئة ب	أشمور للإستثمار السعودية	\N	SAR	28.4138	\N	-6.7200	\N	\N	2025-12-25 10:02:57.789182+02	\N	0.2090	22.5589	\N
6385	صندوق وينفستن كوانت للأسهم السعودية	شركة وينفستن المالية	\N	SAR	9.2282	\N	0.0000	\N	\N	2025-12-25 10:02:57.789183+02	\N	-0.8848	14.5187	\N
5618	صندوق جدوى للصكوك العالمية - الفئة أ	جدوى للإستثمار	\N	SAR	113.8743	\N	6.1000	\N	\N	2025-12-25 10:02:57.789184+02	\N	-1.0150	2.0764	\N
5874	صندوق معيار للمرابحة	معيار المالية	\N	SAR	11.7569	\N	5.0100	\N	\N	2025-12-25 10:02:57.789184+02	\N	4.1385	0.2519	\N
6386	صندوق وينفستن لأسواق النقد	شركة وينفستن المالية	\N	SAR	10.1652	\N	0.0000	\N	\N	2025-12-25 10:02:57.789185+02	\N	7.4889	0.2139	\N
5619	صندوق جدوى للصكوك العالمية - الفئة ج	جدوى للإستثمار	\N	SAR	122.0384	\N	6.2500	\N	\N	2025-12-25 10:02:57.789187+02	\N	-0.3967	2.7609	\N
2037	صندوق الأهلي للصكوك العالمية	شركة الأهلي المالية	\N	SAR	1.3361	\N	6.1000	\N	\N	2025-12-25 10:02:57.789188+02	\N	0.2645	116.0035	\N
5621	صندوق بلوم القابض لصناديق الريت	شركة بلوم للاستثمار السعوديه	\N	SAR	88.6245	\N	-5.3600	\N	\N	2025-12-25 10:02:57.789189+02	\N	-0.4444	15.3170	\N
2038	صندوق الأهلي لمؤشر أسهم أمريكا الشمالية	شركة الأهلي المالية	\N	SAR	11.6584	\N	17.6000	\N	\N	2025-12-25 10:02:57.789194+02	\N	0.6147	23.4659	\N
5624	صندوق ألفا للأسهم السعودية	ألفا المالية	\N	SAR	33.2715	\N	-3.6800	\N	\N	2025-12-25 10:02:57.789195+02	\N	1.5122	27.0779	\N
5625	صندوق ألفا للمرابحة	ألفا المالية	\N	SAR	12.8429	\N	5.6600	\N	\N	2025-12-25 10:02:57.789199+02	\N	-0.4296	0.2557	\N
6389	صندوق الإنماء المرن للأسهم السعودية	الإنماء المالية	\N	SAR	0.9351	\N	0.0000	\N	\N	2025-12-25 10:02:57.789193+02	\N	\N	\N	\N
2044	صندوق الرياض المتحفظ المتوافق مع الشريعة	الرياض المالية	\N	SAR	18.4226	\N	5.3900	\N	\N	2025-12-25 10:02:57.789201+02	\N	0.7101	2.2815	\N
2045	صندوق الرياض للأسهم الأمريكية	الرياض المالية	\N	SAR	181.7800	\N	12.3400	\N	\N	2025-12-25 10:02:57.789202+02	\N	0.7213	26.2865	\N
4861	صندوق بيت المال الخليجي للأسهم السعودية	بيت المال الخليجي	\N	SAR	26.5893	\N	-8.1300	\N	\N	2025-12-25 10:02:57.789203+02	\N	0.8876	23.3122	\N
6393	صندوق ألفا المالية المرن للأسهم الخليجية	ألفا المالية	\N	SAR	9.4911	\N	0.0000	\N	\N	2025-12-25 10:02:57.7892+02	\N	\N	\N	\N
6394	صندوق الوطني للصكوك	الوطني لإدارة الثروات	\N	SAR	10.2800	\N	0.0000	\N	\N	2025-12-25 10:02:57.789201+02	\N	\N	\N	\N
5885	صندوق الراجحي للتوزيعات الشهرية	الراجحي المالية	\N	SAR	10.1195	\N	-2.1700	\N	\N	2025-12-25 10:02:57.789204+02	\N	-0.1922	7.8887	\N
6142	صندوق الراجحي القيادي	الراجحي المالية	\N	SAR	9.4889	\N	-7.8200	\N	\N	2025-12-25 10:02:57.789206+02	\N	-0.4464	15.0632	\N
6152	صندوق جي آي بي لفرص الأسهم الهندية - الفئة ج	جي آي بي كابيتال	\N	SAR	8.1055	\N	-9.3700	\N	\N	2025-12-25 10:02:57.789208+02	\N	-1.8963	26.1392	\N
2046	صندوق الرياض للدخل المتوازن	الرياض المالية	\N	SAR	27.1892	\N	-3.2300	\N	\N	2025-12-25 10:02:57.789205+02	\N	0.3247	52402489.2315	\N
6153	صندوق جي آي بي لفرص الأسهم الهندية - الفئة ب	جي آي بي كابيتال	\N	SAR	8.0518	\N	-9.8300	\N	\N	2025-12-25 10:02:57.789209+02	\N	-1.9583	26.1066	\N
6154	صندوق جي آي بي لفرص الأسهم الهندية - الفئة أ	جي آي بي كابيتال	\N	SAR	8.0810	\N	-9.5700	\N	\N	2025-12-25 10:02:57.78921+02	\N	-1.9258	26.1093	\N
5904	صندوق البلاد متعدد الأصول المتوازن	البلاد للإستثمار	\N	SAR	11.4785	\N	-3.7000	\N	\N	2025-12-25 10:02:57.789211+02	\N	0.4668	19.9489	\N
5909	صندوق جي آي بي لأسهم الشرق الأوسط وشمال أفريقيا بمعايير إي أس جي - ج	جي آي بي كابيتال	\N	SAR	14.9769	\N	0.9200	\N	\N	2025-12-25 10:02:57.789212+02	\N	1.6552	19.4051	\N
5914	صندوق البلاد المرن للأسهم السعودية	البلاد للإستثمار	\N	SAR	14.5675	\N	-10.1100	\N	\N	2025-12-25 10:02:57.789213+02	\N	1.2625	25.2550	\N
5920	صندوق البلاد للصكوك	البلاد للإستثمار	\N	SAR	10.1001	\N	3.8300	\N	\N	2025-12-25 10:02:57.789214+02	\N	0.0491	5.9056	\N
5681	صندوق جي آي بي لفرص أسهم الشرق الأوسط وشمال أفريقيا - الفئة ب	جي آي بي كابيتال	\N	SAR	10.5107	\N	0.3400	\N	\N	2025-12-25 10:02:57.789215+02	\N	0.7332	2593.3835	\N
5682	صندوق جي آي بي لفرص أسهم الشرق الأوسط وشمال أفريقيا - الفئة ج	جي آي بي كابيتال	\N	SAR	29.7131	\N	1.7600	\N	\N	2025-12-25 10:02:57.789216+02	\N	1.8986	22.8822	\N
5683	صندوق انسان الاستثماري الوقفي	البلاد للإستثمار	\N	SAR	13.0302	\N	1.6800	\N	\N	2025-12-25 10:02:57.78922+02	\N	0.5995	13.0454	\N
1859	صندوق البلاد للأسهم السعودية النقية	البلاد للإستثمار	\N	SAR	1.0513	\N	-15.1600	\N	\N	2025-12-25 10:02:57.789221+02	\N	0.1208	38.8818	\N
5700	صندوق العربي المالية للصكوك السيادية السعودية المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	9.6973	\N	2.3100	\N	\N	2025-12-25 10:02:57.789222+02	\N	-0.4573	10.4757	\N
6224	صندوق بيتك للصكوك العالمية	بيت التمويل السعودي الكويتي	\N	SAR	103.6505	\N	0.0000	\N	\N	2025-12-25 10:02:57.789223+02	\N	3.5961	2.3999	\N
6230	صندوق دينار للأسهم السعودية	دينار للأستثمار	\N	SAR	9.0627	\N	0.0000	\N	\N	2025-12-25 10:02:57.789224+02	\N	-1.5838	24.3928	\N
5614	صندوق جدوى لأسواق الأسهم العربية - الفئة أ	جدوى للإستثمار	\N	SAR	252.2027	\N	4.1700	\N	\N	2025-12-25 10:02:57.789175+02	\N	1.1912	7.9748	\N
2031	صندوق الأهلي لأسهم الشركات الصغيرة و المتوسطة	شركة الأهلي المالية	\N	SAR	5.6781	\N	-16.1600	\N	\N	2025-12-25 10:02:57.789178+02	\N	0.5557	24.1329	\N
1915	صندوق العربي المالية للأسهم السعودية النقية المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	20.1267	\N	-10.6800	\N	\N	2025-12-25 10:02:57.789227+02	\N	0.3378	35.3674	\N
1916	صندوق العربي المالية للأسهم السعودية المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	258.4958	\N	-3.3300	\N	\N	2025-12-25 10:02:57.789228+02	\N	0.7437	35.8718	\N
1918	صندوق العربي المالية للأسهم السعودية	شركة العربي المالية	\N	SAR	238.6148	\N	-3.3800	\N	\N	2025-12-25 10:02:57.78923+02	\N	0.6378	35.9801	\N
6018	صندوق جمعيات التوحد الوقفي	الراجحي المالية	\N	SAR	1.0072	\N	-1.7400	\N	\N	2025-12-25 10:02:57.789231+02	\N	-0.4539	7.1728	\N
6022	صندوق جمعيات الأيتام الوقفي	الراجحي المالية	\N	SAR	0.9837	\N	-3.3200	\N	\N	2025-12-25 10:02:57.789232+02	\N	-0.5544	7.0805	\N
6023	صندوق جمعيات القرآن الكريم الوقفي	الراجحي المالية	\N	SAR	0.9990	\N	-2.9200	\N	\N	2025-12-25 10:02:57.789233+02	\N	0.1357	7.5977	\N
6024	صندوق جمعيات المنطقة الشرقية الوقفي	الراجحي المالية	\N	SAR	1.0005	\N	-2.4600	\N	\N	2025-12-25 10:02:57.789234+02	\N	-0.4968	7.4252	\N
6033	صندوق جمعيات ضيوف الرحمن الوقفي	الراجحي المالية	\N	SAR	0.9989	\N	-2.8000	\N	\N	2025-12-25 10:02:57.789235+02	\N	-0.2079	6.7367	\N
6034	صندوق الجمعيات الصحية الوقفي	الراجحي المالية	\N	SAR	0.9908	\N	-3.2900	\N	\N	2025-12-25 10:02:57.789235+02	\N	-0.5829	7.4998	\N
6048	صندوق العربي المالية للفرص	شركة العربي المالية	\N	SAR	15.5376	\N	-4.3800	\N	\N	2025-12-25 10:02:57.789236+02	\N	1.6195	24.5989	\N
6052	صندوق الإنماء لأسهم الأسواق الناشئة	الإنماء المالية	\N	SAR	13.9245	\N	21.0100	\N	\N	2025-12-25 10:02:57.789237+02	\N	1.6375	21.7029	\N
6055	صندوق تكافل الوقفي	الراجحي المالية	\N	SAR	0.9518	\N	-3.0400	\N	\N	2025-12-25 10:02:57.789238+02	\N	-0.8811	9.0099	\N
6077	صندوق تراحم الوقفي	الراجحي المالية	\N	SAR	0.9917	\N	-1.0100	\N	\N	2025-12-25 10:02:57.789239+02	\N	-0.5784	8.1898	\N
6085	صندوق جي آي بي لأسهم الشركات السعودية الصغيرة والمتوسطة - الفئة ب	جي آي بي كابيتال	\N	SAR	9.2868	\N	-15.2500	\N	\N	2025-12-25 10:02:57.789241+02	\N	-0.3654	31.1230	\N
3782	صندوق البلاد للأسهم السعودية للدخل	البلاد للإستثمار	\N	SAR	1.9969	\N	-10.8800	\N	\N	2025-12-25 10:02:57.789242+02	\N	0.4276	43.2876	\N
2010	صندوق مورغان ستانلي للأسهم السعودية	مورغان ستانلي العربية السعودية	\N	SAR	1042.4201	\N	-6.1800	\N	\N	2025-12-25 10:02:57.789243+02	\N	0.5263	43.9065	\N
6116	صندوق جي آي بي لأسهم الشركات السعودية الصغيرة والمتوسطة - الفئة أ	جي آي بي كابيتال	\N	SAR	8.7531	\N	-14.3500	\N	\N	2025-12-25 10:02:57.789244+02	\N	-0.6885	31.3361	\N
5607	صندوق جي آي بي لفرص الأسهم السعودية - الفئة أ	جي آي بي كابيتال	\N	SAR	9.6015	\N	-16.7300	\N	\N	2025-12-25 10:02:57.789245+02	\N	0.7962	1450.8601	\N
5608	صندوق جي آي بي لفرص الأسهم السعودية - الفئة ب	جي آي بي كابيتال	\N	SAR	25.8612	\N	-9.9400	\N	\N	2025-12-25 10:02:57.789246+02	\N	1.0838	27.6176	\N
5609	صندوق جي آي بي لفرص الأسهم السعودية - الفئة ج	جي آي بي كابيتال	\N	SAR	28.9097	\N	-8.6700	\N	\N	2025-12-25 10:02:57.789246+02	\N	1.2128	27.6300	\N
4587	صندوق البلاد للأسهم الخليجية للدخل	البلاد للإستثمار	\N	SAR	1.3654	\N	-3.0400	\N	\N	2025-12-25 10:02:57.789247+02	\N	0.3150	20.7387	\N
5611	صندوق جي آي بي للأسهم السعودية - الفئة ب	جي آي بي كابيتال	\N	SAR	25.3585	\N	-6.5900	\N	\N	2025-12-25 10:02:57.789248+02	\N	1.0992	27.7838	\N
5612	صندوق جي آي بي للأسهم السعودية - الفئة ج	جي آي بي كابيتال	\N	SAR	28.3093	\N	-5.2800	\N	\N	2025-12-25 10:02:57.789249+02	\N	1.2283	27.7840	\N
5883	صندوق الأوقاف الصحية	مصرف الراجحي	\N	SAR	0.9436	\N	-3.9300	\N	\N	2025-12-25 10:02:57.789255+02	\N	-0.8903	6.4379	\N
1949	صندوق الأول للإستثمار لمؤشر الأسھم العالمیة	الأول للاستثمار	\N	SAR	63.9361	\N	16.0000	\N	\N	2025-12-25 10:02:57.789257+02	\N	0.9337	28.1894	\N
3005	صندوق الدانة للمتاجرة بالأسهم الخليجية	السعودي الفرنسي كابيتال	\N	SAR	29.7372	\N	-6.4900	\N	\N	2025-12-25 10:02:57.789259+02	\N	0.4944	33.1794	\N
6388	صندوق جامعة الملك فيصل الاستثماري الوقفي	البلاد للإستثمار	\N	SAR	9.7951	\N	0.0000	\N	\N	2025-12-25 10:02:57.78925+02	\N	\N	\N	\N
3011	صندوق القصر العقاري للمتاجرة بالأسهم الخليجية	السعودي الفرنسي كابيتال	\N	SAR	20.2018	\N	-13.2800	\N	\N	2025-12-25 10:02:57.78926+02	\N	0.3450	30.2345	\N
5727	صندوق النفقة الوقفي	جدوى للإستثمار	\N	SAR	13.5534	\N	0.6300	\N	\N	2025-12-25 10:02:57.789256+02	\N	0.6106	54281223.3791	\N
4099	صندوق الإنماء المتوازن متعدد الأصول للتوزيعات الشهرية	الإنماء المالية	\N	SAR	20.3148	\N	-8.1000	\N	\N	2025-12-25 10:02:57.789262+02	\N	0.8082	13.6207	\N
6181	صندوق ألفا المالية المرن لسوق نمو	ألفا المالية	\N	SAR	7.8479	\N	-24.0700	\N	\N	2025-12-25 10:02:57.789262+02	\N	-4.0204	27.1491	\N
1959	صندوق الأول للإستثمار لأسھم الشركات الصناعیة السعودیة	الأول للاستثمار	\N	SAR	14.6477	\N	-10.6500	\N	\N	2025-12-25 10:02:57.789266+02	\N	0.2544	54.8079	\N
3023	الأول للاستثمار التقليدي للأسهم الخليجية	الأول للاستثمار	\N	SAR	38.6179	\N	8.5000	\N	\N	2025-12-25 10:02:57.789266+02	\N	0.3894	19.3275	\N
5722	صندوق الأهلي لصكوك الشركات - فئة ب	شركة الأهلي المالية	\N	SAR	11.4767	\N	6.1500	\N	\N	2025-12-25 10:02:57.789267+02	\N	2.3791	3.6539	\N
5730	صندوق الأهلي لصكوك الشركات - فئة أ	شركة الأهلي المالية	\N	SAR	11.6476	\N	6.4400	\N	\N	2025-12-25 10:02:57.789268+02	\N	3.0371	3.3688	\N
4541	صندوق الخير كابيتال بلص للصكوك	الخير كابيتال السعودية	\N	SAR	132.2458	\N	6.3200	\N	\N	2025-12-25 10:02:57.789269+02	\N	0.9946	8.7490	\N
4902	صندوق الراجحي للصكوك	الراجحي المالية	\N	SAR	135.9041	\N	5.0400	\N	\N	2025-12-25 10:02:57.78927+02	\N	4.4786	5.6600	\N
5678	صندوق الإنماء الوقفي لرعاية الايتام	الإنماء المالية	\N	SAR	12.0343	\N	-7.0200	\N	\N	2025-12-25 10:02:57.789271+02	\N	2.1974	38.1015	\N
5680	صندوق الإنماء عناية الوقفي	الإنماء المالية	\N	SAR	12.2829	\N	-6.4800	\N	\N	2025-12-25 10:02:57.789272+02	\N	2.3435	40.5827	\N
5997	صندوق العربي المالية لأسهم التوزيعات المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	10.0937	\N	-6.8500	\N	\N	2025-12-25 10:02:57.789225+02	\N	0.0276	18.0870	\N
6097	صندوق جامعة الملك خالد الوقفي	الإنماء المالية	\N	SAR	10.0003	\N	-2.3400	\N	\N	2025-12-25 10:02:57.789275+02	\N	\N	\N	\N
5728	صندوق بر الرياض الوقفي	الإنماء المالية	\N	SAR	11.5929	\N	-5.2200	\N	\N	2025-12-25 10:02:57.789274+02	\N	1.9595	38.2014	\N
2028	صندوق الأهلي للصدقات	شركة الأهلي المالية	\N	SAR	1.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789276+02	\N	0.0000	0.0000	\N
5628	صندوق الإنماء وريف الوقفي	الإنماء المالية	\N	SAR	12.0922	\N	-8.2900	\N	\N	2025-12-25 10:02:57.789277+02	\N	2.0411	39.7267	\N
5623	صندوق أرباح للسيولة اليومية	أرباح المالية	\N	SAR	12.9574	\N	3.7700	\N	\N	2025-12-25 10:02:57.789278+02	\N	-0.2504	0.4582	\N
2000	صندوق كسب الفرص العقارية	شركة قيمة المالية	\N	SAR	9.0750	\N	0.0000	\N	\N	2025-12-25 10:02:57.789279+02	\N	0.2204	117.3617	\N
2101	صندوق الأهلي العقاري	شركة الأهلي المالية	\N	SAR	3.2954	\N	-38.1100	\N	\N	2025-12-25 10:02:57.78928+02	\N	0.1803	269.7422	\N
3027	صندوق الأسهم اليابانية - الهولندى	الأول للاستثمار	\N	SAR	80.5808	\N	0.0300	\N	\N	2025-12-25 10:02:57.789632+02	\N	0.0337	56.7168	\N
1860	صندوق أسهم المصارف والمؤسسات المالية الخليجية - أموال	البلاد للإستثمار	\N	SAR	0.7281	\N	6.0100	\N	\N	2025-12-25 10:02:57.789365+02	\N	-0.2718	29.7027	\N
1919	صندوق العربي لسوق النقد السعودي	شركة العربي المالية	\N	SAR	15.1781	\N	-0.4000	\N	\N	2025-12-25 10:02:57.789366+02	\N	-1.6189	0.4931	\N
5539	صندوق كسب للإدخار والإستثمار	شركة قيمة المالية	\N	SAR	0.8359	\N	-2.1000	\N	\N	2025-12-25 10:02:57.789367+02	\N	-5.0920	8.1222	\N
2004	صندوق كسب الأسهم السعودية	شركة قيمة المالية	\N	SAR	12.5152	\N	8.7500	\N	\N	2025-12-25 10:02:57.789368+02	\N	0.2186	33.1734	\N
1922	صندوق العربي للأسهم الأمريكية	شركة العربي المالية	\N	SAR	20.6460	\N	1.3800	\N	\N	2025-12-25 10:02:57.789369+02	\N	0.7143	33.2024	\N
3971	صندوق الدخل الثابت للأسواق الناشئة	السعودي الفرنسي كابيتال	\N	SAR	95.7883	\N	-1.6300	\N	\N	2025-12-25 10:02:57.789369+02	\N	-0.4702	11.9067	\N
4918	صندوق عودة  للطروحات الأولية	عوده كابيتال - السعودية	\N	SAR	6.5382	\N	1.0500	\N	\N	2025-12-25 10:02:57.789377+02	\N	-1.2915	26.0317	\N
1986	صندوق جدوى لمؤشر الأسهم الخليجية	جدوى للإستثمار	\N	SAR	46.1451	\N	-36.2500	\N	\N	2025-12-25 10:02:57.789378+02	\N	-0.1180	20.9320	\N
4524	صندوق ديم للسيولة بالريال	المستثمرون الخليجيون لإدارة الأصول	\N	SAR	104.0400	\N	0.0100	\N	\N	2025-12-25 10:02:57.789378+02	\N	-5.5136	0.2369	\N
5478	صندوق نمو للطروحات الأولية	نمو المالية	\N	SAR	9.7150	\N	-0.0100	\N	\N	2025-12-25 10:02:57.789379+02	\N	-0.6705	9.9134	\N
2061	الصندوق الدولي	الرياض المالية	\N	SAR	16.0014	\N	0.2600	\N	\N	2025-12-25 10:02:57.78938+02	\N	0.3962	24.7501	\N
2067	صندوق الموارد الطبيعية	الرياض المالية	\N	SAR	2.9082	\N	0.0500	\N	\N	2025-12-25 10:02:57.789381+02	\N	-0.7681	33.3725	\N
2074	صندوق التكنولوجيا	الرياض المالية	\N	SAR	26.2963	\N	-0.5900	\N	\N	2025-12-25 10:02:57.789382+02	\N	0.8731	31.5426	\N
2075	صندوق الاتصالات	الرياض المالية	\N	SAR	15.9401	\N	-0.7700	\N	\N	2025-12-25 10:02:57.789383+02	\N	0.5688	24.8491	\N
2076	صندوق السندات بالدولار	الرياض المالية	\N	SAR	17.0527	\N	-0.1100	\N	\N	2025-12-25 10:02:57.789383+02	\N	-0.4001	9.2337	\N
2047	صندوق الأسهم البريطانية	الرياض المالية	\N	SAR	49.6165	\N	0.3700	\N	\N	2025-12-25 10:02:57.789384+02	\N	0.5677	28.6695	\N
1991	صندوق جدوى لمؤشر الأسهم السعودية	جدوى للإستثمار	\N	SAR	88.1717	\N	0.0000	\N	\N	2025-12-25 10:02:57.789385+02	\N	0.2120	19.2610	\N
1907	صندوق المبارك المتوازن	شركة العربي المالية	\N	SAR	13.5537	\N	3.8200	\N	\N	2025-12-25 10:02:57.789386+02	\N	0.3153	17.6237	\N
1909	صندوق العربي المحافظ	شركة العربي المالية	\N	SAR	14.0980	\N	3.0300	\N	\N	2025-12-25 10:02:57.789387+02	\N	0.4537	7.9859	\N
1912	صندوق العربي للنمو	شركة العربي المالية	\N	SAR	19.1462	\N	4.8400	\N	\N	2025-12-25 10:02:57.789387+02	\N	0.6385	22.6165	\N
3021	صندوق اليسر للأسهم العالمية	الأول للاستثمار	\N	SAR	142.9319	\N	15.3000	\N	\N	2025-12-25 10:02:57.789388+02	\N	0.2148	15.2699	\N
1933	صندوق فالكم الخليجي للدخل	شركة يقين المالية	\N	SAR	10.1185	\N	-4.5000	\N	\N	2025-12-25 10:02:57.789389+02	\N	-0.0183	25.3516	\N
5489	صندوق الأولى جوجيت كابيتال للطروحات الأولية	الأولى جيوجيت كابيتال	\N	SAR	3.4076	\N	-63.8200	\N	\N	2025-12-25 10:02:57.789391+02	\N	-4.0425	35.6228	\N
5364	صندوق أشمور للأسهم الخليجية	أشمور للإستثمار السعودية	\N	SAR	8.1472	\N	-1.3700	\N	\N	2025-12-25 10:02:57.789394+02	\N	-1.0268	20.8004	\N
4402	صندوق الأهلي العالمي للنمو والدخل	شركة الأهلي المالية	\N	SAR	1.0558	\N	5.7700	\N	\N	2025-12-25 10:02:57.789398+02	\N	0.0866	20.9620	\N
4497	صندوق الأول للأسهم المصرية	شركة الأول كابيتال	\N	SAR	4.7218	\N	2.0600	\N	\N	2025-12-25 10:02:57.789398+02	\N	-1.1411	20.9796	\N
2039	صندوق رنا للاسهم السعودية	شركه رنا للاستثمار	\N	SAR	5.8540	\N	3.6300	\N	\N	2025-12-25 10:02:57.789399+02	\N	-0.3362	38.1855	\N
5545	صندوق مُلكيّة العقاري المدر للدخل	شركة ملكية للاستثمار	\N	SAR	10.5785	\N	0.9500	\N	\N	2025-12-25 10:02:57.789393+02	\N	\N	\N	\N
1906	صندوق العربي للأسهم الآسيوية	شركة العربي المالية	\N	SAR	22.3763	\N	11.7800	\N	\N	2025-12-25 10:02:57.7894+02	\N	0.5451	42.4266	\N
5513	صندوق أديم القابض للاستثمار في صناديق الطروحات الاولية	أديم المالية	\N	SAR	9.0017	\N	-5.5500	\N	\N	2025-12-25 10:02:57.789401+02	\N	-2.4412	9.8848	\N
3040	صندوق المستثمر الحر للأسهم السعودية	المستثمر للأوراق المالية	\N	SAR	7.0178	\N	72.7200	\N	\N	2025-12-25 10:02:57.789402+02	\N	-0.0759	40.0729	\N
1883	صندوق الخبير للسيولة - حصين	الخبير المالية	\N	SAR	1063.0000	\N	2.2300	\N	\N	2025-12-25 10:02:57.789405+02	\N	-18.6880	0.1114	\N
4118	صندوق الخبير للأسهم السعودية	الخبير المالية	\N	SAR	1122.6900	\N	-4.4900	\N	\N	2025-12-25 10:02:57.789406+02	\N	0.3066	35.8360	\N
1882	صندوق الخبير للأسهم الخليجية	الخبير المالية	\N	SAR	1246.9300	\N	-0.9600	\N	\N	2025-12-25 10:02:57.789407+02	\N	0.3638	27.9597	\N
5490	صندوق الخبير للطروحات الأولية	الخبير المالية	\N	SAR	891.3440	\N	-7.8600	\N	\N	2025-12-25 10:02:57.789407+02	\N	-1.8876	18.1038	\N
2048	صندوق الرياض العقاري - برج رافال	الرياض المالية	\N	SAR	10.6657	\N	-22.5700	\N	\N	2025-12-25 10:02:57.789402+02	\N	\N	\N	\N
1929	صندوق أصول و بخيت للمتاجرة بالأسهم القطرية	شركة أصول وبخيت الاستثمارية	\N	SAR	1.2193	\N	0.9900	\N	\N	2025-12-25 10:02:57.789408+02	\N	0.3743	25.6913	\N
5538	صندوق مشاركة العقاري للدخل	شركة مشاركة المالية ش.م.م	\N	SAR	9.9927	\N	0.0000	\N	\N	2025-12-25 10:02:57.789404+02	\N	\N	\N	\N
3734	صندوق الاهلى للمتاجرة بالاسهم العالمية	شركة الأهلي المالية	\N	SAR	2.6105	\N	6.9000	\N	\N	2025-12-25 10:02:57.789409+02	\N	0.3100	21.1056	\N
2029	صندوق الأهلي للمتاجرة بأسهم الشركات الصاعدة	شركة الأهلي المالية	\N	SAR	1.7141	\N	6.9000	\N	\N	2025-12-25 10:02:57.78941+02	\N	0.3486	36.7942	\N
1908	صندوق العربي للسندات العالمية	شركة العربي المالية	\N	SAR	15.2500	\N	4.6800	\N	\N	2025-12-25 10:02:57.789411+02	\N	0.5246	12.6505	\N
1910	صندوق العربي للأسهم الأوروبية	شركة العربي المالية	\N	SAR	17.3382	\N	-4.8700	\N	\N	2025-12-25 10:02:57.789412+02	\N	0.4392	49.3983	\N
3774	صندوق العربي للأسهم اليابانية	شركة العربي المالية	\N	SAR	12.4329	\N	-4.7200	\N	\N	2025-12-25 10:02:57.789413+02	\N	0.5532	27.3395	\N
4534	صندوق الأولى جوجيت كابيتال للمرابحة بالريال السعودي	الأولى جيوجيت كابيتال	\N	SAR	9.2267	\N	-3.3800	\N	\N	2025-12-25 10:02:57.789416+02	\N	-15.5425	0.8869	\N
2016	صندوق الأهلي للمرابحات باليورو	شركة الأهلي المالية	\N	SAR	1.1919	\N	0.0000	\N	\N	2025-12-25 10:02:57.789417+02	\N	-5.2922	0.4055	\N
4085	صندوق الأهلي العالمي للموارد الطبيعية	شركة الأهلي المالية	\N	SAR	0.7211	\N	4.6000	\N	\N	2025-12-25 10:02:57.789418+02	\N	-0.7732	32.6099	\N
2006	صندوق عمان الرائد	سيكو كابيتال	\N	SAR	96.5050	\N	-4.6500	\N	\N	2025-12-25 10:02:57.789418+02	\N	-0.3755	11.6464	\N
1911	صندوق المبارك للأسھم العالمیة	شركة العربي المالية	\N	SAR	15.2978	\N	-3.6900	\N	\N	2025-12-25 10:02:57.789419+02	\N	0.5394	16305646.7427	\N
1870	صندوق صائب للصكوك	الإستثمار للأوراق المالية و الوساطة	\N	SAR	99.4949	\N	-8.2000	\N	\N	2025-12-25 10:02:57.789376+02	\N	-0.3676	11.2451	\N
5540	صندوق جدوى للإصدارات الأولية السعودية	جدوى للإستثمار	\N	SAR	82.9170	\N	1.1500	\N	\N	2025-12-25 10:02:57.789371+02	\N	-1.8108	11.1097	\N
2034	صندوق الأهلي للدولار قصير الأجل	شركة الأهلي المالية	\N	SAR	5.1996	\N	0.0200	\N	\N	2025-12-25 10:02:57.789424+02	\N	-2.8910	0.4937	\N
1927	صندوق المؤشر السعودي	عوده كابيتال - السعودية	\N	SAR	10.1756	\N	27.4700	\N	\N	2025-12-25 10:02:57.789427+02	\N	0.0085	25.3681	\N
3756	صندوق العقار العالمي	الأول للاستثمار	\N	SAR	126.2603	\N	13.0500	\N	\N	2025-12-25 10:02:57.789428+02	\N	0.3386	18.5510	\N
1855	صندوق الأول للتطوير العقاري	شركة الأول كابيتال	\N	SAR	11.9400	\N	-49.9200	\N	\N	2025-12-25 10:02:57.789425+02	\N	\N	\N	\N
3752	صندوق المستثمر العقاري للمشاريع المتعددة	المستثمر للأوراق المالية	\N	SAR	12.0122	\N	-0.0300	\N	\N	2025-12-25 10:02:57.789425+02	\N	\N	\N	\N
1939	صندوق الرابية العقاري	شركة يقين المالية	\N	SAR	22.0267	\N	47.7400	\N	\N	2025-12-25 10:02:57.789426+02	\N	\N	\N	\N
3019	صندوق اليسر لأسهم الأسواق الناشئة	الأول للاستثمار	\N	SAR	80.4616	\N	4.7500	\N	\N	2025-12-25 10:02:57.789429+02	\N	-0.4871	22.3953	\N
1894	صندوق الراجحي لأسهم الهند والصين	الراجحي المالية	\N	SAR	11.8687	\N	5.7000	\N	\N	2025-12-25 10:02:57.789429+02	\N	0.2970	43.9405	\N
1993	صندوق جدوى للمرابحة بالدولار	جدوى للإستثمار	\N	SAR	108.4355	\N	0.0500	\N	\N	2025-12-25 10:02:57.789431+02	\N	-0.5564	3.7503	\N
3020	صندوق أسهم الأسواق الناشئة	الأول للاستثمار	\N	SAR	85.6410	\N	-7.2000	\N	\N	2025-12-25 10:02:57.789432+02	\N	-0.3869	24.1951	\N
3024	صندوق الأسهم العالمية	الأول للاستثمار	\N	SAR	127.1440	\N	23.0600	\N	\N	2025-12-25 10:02:57.789433+02	\N	0.3927	20.5045	\N
3035	صندوق أسواق المال بالدولار الأمريكي	الأول للاستثمار	\N	SAR	17.6553	\N	0.4600	\N	\N	2025-12-25 10:02:57.789433+02	\N	-0.2377	3.2880	\N
3018	صندوق مؤشر تداول الأسهم السعودية	الأول للاستثمار	\N	SAR	10.4786	\N	25.2400	\N	\N	2025-12-25 10:02:57.789434+02	\N	0.3861	16.5836	\N
3025	صندوق اليسر لمؤشر تداول الأسهم السعودية	الأول للاستثمار	\N	SAR	16.4999	\N	27.3200	\N	\N	2025-12-25 10:02:57.789435+02	\N	0.6462	16.1115	\N
1937	صندوق فالكم متعدد الأصول	شركة يقين المالية	\N	SAR	12.2318	\N	7.9700	\N	\N	2025-12-25 10:02:57.789436+02	\N	0.4622	16.8572	\N
2994	صندوق تمويل التجارة الدولية باليورو (السنبلة)	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	12.0186	\N	-0.0500	\N	\N	2025-12-25 10:02:57.789437+02	\N	-1.0511	1.5780	\N
1872	صندوق صائب للأسهم الأمريكية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	155.5685	\N	17.2500	\N	\N	2025-12-25 10:02:57.789437+02	\N	0.5969	37.9130	\N
1867	صندوق صائب للمرابحة	الإستثمار للأوراق المالية و الوساطة	\N	SAR	12.2655	\N	2.6100	\N	\N	2025-12-25 10:02:57.78944+02	\N	0.2265	6.8897	\N
1866	صندوق صائب للأسهم العالمية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	146.1799	\N	9.9700	\N	\N	2025-12-25 10:02:57.789441+02	\N	0.5157	42.5131	\N
1890	صندوق الراجحي للأسهم الخليجية المحمي(90%)	الراجحي المالية	\N	SAR	111.4995	\N	11.2600	\N	\N	2025-12-25 10:02:57.789438+02	\N	\N	\N	\N
1896	صندوق الراجحي للأسهم المحلية المحمي90%	الراجحي المالية	\N	SAR	115.2259	\N	12.2300	\N	\N	2025-12-25 10:02:57.789439+02	\N	\N	\N	\N
2003	صندوق كسب الأسهم القطرية	شركة قيمة المالية	\N	SAR	9.7118	\N	1.7300	\N	\N	2025-12-25 10:02:57.789443+02	\N	-0.7598	10.7100	\N
1887	صندوق الراجحي للمضاربة الشرعية بالبضائع – يورو	الراجحي المالية	\N	SAR	118.1417	\N	0.0800	\N	\N	2025-12-25 10:02:57.78958+02	\N	-4.8005	0.2892	\N
3746	صندوق دراية الشامل المتوازن	شركة دراية المالية	\N	SAR	10.4664	\N	0.3700	\N	\N	2025-12-25 10:02:57.78958+02	\N	1.1853	4.8652	\N
3001	صندوق دراية الشامل المحافظ	شركة دراية المالية	\N	SAR	10.6108	\N	1.8300	\N	\N	2025-12-25 10:02:57.789581+02	\N	0.7013	16.4985	\N
3002	صندوق دراية الشامل للنمو	شركة دراية المالية	\N	SAR	10.4171	\N	0.7400	\N	\N	2025-12-25 10:02:57.789582+02	\N	0.3792	8.2644	\N
2009	صندوق ميفك للأسهم السعودية	الشرق الأوسط للاستثمار المالي	\N	SAR	116.2181	\N	1.6400	\N	\N	2025-12-25 10:02:57.789583+02	\N	0.4914	21.5706	\N
3031	صندوق شعاع للمرابحة	شعاع كابيتال العربية السعودية	\N	SAR	103.4905	\N	0.7200	\N	\N	2025-12-25 10:02:57.789584+02	\N	-0.6545	1.1784	\N
1965	صندوق إتش إس بي سي أمانة للأسهم الأوروبية	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	8.1189	\N	8.2800	\N	\N	2025-12-25 10:02:57.789584+02	\N	-0.1602	51.2077	\N
1946	صندوق إتش إس بي سي أمانة لأسهم آسيا والمحيط الهادئ	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	12.0094	\N	7.7800	\N	\N	2025-12-25 10:02:57.789585+02	\N	0.2435	47.8051	\N
1893	صندوق الراجحي للأسهم العالمية الصاعدة	الراجحي المالية	\N	SAR	122.8390	\N	-0.8400	\N	\N	2025-12-25 10:02:57.789586+02	\N	0.2322	49.8137	\N
3026	صندوق بوابة الأسهم السعودية الاسلامي	شعاع كابيتال العربية السعودية	\N	SAR	116.8673	\N	8.9000	\N	\N	2025-12-25 10:02:57.789587+02	\N	0.9308	709.5973	\N
3032	صندوق بوابة الاسهم السعودية	شعاع كابيتال العربية السعودية	\N	SAR	108.7109	\N	4.5700	\N	\N	2025-12-25 10:02:57.789588+02	\N	0.2386	29.9960	\N
1981	جدوى للأسهم الأفريقية المرن	جدوى للإستثمار	\N	SAR	79.1320	\N	5.8700	\N	\N	2025-12-25 10:02:57.789588+02	\N	0.0560	49.6527	\N
1982	صندوق جدوى للنمو	جدوى للإستثمار	\N	SAR	102.1391	\N	7.3600	\N	\N	2025-12-25 10:02:57.789589+02	\N	0.0998	34.6549	\N
1985	صندوق جدوى للأسهم الناشئة	جدوى للإستثمار	\N	SAR	86.1338	\N	12.5100	\N	\N	2025-12-25 10:02:57.789591+02	\N	0.0072	65.4545	\N
1994	صندوق جدوى للأسهم العالمية	جدوى للإستثمار	\N	SAR	85.1103	\N	6.8500	\N	\N	2025-12-25 10:02:57.789592+02	\N	-0.0578	48.8271	\N
1984	صندوق جدوى المحافظ	جدوى للإستثمار	\N	SAR	106.0277	\N	2.0400	\N	\N	2025-12-25 10:02:57.789594+02	\N	-0.1276	5.7017	\N
1989	صندوق جدوى المتوازن	جدوى للإستثمار	\N	SAR	109.4681	\N	10.7400	\N	\N	2025-12-25 10:02:57.789594+02	\N	0.3022	55.8416	\N
1995	صندوق خليجية إنفست للأسهم السعودية	التوفيق المالية لإدارة المحافظ المالية وصناديق الاستثمار	\N	SAR	10.7161	\N	1.7300	\N	\N	2025-12-25 10:02:57.789596+02	\N	0.4346	24.7975	\N
1953	صندوق إتش إس بي سي لمؤشر السلع	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	6.6723	\N	-1.0900	\N	\N	2025-12-25 10:02:57.789422+02	\N	-2.5466	24.6105	\N
2026	صندوق الأهلي للاستثمار الوطني	شركة الأهلي المالية	\N	SAR	2.6163	\N	0.0200	\N	\N	2025-12-25 10:02:57.789423+02	\N	-1.7312	0.7319	\N
1940	صندوق فالكم المتداول للأسهم السعودية	شركة يقين المالية	\N	SAR	20.2400	\N	-4.5300	\N	\N	2025-12-25 10:02:57.789599+02	\N	-0.1772	20.4930	\N
1873	صندوق صائب للشركات الصناعية الخليجية	صائب بي ان بي باريبا لإدارة الأصول	\N	SAR	55.0979	\N	-3.0800	\N	\N	2025-12-25 10:02:57.7896+02	\N	-0.2371	72.1297	\N
2082	صندوق الأسهم الأوروبية -سامبا	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	8.6457	\N	-16.6100	\N	\N	2025-12-25 10:02:57.789601+02	\N	0.2025	56.3802	\N
2084	صندوق أسهم الشرق الأقصى	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	18.0352	\N	-12.6500	\N	\N	2025-12-25 10:02:57.789602+02	\N	1.0094	63.9610	\N
2087	صندوق الأسهم الدولية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	15.6410	\N	-9.0700	\N	\N	2025-12-25 10:02:57.789602+02	\N	0.1579	45.7714	\N
2098	صندوق أسهم أمريكا الشمالية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	6.2053	\N	-8.6800	\N	\N	2025-12-25 10:02:57.789603+02	\N	0.1362	42.2541	\N
2997	صندوق النمو الإندفاعي الأمريكي (التحدي)	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	11.6398	\N	-5.5600	\N	\N	2025-12-25 10:02:57.789605+02	\N	0.2983	47.1446	\N
2042	صندوق رسملة للأسهم السعودية	دلتا القابضة للإستثمارات المالية	\N	SAR	10.5657	\N	-11.0400	\N	\N	2025-12-25 10:02:57.789606+02	\N	0.2310	27.5883	\N
1942	فالكم للصكوك بالريال السعودي	شركة يقين المالية	\N	SAR	935.3704	\N	0.0700	\N	\N	2025-12-25 10:02:57.789607+02	\N	-1.4487	6.2664	\N
1980	صندوق الدرة للسيولة بالدولار الأمريكي	إتقان كابيتال	\N	SAR	10.1896	\N	0.5700	\N	\N	2025-12-25 10:02:57.789607+02	\N	-6.2735	0.3899	\N
1978	صندوق البرق للاتصالات	إتقان كابيتال	\N	SAR	9.9727	\N	-11.0700	\N	\N	2025-12-25 10:02:57.789608+02	\N	-0.9768	17.9156	\N
1935	فالكم للمرابحة باليورو	شركة يقين المالية	\N	SAR	1.0604	\N	0.1300	\N	\N	2025-12-25 10:02:57.78961+02	\N	-2.7264	0.5464	\N
1926	صندوق مؤشر الصفوة	عوده كابيتال - السعودية	\N	SAR	9.6325	\N	-16.3100	\N	\N	2025-12-25 10:02:57.789611+02	\N	-0.1513	21.5370	\N
1889	صندوق الراجحي للأسهم الأوروبية	الراجحي المالية	\N	SAR	136.5724	\N	5.9500	\N	\N	2025-12-25 10:02:57.789612+02	\N	0.3909	51.8553	\N
2032	صندوق الأهلي للمرابحة بالريال السعودي	شركة الأهلي المالية	\N	SAR	1.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789609+02	\N	\N	\N	\N
3749	صندوق القنديل للمرابحة والتعامل بمستندات التجارة	السعودي الفرنسي كابيتال	\N	SAR	100.0763	\N	0.0800	\N	\N	2025-12-25 10:02:57.789613+02	\N	-0.4743	9.2666	\N
2043	رسملة للأسهم السعودية شريعة	دلتا القابضة للإستثمارات المالية	\N	SAR	7.5276	\N	-36.2800	\N	\N	2025-12-25 10:02:57.789614+02	\N	-1.2346	41.5117	\N
2094	صندوق المتاجرة بالأسهم العالمية (المنال)	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	9.1528	\N	3.0200	\N	\N	2025-12-25 10:02:57.789615+02	\N	0.8264	43.1395	\N
2030	صندوق الاهلى النشط للمتاجرة بالاسهم السعودية	شركة الأهلي المالية	\N	SAR	1.1417	\N	-0.8100	\N	\N	2025-12-25 10:02:57.789617+02	\N	0.0000	NaN	\N
1998	صندوق كسب فلل الرحاب	شركة قيمة المالية	\N	SAR	14.5010	\N	19.1500	\N	\N	2025-12-25 10:02:57.789614+02	\N	\N	\N	\N
2091	صندوق الأسهم اليابانية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	7.7033	\N	1.1100	\N	\N	2025-12-25 10:02:57.789618+02	\N	0.1312	84.1920	\N
1920	صندوق العربي لسوق النقد الأمريكي	شركة العربي المالية	\N	SAR	13.1290	\N	0.1600	\N	\N	2025-12-25 10:02:57.789618+02	\N	0.2739	38.9002	\N
1972	صندوق الاستثمار قصير الأجل بالريال السعودي	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	18.5486	\N	0.2500	\N	\N	2025-12-25 10:02:57.78962+02	\N	0.1770	11.9172	\N
1976	صندوق الاستثمارات قصير الأجل بالدولار الأمريكي	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	17.2497	\N	0.3400	\N	\N	2025-12-25 10:02:57.789621+02	\N	0.5434	5432.9796	\N
1886	صندوق ولدي	الراجحي المالية	\N	SAR	191.9971	\N	1.5700	\N	\N	2025-12-25 10:02:57.789622+02	\N	0.3123	48.8683	\N
1902	صندوق الأهلي للمتاجرة بالريال السعودي	الراجحي المالية	\N	SAR	197.5389	\N	2.5200	\N	\N	2025-12-25 10:02:57.789623+02	\N	0.0000	NaN	\N
1913	صندوق المبارك للإكتتابات الأوليه	شركة العربي المالية	\N	SAR	10.2167	\N	0.5300	\N	\N	2025-12-25 10:02:57.789619+02	\N	\N	\N	\N
2036	الصندوق الأهلي للسندات العالمية	شركة الأهلي المالية	\N	SAR	1.4915	\N	0.5500	\N	\N	2025-12-25 10:02:57.789623+02	\N	1.3405	6.8711	\N
2086	صندوق السندات الدولية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	25.9485	\N	-0.4400	\N	\N	2025-12-25 10:02:57.789624+02	\N	0.2140	51.8140	\N
2088	صندوق أسواق النقد الدولية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	10.9211	\N	-2.6800	\N	\N	2025-12-25 10:02:57.789625+02	\N	-3.0530	18.6189	\N
2089	الصندوق الدولي المتوازن متوسط الأجل	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	25.6423	\N	-0.1100	\N	\N	2025-12-25 10:02:57.789626+02	\N	-0.3505	20.2615	\N
2092	الصندوق الدولي المتوازن طويل الأجل	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	21.1114	\N	-0.0500	\N	\N	2025-12-25 10:02:57.789626+02	\N	0.3304	38.7666	\N
1853	المتاجرة بالأسهم الأوربيه	شركة الأهلي المالية	\N	SAR	52.7546	\N	-6.9400	\N	\N	2025-12-25 10:02:57.789627+02	\N	-1.3501	75.9534	\N
1924	المتاجرة بالاسهم الاسيوية	شركة الأهلي المالية	\N	SAR	65.0106	\N	-4.1500	\N	\N	2025-12-25 10:02:57.789628+02	\N	-1.6184	72.1302	\N
3727	صندوق المرابحه بالدولار	الأول للاستثمار	\N	SAR	121.1998	\N	-0.0300	\N	\N	2025-12-25 10:02:57.789629+02	\N	9.1073	1.1948	\N
3750	صندوق الأسهم الأوروبية - الهولندى	الأول للاستثمار	\N	SAR	91.7931	\N	-10.7800	\N	\N	2025-12-25 10:02:57.78963+02	\N	-0.4607	68.7111	\N
3015	صندوق الأسهم الأمريكية - الهولندى	الأول للاستثمار	\N	SAR	126.4273	\N	-2.1100	\N	\N	2025-12-25 10:02:57.789631+02	\N	0.2685	47.4462	\N
3017	صندوق الأسهم الآسيوية	الأول للاستثمار	\N	SAR	274.9557	\N	-2.2900	\N	\N	2025-12-25 10:02:57.789631+02	\N	1.0960	78.9552	\N
1997	صندوق المتاجرة بالريال السعودي للمستثمر الخليجي	التوفيق المالية لإدارة المحافظ المالية وصناديق الاستثمار	\N	SAR	10.2342	\N	-0.2000	\N	\N	2025-12-25 10:02:57.789598+02	\N	-11.2893	0.2264	\N
6399	صندوق الإمارات دبي الوطني كابيتال المرن للأسهم السعودية	الإمارات دبي الوطني كابيتال السعودية	\N	SAR	9.4621	\N	0.0000	\N	\N	2025-12-25 10:02:57.789207+02	\N	\N	\N	\N
6390	صندوق الاستثمار كابيتال لشركات السوق الموازية - نمو	الإستثمار للأوراق المالية و الوساطة	\N	SAR	9.2364	\N	0.0000	\N	\N	2025-12-25 10:02:57.789261+02	\N	\N	\N	\N
4755	صندوق الأهلي سدكو للتطوير السكني	شركة الأهلي المالية	\N	SAR	0.3552	\N	-22.1200	\N	\N	2025-12-25 10:02:57.789281+02	\N	\N	\N	\N
2041	صندوق رنا للسيولة بالدولار	شركه رنا للاستثمار	\N	SAR	10.0900	\N	0.0000	\N	\N	2025-12-25 10:02:57.789636+02	\N	-48.9005	0.0988	\N
2005	صندوق كسب مخطط طيبة العقاري	شركة قيمة المالية	\N	SAR	12.5056	\N	12.0900	\N	\N	2025-12-25 10:02:57.789634+02	\N	\N	\N	\N
1901	صندوق الراجحي للاسهم المصرية	الراجحي المالية	\N	SAR	40.9600	\N	6.5600	\N	\N	2025-12-25 10:02:57.789637+02	\N	0.0000	NaN	\N
3004	صندوق السندات العالمية	السعودي الفرنسي كابيتال	\N	SAR	1.5011	\N	-3.8100	\N	\N	2025-12-25 10:02:57.789638+02	\N	0.0000	NaN	\N
3006	صندوق الأسهم الأوروبية	السعودي الفرنسي كابيتال	\N	SAR	1.1326	\N	-12.8200	\N	\N	2025-12-25 10:02:57.789638+02	\N	0.6584	474.1822	\N
3008	المتاجرة في الاسهم العالمية	السعودي الفرنسي كابيتال	\N	SAR	39.2211	\N	-15.0700	\N	\N	2025-12-25 10:02:57.789639+02	\N	-0.7056	47.5802	\N
3010	صندوق أمريكا الشمالية	السعودي الفرنسي كابيتال	\N	SAR	0.7268	\N	-4.3600	\N	\N	2025-12-25 10:02:57.78964+02	\N	-0.3609	38.6993	\N
1957	صندوق السندات العالميه	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	14.6276	\N	0.4700	\N	\N	2025-12-25 10:02:57.789641+02	\N	0.4235	53.3129	\N
1960	صندوق مؤشر الأسهم اليابانية	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	5.2929	\N	-22.7800	\N	\N	2025-12-25 10:02:57.789642+02	\N	0.2269	44.2865	\N
1961	محفظة ساب قليلة المخاطر	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	16.1976	\N	-8.4100	\N	\N	2025-12-25 10:02:57.789643+02	\N	0.0000	NaN	\N
1967	صندوق السندات السعودي	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	14.9332	\N	2.1600	\N	\N	2025-12-25 10:02:57.789645+02	\N	6.0030	1.5605	\N
1947	صندوق مؤشر الأسهم الآسيوية	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	24.0655	\N	-16.8500	\N	\N	2025-12-25 10:02:57.789646+02	\N	2.4843	47.8049	\N
1958	صندوق مؤشر الأسهم الأمريكية	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	14.2294	\N	-13.9600	\N	\N	2025-12-25 10:02:57.789646+02	\N	0.6115	41.2332	\N
6191	صندوق كامكو المرن للأسهم السعودية المتوافق مع المعايير الشرعية	شركة كامكو للاستثمار	\N	SAR	9.5083	\N	-4.9100	\N	\N	2025-12-25 10:02:57.788931+02	\N	-0.5130	18.4427	\N
2040	صندوق رنا للسيولة بالريال	شركه رنا للاستثمار	\N	SAR	9.7340	\N	0.0000	\N	\N	2025-12-25 10:02:57.789635+02	\N	-2.5965	8.4239	\N
5636	صندوق الراجحي إم إس سي أي لمؤشر الأسهم السعودية متعدد العوامل	الراجحي المالية	\N	SAR	16.8859	\N	-12.0800	\N	\N	2025-12-25 10:02:57.788952+02	\N	0.3677	16.3477	\N
2093	صندوق الخدمات المالية العالمية (المالى)	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	0.0000	\N	5.5000	\N	\N	2025-12-25 10:02:57.789647+02	\N	\N	\N	\N
3715	صندوق الرعاية الصحية العالمي (الشفاء)	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	0.0000	\N	5.5000	\N	\N	2025-12-25 10:02:57.789648+02	\N	\N	\N	\N
2998	صندوق التقنية العالمي	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	0.0000	\N	5.5000	\N	\N	2025-12-25 10:02:57.789649+02	\N	\N	\N	\N
5738	صندوق الريان ريزيدنس	شركة بلوم للاستثمار السعوديه	\N	SAR	0.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.78965+02	\N	\N	\N	\N
1945	صندوق إتش إس بي سي أمانة السعودي 20 المتداول	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	0.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789653+02	\N	\N	\N	\N
4025	صندوق شعاع السعودي الفندقي (1)	شعاع كابيتال العربية السعودية	\N	SAR	0.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789654+02	\N	\N	\N	\N
6179	صندوق الاستثمار كابيتال للشركات السعودية الصغيرة والمتوسطة	الإستثمار للأوراق المالية و الوساطة	\N	SAR	9.0926	\N	-11.6600	\N	\N	2025-12-25 10:02:57.788991+02	\N	-0.7382	16.2126	\N
6210	صندوق سيكو لأسهم الشرق الأوسط وشمال افريقيا - الفئة ب	سيكو كابيتال	\N	SAR	21.2922	\N	0.0000	\N	\N	2025-12-25 10:02:57.78902+02	\N	-0.0958	21.7092	\N
1871	صندوق الاستثمار كابيتال للمرابحة بالريال السعودي	الإستثمار للأوراق المالية و الوساطة	\N	SAR	17.1070	\N	5.0100	\N	\N	2025-12-25 10:02:57.789039+02	\N	0.0935	0.4863	\N
6225	صندوق سدكو كابيتال المرن للأسهم السعودية المعزز بالذكاء الاصطناعي	الشركة السعودية للإقتصاد والتنمية للأوراق المالية	\N	SAR	8.6373	\N	0.0000	\N	\N	2025-12-25 10:02:57.789041+02	\N	-1.9232	13.2358	\N
1930	صندوق أصول و بخيت للمتاجرة بالاسهم السعودية	شركة أصول وبخيت الاستثمارية	\N	SAR	4.0500	\N	-13.2600	\N	\N	2025-12-25 10:02:57.789084+02	\N	0.3253	21.3572	\N
5803	صندوق الاستثمار كابيتال المرن للأسهم السعودية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	14.6002	\N	-9.0900	\N	\N	2025-12-25 10:02:57.789115+02	\N	0.4859	14.9016	\N
5815	صندوق السعودي الفرنسي كابيتال للدخل الثابت - فئة أ	السعودي الفرنسي كابيتال	\N	SAR	10.8533	\N	3.7200	\N	\N	2025-12-25 10:02:57.789128+02	\N	0.7019	3.2674	\N
5816	صندوق السعودي الفرنسي كابيتال للدخل الثابت - فئة ب	السعودي الفرنسي كابيتال	\N	SAR	10.7592	\N	3.4200	\N	\N	2025-12-25 10:02:57.789129+02	\N	0.3479	3.1711	\N
5984	صندوق العربي المالية للفرص المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	14.2221	\N	-4.0900	\N	\N	2025-12-25 10:02:57.789224+02	\N	1.3210	24.8686	\N
5687	صندوق الإنماء الوقفي لمساجد الطرق	الإنماء المالية	\N	SAR	11.9911	\N	-6.9800	\N	\N	2025-12-25 10:02:57.789273+02	\N	2.3316	36.1638	\N
5583	صندوق مؤشر بلوم ام اس سي آي السعودي لعامل التباين الأدنى	شركة بلوم للاستثمار السعوديه	\N	SAR	173.5362	\N	-10.4900	\N	\N	2025-12-25 10:02:57.78928+02	\N	0.2949	14.9488	\N
4529	صندوق قيمة للتوزيعات	شركة قيمة المالية	\N	SAR	9.2845	\N	-2.6500	\N	\N	2025-12-25 10:02:57.789282+02	\N	-0.0863	26.0131	\N
3042	المتاجرة بالأسهم الأمريكية	شركة الأهلي المالية	\N	SAR	78.6571	\N	-2.2700	\N	\N	2025-12-25 10:02:57.789634+02	\N	-0.9615	60.4348	\N
5980	صندوق جي آي بي للمرابحة - الفئة أ	جي آي بي كابيتال	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789303+02	\N	\N	\N	\N
5760	صندوق ملكية العجلان ريڤييرا	شركة ملكية للاستثمار	\N	SAR	2.5500	\N	-79.4400	\N	\N	2025-12-25 10:02:57.789305+02	\N	\N	\N	\N
4536	صندوق الجزيرة للمشاريع السكنية 2	الجزيرة للأسواق المالية	\N	SAR	16.4252	\N	0.0000	\N	\N	2025-12-25 10:02:57.789318+02	\N	\N	\N	\N
1999	صندوق مدينة كسب	شركة قيمة المالية	\N	SAR	8.5085	\N	-7.2600	\N	\N	2025-12-25 10:02:57.789319+02	\N	\N	\N	\N
5620	صندوق الإنماء مكة العقاري	الإنماء المالية	\N	SAR	10.6600	\N	1.0300	\N	\N	2025-12-25 10:02:57.78932+02	\N	\N	\N	\N
2008	صندوق ميفك المدر للدخل العقاري	الشرق الأوسط للاستثمار المالي	\N	SAR	0.0000	\N	-100.0000	\N	\N	2025-12-25 10:02:57.789324+02	\N	\N	\N	\N
1914	صندوق ديار جدة العقاري المبارك	شركة العربي المالية	\N	SAR	0.1320	\N	-98.7900	\N	\N	2025-12-25 10:02:57.789325+02	\N	\N	\N	\N
5629	صندوق البلاد للمرابحة بالدولار الاميركي	البلاد للإستثمار	\N	SAR	0.0000	\N	-100.0000	\N	\N	2025-12-25 10:02:57.789328+02	\N	\N	\N	\N
1880	صندوق الجزيرة للمشاريع السكنية	الجزيرة للأسواق المالية	\N	SAR	81.0018	\N	-8.3600	\N	\N	2025-12-25 10:02:57.78933+02	\N	\N	\N	\N
5677	صندوق مزايا للمرابحات	مجموعة النفيعي للإستثمار	\N	SAR	9.4362	\N	-6.8900	\N	\N	2025-12-25 10:02:57.789331+02	\N	\N	\N	\N
5464	الصندوق الشامل للأسهم	مجموعة النفيعي للإستثمار	\N	SAR	6.7299	\N	-0.5000	\N	\N	2025-12-25 10:02:57.78929+02	\N	-0.4776	24.2446	\N
3986	صندوق الجزيرة لأسهم الأسواق العالمية الناشئة	الجزيرة للأسواق المالية	\N	SAR	134.5589	\N	-2.6900	\N	\N	2025-12-25 10:02:57.78929+02	\N	0.1844	26.9450	\N
2095	صنـدوق الأهلي المساهم الخليجي	شركة الأهلي المالية	\N	SAR	36.6678	\N	-0.8500	\N	\N	2025-12-25 10:02:57.789294+02	\N	0.2103	39.7120	\N
5688	صندوق الخبير الوقفي 1	الخبير المالية	\N	SAR	0.0000	\N	-100.0000	\N	\N	2025-12-25 10:02:57.789297+02	\N	-0.7167	75.9757	\N
5672	صندوق عوده للدخل	عوده كابيتال - السعودية	\N	SAR	7.9195	\N	-0.3800	\N	\N	2025-12-25 10:02:57.789298+02	\N	-2.1033	3.5718	\N
2056	صندوق الرياض لأسهم الأسواق الناشئة	الرياض المالية	\N	SAR	15.3375	\N	6.8100	\N	\N	2025-12-25 10:02:57.789299+02	\N	0.3137	35.8363	\N
5487	صندوق الأهلي العطاء للأسهم الخليجية	شركة الأهلي المالية	\N	SAR	15.4107	\N	-4.0000	\N	\N	2025-12-25 10:02:57.7893+02	\N	0.4452	19.6278	\N
3755	صندوق الأسواق المالية بالدولار الأمريكي	السعودي الفرنسي كابيتال	\N	SAR	29.8644	\N	916.3500	\N	\N	2025-12-25 10:02:57.789302+02	\N	0.2279	216.9425	\N
5908	صندوق جي آي بي لأسهم الشرق الأوسط وشمال أفريقيا بمعايير إي أس جي - أ	جي آي بي كابيتال	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789303+02	\N	0.0000	0.0000	\N
5813	صندوق جي آي بي للأسهم السعودية - الفئة أ	جي آي بي كابيتال	\N	SAR	10.0000	\N	0.0000	\N	\N	2025-12-25 10:02:57.789304+02	\N	0.0000	0.0000	\N
5689	صندوق الأهلي للصكوك السيادية -فئة أ	شركة الأهلي المالية	\N	SAR	10.1221	\N	0.0000	\N	\N	2025-12-25 10:02:57.789306+02	\N	-1.8403	4.6004	\N
5496	صندوق ثروات للأسهم السعودية	ثروات للأوراق المالية	\N	SAR	11.3315	\N	17.9100	\N	\N	2025-12-25 10:02:57.789307+02	\N	0.0884	9.3867	\N
1858	صندوق البلاد للأسهم الكويتية	البلاد للإستثمار	\N	SAR	0.5851	\N	0.1400	\N	\N	2025-12-25 10:02:57.789308+02	\N	-0.2189	48.0143	\N
2055	صندوق الرياض للأسهم الأوروبية	الرياض المالية	\N	SAR	57.8966	\N	-16.0600	\N	\N	2025-12-25 10:02:57.789309+02	\N	0.5065	30.1614	\N
2058	صندوق الرياض العقاري العالمي	الرياض المالية	\N	SAR	10.6578	\N	-22.1300	\N	\N	2025-12-25 10:02:57.78931+02	\N	0.1566	36.9233	\N
2060	صندوق الرياض للسندات الدولية	الرياض المالية	\N	SAR	12.1541	\N	-22.2600	\N	\N	2025-12-25 10:02:57.789311+02	\N	-0.2760	12.6922	\N
2062	صندوق الرياض للأسهم اليابانية	الرياض المالية	\N	SAR	1711.6300	\N	-15.5100	\N	\N	2025-12-25 10:02:57.789312+02	\N	0.2674	36.7079	\N
4532	صندوق الرياض العالمي للدخل	الرياض المالية	\N	SAR	10.7405	\N	-20.9300	\N	\N	2025-12-25 10:02:57.789317+02	\N	-0.0515	19.6330	\N
2078	صندوق الأهلي للأسهم الامريكية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	34.0797	\N	-0.1100	\N	\N	2025-12-25 10:02:57.78932+02	\N	1.0897	53.7089	\N
2079	صندوق الأهلي للأسهم الآسيوية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	16.1033	\N	-3.0300	\N	\N	2025-12-25 10:02:57.789321+02	\N	0.7675	25.1807	\N
2080	صندوق الأهلي للأسهم الأوروبية	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	16.2894	\N	-5.7900	\N	\N	2025-12-25 10:02:57.789322+02	\N	0.7254	28.6285	\N
2097	صندوق النفيس العالمي لأسهم السلع	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	11.0457	\N	5.0800	\N	\N	2025-12-25 10:02:57.789323+02	\N	0.1622	32.4834	\N
5502	صندوق وساطة للأسهم السعودية	الوساطة المالية	\N	SAR	1754.0200	\N	27.0400	\N	\N	2025-12-25 10:02:57.789324+02	\N	0.7883	49.3988	\N
1925	صندوق الفرص العربيه	عوده كابيتال - السعودية	\N	SAR	16.3027	\N	12.5700	\N	\N	2025-12-25 10:02:57.789327+02	\N	0.4079	33.9443	\N
1861	صندوق البلاد للأسهم العقارية الخليجية	البلاد للإستثمار	\N	SAR	0.5441	\N	1.7600	\N	\N	2025-12-25 10:02:57.789329+02	\N	-0.3756	37.0069	\N
5205	صندوق بيتك الواعد للاسهم السعودية	بيت التمويل السعودي الكويتي	\N	SAR	7.7877	\N	4.6000	\N	\N	2025-12-25 10:02:57.789332+02	\N	-0.6437	32.2100	\N
4599	صندوق بيتك المرن للأسهم السعودية	بيت التمويل السعودي الكويتي	\N	SAR	6.2347	\N	1.8300	\N	\N	2025-12-25 10:02:57.789332+02	\N	-0.7417	40.2963	\N
5447	صندوق دراية للطروحات الأولية	شركة دراية المالية	\N	SAR	6.1134	\N	-8.3200	\N	\N	2025-12-25 10:02:57.789336+02	\N	-1.8280	28.4794	\N
5572	صندوق أرباح للأسهم السعودية	أرباح المالية	\N	SAR	8.2916	\N	-7.0800	\N	\N	2025-12-25 10:02:57.789336+02	\N	-2.5984	24.7674	\N
4787	صندوق مُلكيّة للطروحات الأولية	شركة ملكية للاستثمار	\N	SAR	7.1363	\N	1.0700	\N	\N	2025-12-25 10:02:57.789337+02	\N	-1.0727	25.5573	\N
4870	صندوق مُلكيّة للأسهم السعودية	شركة ملكية للاستثمار	\N	SAR	0.0000	\N	-100.0000	\N	\N	2025-12-25 10:02:57.789338+02	\N	-1.0001	31.7610	\N
5981	صندوق جي آي بي للمرابحة - الفئة ب	جي آي بي كابيتال	\N	SAR	11.1357	\N	1.2500	\N	\N	2025-12-25 10:02:57.789287+02	\N	3.9500	0.4668	\N
4543	صندوق ميفك للطروحات الاولية	الشرق الأوسط للاستثمار المالي	\N	SAR	141.0851	\N	-0.0200	\N	\N	2025-12-25 10:02:57.78934+02	\N	0.8498	30.8671	\N
1884	صندوق النفيعى للمتاجرة بالأسهم السعودية	مجموعة النفيعي للإستثمار	\N	SAR	5.3918	\N	1.1500	\N	\N	2025-12-25 10:02:57.789341+02	\N	-1.1508	24.1394	\N
5476	صندوق الراجحي للطروحات الأولية	الراجحي المالية	\N	SAR	8.8359	\N	-2.7600	\N	\N	2025-12-25 10:02:57.789342+02	\N	-0.4496	31.4326	\N
1932	صندوق إي إف جي - هيرميس السعودي	المجموعة المالية هيرمس السعودية	\N	SAR	16.6349	\N	16.5800	\N	\N	2025-12-25 10:02:57.789344+02	\N	0.4738	40.0560	\N
4542	صندوق الأول للغذاء والرعاية الصحية	شركة الأول كابيتال	\N	SAR	7.0350	\N	1.4100	\N	\N	2025-12-25 10:02:57.789345+02	\N	-0.8907	15.6035	\N
5424	صندوق وساطة للطروحات الأولية	الوساطة المالية	\N	SAR	786.9894	\N	-0.2900	\N	\N	2025-12-25 10:02:57.789345+02	\N	-0.7913	15.5356	\N
5492	صندوق الأول للطروحات الأولية	شركة الأول كابيتال	\N	SAR	9.0141	\N	4.5600	\N	\N	2025-12-25 10:02:57.789346+02	\N	-0.9009	19.1611	\N
5416	صندوق بلوم للطروحات الأولية السعودية	شركة بلوم للاستثمار السعوديه	\N	SAR	821.5302	\N	-1.3500	\N	\N	2025-12-25 10:02:57.789347+02	\N	-1.0526	20.5342	\N
1923	صندوق أرباح للطروحات الأولية	أرباح المالية	\N	SAR	15.0912	\N	-12.7600	\N	\N	2025-12-25 10:02:57.789348+02	\N	0.5901	27.4993	\N
5565	صندوق عودة للمرابحة	عوده كابيتال - السعودية	\N	SAR	10.2331	\N	1.1000	\N	\N	2025-12-25 10:02:57.789349+02	\N	-0.6562	1.5848	\N
5441	صندوق صائب للأسهم الخليجية ذات الدخل	الإستثمار للأوراق المالية و الوساطة	\N	SAR	59.5736	\N	-10.2900	\N	\N	2025-12-25 10:02:57.78935+02	\N	-1.9117	27.9461	\N
1863	صندوق صائب للشركات العربية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	84.9105	\N	-1.7600	\N	\N	2025-12-25 10:02:57.78935+02	\N	0.0637	46.3724	\N
5378	صندوق مسقط المالية للطروحات الأولية	سيكو كابيتال	\N	SAR	7.3250	\N	-25.2000	\N	\N	2025-12-25 10:02:57.789351+02	\N	-0.9840	29.6073	\N
5379	صندوق أشمور للطروحات الأولية	أشمور للإستثمار السعودية	\N	SAR	6.3894	\N	-26.8600	\N	\N	2025-12-25 10:02:57.789352+02	\N	-1.0058	39.1498	\N
5442	صندوق ميفك للأسهم المحلية	الشرق الأوسط للاستثمار المالي	\N	SAR	97.2368	\N	10.8200	\N	\N	2025-12-25 10:02:57.789353+02	\N	-0.0927	29.0056	\N
3041	صندوق المستثمر للمرابحة بالريال	المستثمر للأوراق المالية	\N	SAR	11.8434	\N	0.1500	\N	\N	2025-12-25 10:02:57.789354+02	\N	-0.7506	2.3266	\N
5190	صندوق الیسر للاكتتابات الأولیة	الأول للاستثمار	\N	SAR	7.9605	\N	-11.4700	\N	\N	2025-12-25 10:02:57.789356+02	\N	-0.5885	17.6415	\N
3757	صندوق اليسر للأسهم الخليجية	الأول للاستثمار	\N	SAR	13.0766	\N	4.2000	\N	\N	2025-12-25 10:02:57.789357+02	\N	0.1672	15.2294	\N
3014	صندوق الأمان متعدد الأصول	الأول للاستثمار	\N	SAR	13.7208	\N	0.0900	\N	\N	2025-12-25 10:02:57.789358+02	\N	-0.1866	3.0309	\N
3016	صندوق اليسر الأمان متعدد الأصول	الأول للاستثمار	\N	SAR	12.5482	\N	-1.3100	\N	\N	2025-12-25 10:02:57.789359+02	\N	-2.0283	1.6855	\N
3029	صندوق الميزان المتعدد الأصول	الأول للاستثمار	\N	SAR	19.2793	\N	-0.0200	\N	\N	2025-12-25 10:02:57.78936+02	\N	0.1694	9.6692	\N
3030	صندوق اليسر الميزان متعدد الأصول	الأول للاستثمار	\N	SAR	12.8645	\N	-1.1100	\N	\N	2025-12-25 10:02:57.789361+02	\N	-0.2867	5.5343	\N
3034	صندوق الطموح المتعدد الأصول	الأول للاستثمار	\N	SAR	24.3048	\N	5.8900	\N	\N	2025-12-25 10:02:57.789362+02	\N	0.2436	18.9947	\N
3037	صندوق اليسر الطموح المتعدد الأصول	الأول للاستثمار	\N	SAR	15.0287	\N	-2.0900	\N	\N	2025-12-25 10:02:57.789363+02	\N	0.1535	20.4297	\N
1885	الأولى جوجيت - صندوق الجوهر للأسهم السعودية	الأولى جيوجيت كابيتال	\N	SAR	8.7950	\N	-12.1000	\N	\N	2025-12-25 10:02:57.789363+02	\N	-0.2952	23.6083	\N
3747	صندوق النقاء للأسهم الآسيوية النامية	السعودي الفرنسي كابيتال	\N	SAR	20.7973	\N	6.0300	\N	\N	2025-12-25 10:02:57.78937+02	\N	0.4549	31.5607	\N
3007	صندوق الفرسان للمتاجرة بأسهم البرازيل وروسيا والهند والصين	السعودي الفرنسي كابيتال	\N	SAR	18.2497	\N	6.7200	\N	\N	2025-12-25 10:02:57.789374+02	\N	0.3712	52.1100	\N
1864	صندوق صناديق صائب	الإستثمار للأوراق المالية و الوساطة	\N	SAR	15.4179	\N	8.9400	\N	\N	2025-12-25 10:02:57.789421+02	\N	0.6554	23.8722	\N
2015	صندوق الأهلي النشط للمتاجرة بالأسهم السعودية - أ	شركة الأهلي المالية	\N	SAR	1.2291	\N	9.6800	\N	\N	2025-12-25 10:02:57.78943+02	\N	0.7044	496.3952	\N
2591	صندوق الطروحات الأولية الخليجية للمستثمر الخليجي	التوفيق المالية لإدارة المحافظ المالية وصناديق الاستثمار	\N	SAR	10.0020	\N	0.1200	\N	\N	2025-12-25 10:02:57.789595+02	\N	-0.0076	27.3251	\N
1996	صندوق الخليجية إنفست لمؤشر أس أند بي للأسهم السعودية	التوفيق المالية لإدارة المحافظ المالية وصناديق الاستثمار	\N	SAR	10.5218	\N	1.8000	\N	\N	2025-12-25 10:02:57.789597+02	\N	0.3416	25.4122	\N
1979	صندوق الأساس للأسهم المصرية	التوفيق المالية لإدارة المحافظ المالية وصناديق الاستثمار	\N	SAR	8.4706	\N	-15.4300	\N	\N	2025-12-25 10:02:57.78961+02	\N	-1.6837	27.5718	\N
2011	محفظة المرابحة المتميزة	شركة الأهلي المالية	\N	SAR	99.1610	\N	-0.0300	\N	\N	2025-12-25 10:02:57.789633+02	\N	-1.3400	11.2793	\N
1974	صندوق الإستثمار القصير الأجل بالجنيه الإسترليني	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	16.8285	\N	3.6500	\N	\N	2025-12-25 10:02:57.789644+02	\N	3.0923	2.0832	\N
2033	صندوق الأهلي للمتاجرة بالريال السعودي	شركة الأهلي المالية	\N	SAR	2.2697	\N	5.0400	\N	\N	2025-12-25 10:02:57.788945+02	\N	-4.5998	0.3207	\N
2068	صندوق الرياض للأسهم الخليجية - باستثناء السعودية	الرياض المالية	\N	SAR	17.5444	\N	13.3600	\N	\N	2025-12-25 10:02:57.788965+02	\N	0.2363	24.5704	\N
6187	صندوق أشمور للأسهم السعودية المتوافق مع المعايير الشرعية - الفئة ب	أشمور للإستثمار السعودية	\N	SAR	8.9269	\N	-11.0900	\N	\N	2025-12-25 10:02:57.788999+02	\N	-1.7445	17.3501	\N
5541	صندوق الأهلي للأسهم العالمية	شركة الأهلي المالية	\N	SAR	1.3090	\N	-3.6400	\N	\N	2025-12-25 10:02:57.78934+02	\N	1.4323	16.1407	\N
5674	صندوق سيكو لأسهم الشرق الأوسط وشمال افريقيا - الفئة أ	سيكو كابيتال	\N	SAR	21.3927	\N	3.5700	\N	\N	2025-12-25 10:02:57.788996+02	\N	0.7968	16.7016	\N
6231	صندوق العربي المالية متعدد الأصول للنمو المتوافق مع المعايير الشرعية	شركة العربي المالية	\N	SAR	9.7308	\N	0.0000	\N	\N	2025-12-25 10:02:57.789048+02	\N	-0.8818	15.2212	\N
6253	صندوق العربي المالية للأسهم الرقمية و التقنية المتوافق مع الشريعة	شركة العربي المالية	\N	SAR	9.7429	\N	0.0000	\N	\N	2025-12-25 10:02:57.789226+02	\N	-1.8073	24.6412	\N
1938	صندوق فالكم المتداول لقطاع البتروكيماويات	شركة يقين المالية	\N	SAR	24.7500	\N	-2.1000	\N	\N	2025-12-25 10:02:57.789598+02	\N	0.4879	24.3994	\N
6232	صندوق العربي المالية متعدد الأصول المتحفظ المتوافق مع المعايير الشرعية	شركة العربي المالية	\N	SAR	10.2728	\N	0.0000	\N	\N	2025-12-25 10:02:57.789049+02	\N	1.0836	4.6618	\N
5484	أصول و بخيت للمتاجرة بأسهم الاصدارات الأولية المتوافقة مع الضوابط الشرعية	شركة أصول وبخيت الاستثمارية	\N	SAR	1.5444	\N	-22.3600	\N	\N	2025-12-25 10:02:57.789066+02	\N	0.1263	14.9252	\N
1950	صندوق الأول للاستثمار لأسھم الشركات السعودیة	الأول للاستثمار	\N	SAR	62.2806	\N	-11.5400	\N	\N	2025-12-25 10:02:57.789099+02	\N	0.6443	40.9562	\N
1962	صندوق الأول للإستثمار المتوازن للأصول المتنوعة	الأول للاستثمار	\N	SAR	34.5084	\N	9.4300	\N	\N	2025-12-25 10:02:57.789113+02	\N	0.8989	14.3038	\N
1973	صندوق الأول للإستثمار للمرابحة بالریال السعودي	الأول للاستثمار	\N	SAR	19.6674	\N	4.9100	\N	\N	2025-12-25 10:02:57.789125+02	\N	-2.7033	0.3805	\N
6073	صندوق الأهلي متعدد الأصول للنمو بالريال	شركة الأهلي المالية	\N	SAR	9.2468	\N	-7.7000	\N	\N	2025-12-25 10:02:57.789132+02	\N	-0.6708	12.7271	\N
5575	صندوق أصول و بخيت للمتاجرة بأسهم السوق الموازية	شركة أصول وبخيت الاستثمارية	\N	SAR	4.0492	\N	-26.5000	\N	\N	2025-12-25 10:02:57.789144+02	\N	1.8723	43.4793	\N
2019	صندوق الأهلي الخليجي للنمو والدخل	شركة الأهلي المالية	\N	SAR	2.3332	\N	-7.4600	\N	\N	2025-12-25 10:02:57.789162+02	\N	0.3244	15.6907	\N
4075	صندوق الجزيرة لتوزيع الأصول - استراتيجية النمو	الجزيرة للأسواق المالية	\N	SAR	247.6800	\N	11.4300	\N	\N	2025-12-25 10:02:57.789171+02	\N	0.8449	13.6621	\N
2035	صندوق الأهلي للمتاجرة بالأسهم السعودية	شركة الأهلي المالية	\N	SAR	15.8651	\N	-10.4000	\N	\N	2025-12-25 10:02:57.789186+02	\N	0.3618	29.3203	\N
6150	صندوق جمعيات السقيا الوقفي	الراجحي المالية	\N	SAR	0.9716	\N	-2.0200	\N	\N	2025-12-25 10:02:57.789207+02	\N	-0.6818	10.7424	\N
5910	صندوق جي آي بي لأسهم الشرق الأوسط وشمال أفريقيا بمعايير إي أس جي - ب	جي آي بي كابيتال	\N	SAR	9.6581	\N	0.0000	\N	\N	2025-12-25 10:02:57.789212+02	\N	-0.5266	15.1802	\N
6084	صندوق جي آي بي لأسهم الشركات السعودية الصغيرة والمتوسطة - الفئة ج	جي آي بي كابيتال	\N	SAR	9.4431	\N	-14.0600	\N	\N	2025-12-25 10:02:57.78924+02	\N	-0.2773	31.1153	\N
5622	صندوق البلاد للاستثمار في صناديق الاستثمار العقارية المتداولة	البلاد للإستثمار	\N	SAR	8.4167	\N	-5.3400	\N	\N	2025-12-25 10:02:57.789251+02	\N	-0.3215	18.0509	\N
4523	صندوق ديم للأسهم السعودية	المستثمرون الخليجيون لإدارة الأصول	\N	SAR	109.8871	\N	-6.3400	\N	\N	2025-12-25 10:02:57.78939+02	\N	0.2368	32.1258	\N
1943	صندوق جلوبل للأسهم السعودية المتوافق مع أحكام الشريعة الإسلامية	شركة كامكو للاستثمار	\N	SAR	197.0886	\N	-2.0700	\N	\N	2025-12-25 10:02:57.789403+02	\N	0.7178	31.0487	\N
1970	صندوق مؤشر إتش إس بي سي للأسهم السعودية	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	7.1917	\N	10.0300	\N	\N	2025-12-25 10:02:57.789442+02	\N	-0.1311	35.3391	\N
3043	صندوق وطن للاسهم المحلية	وطن للإستثمار و أعمال الأوراق المالية	\N	SAR	12.1323	\N	20.4000	\N	\N	2025-12-25 10:02:57.789593+02	\N	0.6331	29.5705	\N
2100	صندوق السيولة باليورو (الرزين)	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	11.9133	\N	0.4700	\N	\N	2025-12-25 10:02:57.789604+02	\N	-0.6092	1.6604	\N
3000	صندوق الأسهم الدولية وتمويل التجارة (الوسط)	شركة سامبا كابيتال للأصول وإدارة الاستثمار	\N	SAR	27.9107	\N	0.6700	\N	\N	2025-12-25 10:02:57.789616+02	\N	1.3149	17.9706	\N
4077	صندوق الجزيرة لتوزيع الأصول - الاستراتيجية المتوازنة	الجزيرة للأسواق المالية	\N	SAR	194.4260	\N	10.1900	\N	\N	2025-12-25 10:02:57.789175+02	\N	0.8015	8.8503	\N
1956	صندوق مؤشر الأسهم الأوروبية	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	14.1380	\N	-33.7200	\N	\N	2025-12-25 10:02:57.789642+02	\N	0.8342	42.4825	\N
5905	صندوق الأهلي العالمي للقطاعات الواعدة	شركة الأهلي المالية	\N	SAR	1.0725	\N	-2.5600	\N	\N	2025-12-25 10:02:57.789283+02	\N	0.0403	17.5119	\N
3724	صندوق الأهلي الرائـد الخليجي	شركة الأهلي المالية	\N	SAR	39.9160	\N	-3.2700	\N	\N	2025-12-25 10:02:57.789284+02	\N	0.4372	104.6449	\N
5582	صندوق الأهلي الجود للأسهم الخليجية	شركة الأهلي المالية	\N	SAR	13.6026	\N	-3.3600	\N	\N	2025-12-25 10:02:57.789301+02	\N	0.3890	16.8168	\N
2069	صندوق الرياض للأسهم الاسيوية	الرياض المالية	\N	SAR	67.5344	\N	-19.2100	\N	\N	2025-12-25 10:02:57.789316+02	\N	0.8457	36.2237	\N
1955	صندوق إتش إس بي سي لأسهم الأسواق العالمية الناشئة	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	13.5041	\N	4.6100	\N	\N	2025-12-25 10:02:57.789326+02	\N	0.5685	166.9922	\N
5481	صندوق الأهلي للطروحات الأولية	شركة الأهلي المالية	\N	SAR	0.8977	\N	0.7300	\N	\N	2025-12-25 10:02:57.789339+02	\N	-0.4310	18.8143	\N
5468	صندوق المجموعة المالية هيرميس حصاد المرن للاسهم السعودية	المجموعة المالية هيرمس السعودية	\N	SAR	10.7493	\N	14.8800	\N	\N	2025-12-25 10:02:57.789343+02	\N	0.2769	34.2466	\N
5480	صندوق صائب للطروحات الأولية السعودية	الإستثمار للأوراق المالية و الوساطة	\N	SAR	81.3731	\N	-12.8200	\N	\N	2025-12-25 10:02:57.789355+02	\N	-0.8399	15.2945	\N
4535	صندوق الجوهر للأسهم السعودية المتوافق مع معايير الهيئة الشرعية	الأولى جيوجيت كابيتال	\N	SAR	4.1306	\N	-7.6200	\N	\N	2025-12-25 10:02:57.789364+02	\N	-1.8809	33.3557	\N
5533	صندوق سدكو كابيتال المرن للأسهم السعودية	الشركة السعودية للإقتصاد والتنمية للأوراق المالية	\N	SAR	116.2886	\N	-0.3100	\N	\N	2025-12-25 10:02:57.789328+02	\N	1.6394	17.8604	\N
6168	صندوق سدكو كابيتال للطروحات الأولية	الشركة السعودية للإقتصاد والتنمية للأوراق المالية	\N	SAR	7.6745	\N	-27.8800	\N	\N	2025-12-25 10:02:57.788978+02	\N	-2.3020	10.8189	\N
5702	صندوق جدوى للمرابحة بالريال السعودي - الفئة ج	جدوى للإستثمار	\N	SAR	12.0133	\N	4.9500	\N	\N	2025-12-25 10:02:57.789026+02	\N	-1.7447	0.3106	\N
1966	صندوق إتش إس بي سي لفرص الأسهم البتروكيماوية السعودية	إتش إس بي سي العربية السعودية المحدودة	\N	SAR	8.8543	\N	2.7900	\N	\N	2025-12-25 10:02:57.789375+02	\N	0.4655	25.6507	\N
\.


--
-- PostgreSQL database dump complete
--

\unrestrict gKTstQ6gr2lOyd28GPww4KlyNhyJbdD6UQ4Xngah51CBndRWv8ehQE9fYc6vyA6

